from flet import *
import time
import threading
import math
from threading import Thread ,Timer
from flet import SnackBar, Text
import random
import webbrowser
import httpx
import json
import geocoder
import requests
import socket
import os
from datetime import datetime, timedelta


def handle_back_button(page: Page):
    if len(page.views) > 1:
        # إذا كان هناك أكثر من عرض في المكدس، ارجع للخلف
        page.views.pop()
        top_view = page.views[-1]
        page.go(top_view.route)
    else:
        # إذا كان هذا هو العرض الأخير، أغلق التطبيق
        page.window_destroy()

# ============ الثوابت والإعدادات العامة ============
APP_TITLE = "القريب - أذكار المسلم"
APP_SIZE = (390, 740)
APP_POSITION = (960, 10)
APP_BGCOLOR = "#242a57"
FONT_NAME = "assets/fonts/alfont_com_AlFont_com_137-UthmanTN1-Ver10.otf"
FONT_FILE = "assets/fonts/alfont_com_AlFont_com_137-UthmanTN1-Ver10.otf"
BUTTON_FONT = "assets/fonts/alfont_com_AlFont_com_137-UthmanTN1-Ver10.otf"  # خط جديد للأزرار
APP_ICON = "assets/icons/icon.png.png"  # مسار أيقونة التطبيق
icon = "icon.png.png"
DEFAULT_FONT_SIZE = 18
MIN_FONT_SIZE = 14
MAX_FONT_SIZE = 30
current_font_size = DEFAULT_FONT_SIZE
# تعريف مسارات الأيقونات
CUSTOM_ICONS = {
    "morning": "assets/icons/azkar_sabah.png.png",
    "night": "assets/icons/azkar_masaa.png.png",
    "mosque": "assets/icons/azkar_baad_salah.png.png",
    "prayer": "assets/icons/alsalat_ealaa_alnabii.png.png",
    "book": "assets/icons/ayat_alkursii.png.png",
    "star": "assets/icons/azkar_azima.png.png",
    "dua": "assets/icons/adeiat_wa_azkar_mutanawiea.png.png",
    "moon": "assets/icons/adeiat_llmtwffy.png.png",
    "qibla": "assets/icons/qibla.png.png",
    "library": "assets/icons/library.png.png",
    "learn_prayer": "assets/icons/prayer_icon.png.png",
    "quran": "assets/icons/quran.png.png",  # أيقونة جديدة للقرآن
    "tasbih": "assets/icons/tasbih_icon.png", # أيقونة جديدة للسبحة
    "kok": "assets/icons/sadaqa_gariya.png.png",
    "sleep": "assets/icons/sleep.png.png",
    "Nabawi": "assets/icons/Nabawi_Mosque.png.png",
    "prayer_time": "assets/icons/prayer_time.png.png",
    "wudu": "assets/icons/wudhu.png.png",
    "1a": "assets/icons/crescent.png.png",
    "2a": "assets/icons/sunrise.png.png",
    "3a": "assets/icons/weather.png.png",
    "4a": "assets/icons/sun.png.png",
    "5a": "assets/icons/cleary.png.png",
    "6a": "assets/icons/sunset.png.png",
    "7a": "assets/icons/momok.png.png",
    "8a": "assets/icons/aljumuea.png.png",
    "sunan": "assets/icons/sunna_mawqota.png.png",
    "info": "assets/icons/info.png",
    "settings": "assets/icons/settings.png",
    "share": "assets/icons/share.png",



    "1aa": "assets/icons/wodu50.png",
    "2aa": "assets/icons/azaan10.png.png",
    "3aa": "assets/icons/mosque34.png",
    "4aa": "assets/icons/baadsalao.png.png",
    "5aa": "assets/icons/food.png",
    "6aa": "assets/icons/handshake.png",
    "7aa": "assets/icons/clothes.png",
    "8aa": "assets/icons/sneeze.png",
    "9aa": "assets/icons/smiley.png",
    "10aa": "assets/icons/rubelhizb.png",
    "11aa": "assets/icons/prayer67.png",
    "12aa": "assets/icons/allah1.png",
    "untimed_sunan": "assets/icons/untimed_sunan.png.png",
}

BUTTON_GRADIENTS = {
    "1a": ["#18545F", "#515050"],
    "2a": ["#5D4434", "#C2E9FB"],
    "3a": ["#416177", "#FAD0C4"],
    "4a": ["#1E6736", "#8FD3F4"],
    "5a": ["#1C475C", "#FCB69F"],
    "6a": ["#66292A", "#C6C1C5"],
    "7a": ["#866686", "#C2E9FB"],
    "8a": ["#2C5E5F", "#FAD0C4"],

    "1aa": ["#22596F", "#515050"],
    "2aa": ["#457F2F", "#305262"],
    "3aa": ["#35766C", "#135037"],
    "4aa": ["#163347", "#8FD3F4"],
    "5aa": ["#4E5719", "#FCB69F"],
    "6aa": ["#2E505D", "#C6C1C5"],
    "7aa": ["#5E355E", "#C2E9FB"],
    "8aa": ["#0C3946", "#5E443D"],
    "9aa": ["#1D6468", "#FAD0C4"],
    "10aa": ["#0D4D0E", "#FAD0C4"],
    "11aa": ["#553824", "#FAD0C4"],
    "12aa": ["#5B295B", "#FAD0C4"],
}


# بيانات السنن الموقوتة
timed_sunan = {
    "before_fajr": [
        {"text": "يٌسَنُّ لمن استيقظ من النوم ما يلي :\n\n(1) يَشُوصُ فاه بالسِّواك.\n\nعن حذيفة - رضي الله عنه - قال:كان النبي - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - اذا قام من الليل يشوص فاه بالسواك رواه البخاري برقم (245) ، رواه مسلم برقم (255)، ولمسلم في رواية :كان رسول الله - صلى الله عليه وسلم - اذا قام ليتهجد، يشوص فاه بالسواك رواه مسلم برقم (255) . والشوص : دلك الاسنان عرضا بالسواك ."},
        {"text": "(2) يقول الذكر الوارد عند الاستيقاظ من النَّوم .\n\nوهو ما جاء في صحيح البخاري من حديث حذيفة -رضي الله عنه- قال : كَانَ النَّبِيُّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - إِذَا أَرَادَ أَنْ يَنَامَ قَالَ : بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَ أَحْيَا وَإِذَا اسْتَيْقَظَ مِنْ مَنَامِهِ قَالَ: الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ رواه البخاري برقم (6324). ورواه مسلم من حديث البراء - رضي الله عنه -. رواه مسلم برقم (2711). "},
        {"text": "(3) يمسح النوم عن وجهه.\n\n (4) وينظر إلى السماء.\n\n (5) ويقرأ الآيات العشر الأخيرة من سورة آل عمران . \n\n وهذه السنة جاءت في حديث ابن عباس - رضي الله عنهما - المتفق عليه :  أَنَّهُ  بَاتَ لَيْلَةً عِنْدَ مَيْمُونَةَ زَوْجِ النَّبِيِّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - وَهِيَ خَالَتُهُ فَاضْطَجَعْتُ فِي عَرْضِ الْوِسَادَةِ ، وَاضْطَجَعَ رَسُولُ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - وَأَهْلُهُ فِي طُولِهَا ، فَنَامَ رَسُولُ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - حَتَّى إِذَا انْتَصَفَ اللَّيْلُ ، أَوْ قَبْلَهُ بِقَلِيلٍ ، أَوْ بَعْدَهُ بِقَلِيلٍ ، اسْتَيْقَظَ رَسُولُ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - فَجَلَسَ يَمْسَحُ النَّوْمَ عَنْ وَجْهِهِ بِيَدِهِ ، ثُمَّ قَرَأَ الْعَشْرَ الْآيَاتِ الْخَوَاتِمَ مِنْ سُورَةِ آلِ عِمْرَانَ ، ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقَةٍ فَتَوَضَّأَ مِنْهَا فَأَحْسَنَ وُضُوءَهُ ، ثُمَّ قَامَ يُصَلِّي . رواه البخاري برقم (183) ، رواه مسلم برقم (763) .وفي رواية لمسلم (256): فَقَامَ نَبِيُّ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - مِنْ آخِرِ اللَّيْلِ، ثُمَّ خَرَجَ فَنَظَرَ إِلى السَّمَاءِ، ثُمَّ تَلاَ هذِهِ الآيَةَ فِي آلِ عِمْرَانَ: إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالأَرْضِ وَاخْتِلاَفِ اللَّيْلِ وَالنَّهَارِ لآيَاتٍ لِّأُوْلِي الألْبَابِ...[آل عمران190 ].وفي رواية مسلم بيانٌ لِمَا يقرأه من أراد تطبيق هذه السُّنَّة ، فإنه يبدأ من قوله تعالى : إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالأَرْضِ وَاخْتِلاَفِ اللَّيْلِ وَالنَّهَارِ إلى خاتمة آل عمران ."},
        {"text": "(6) يغسل يديه ثلاثاً.\n\n لحديث أبِي هريرة - رضي الله عنه - أَنَّ النَّبِيَّ - صلَّى الله عليه وسلَّم – قال :  إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ، فَلاَ يُدْخِلُ يَدَهُ فِي الإِنَاء حتَّى يَغْسِلَهَا ثَلاَثاً، فَإِنَّهُ لاَ يَدْرِي أَيْنَ بَاتَتْ يَدُهُ  رواه البخاري برقم (162) ، رواه مسلم برقم (278) . "},
        {"text": "(7) أن يستنشق ويستنثر بالماء ثلاثاً .\n\nلحديث أبي هريرة - رضي الله عنه - أَنَّ النَّبيَّ - صلَّى الله عليه وسلَّم - قَالَ: إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ مَنَامِهِ فَلْيَسْتَنْثِرْ ثَلاَثَ مَرَّاتٍ، فَإِنَّ الشَّيْطَانَ يَبِيتُ عَلَى خَيَاشِيمِهِ  رواه البخاري برقم (3295) ، رواه مسلم برقم (238) . ، وفي رواية البخاري :إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ مَنَامِهِ فَتَوَضَّأَ فَلْيَسْتَنْثِرْ ثَلَاثًا... رواه البخاري برقم (3295) . "},
        {"text": "(8)ثم يتوضأ . \n\n لحديث ابن عباس - رضي الله عنهما - المتقدِّم حينما أراد النَّبيُّ - صلَّى الله عليه وسلَّم - الصَّلاة ، قام إلى قِرْبة معلَّقة فتوضأ منها .وفيه: ... ثُمَّ قَامَ إِلَى شَنٍّ مُعَلَّقَةٍ فَتَوَضَّأَ مِنْهَا فَأَحْسَنَ وُضُوءَهُ ، ثُمَّ قَامَ يُصَلِّي . رواه البخاري برقم (183) ، رواه مسلم برقم (763) . "},
        {"text": "القيام لليل, والوتر : \n\n (1) من السُّنَّة أن يصلِّي صلاة الليل في وقتها الأفضل . \n\n من السُّنَّة أن يصلِّي صلاة الليل في وقتها الأفضل .فإن قيل : ما هو أفضل وقت لصلاة الليل ؟ فالجواب: من المعلوم أنَّ وقت صلاة الوتر يبتدئ من بعد صلاة العشاء إلى طلوع الفجر ، فصلاة الوتر محلها ما بين صلاة العشاء والفجر.ويدلّ عليه:حديث عائشة - رضي الله عنها- قالت : كَانَ رَسُولُ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يُصَلِّي فِيمَا بَيْنَ أَنْ يَفْرُغَ مِنْ صَلاَةِ الْعِشَاءِ إِلَى الْفَجْرِ، إِحْدَى عَشْرَةَ رَكْعَةً ، يُسَلِّمُ بَيْنَ كُلِّ رَكْعَتَيْنِ، وَيُوتِرُ بِوَاحِدَةٍ  رواه البخاري برقم (2031) ، رواه مسلم برقم (736).- أمَّا عن أفضل وقت لصلاة الليل فهو : ثلث الليل بعد نصفه .والمقصود: أنَّ الإنسان يُقَسِّم الليل أنصافاً ، ويقوم في الثلث من نصف الليل الثاني ، وفي آخر الليل ينام ، أي : أنه يقوم في السدس الرابع ، والخامس ، وينام في السدس السادس.ويدل عليه : حديث عَبْدِ اللّهِ بْنِ عَمْرو- رضي الله عنهما - قال: قَالَ رَسُولُ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ -: إِنَّ أَحَبَّ الصِّيَامِ إِلَى اللّهِ صِيَامُ دَاوُدَ ، وَأَحَبَّ الصَّلاَةِ إِلَى اللّهِ صَلاَةُ دَاوُدَ - عليه السلام - ، كَانَ يَنَامَ نِصْفَ اللَّيْلِ، وَيَقُومُ ثُلُثَهُ ، وَيَنَامُ سُدُسَهُ، وَكَانَ يَصُومُ يَوْماً وَيُفْطِرُ يَوْماً  رواه البخاري برقم (3420) ، رواه مسلم برقم (1159) .- لو أراد الإنسان تطبيق هذه السُّنَّة ، فكيف يكون حسابه للّيل ؟يحسب الوقت من غروب الشمس إلى طلوع الفجر ، ثُمَّ يقسمه إلى سِتَّة أقسام ، الثلاثة أقسام الأولى هذه النصف الأول من الليل ، يقوم بعدها ، أي: يقوم في السدس الرابع ، والخامس ؛ لأن هذا يعتبر ثلث ، ثُم ينام في السدس الأخير ، وهو السدس السادس ، ولهذا عائشة - رضي الله عنها - قالت: ما أَلْفَاهُ السَّحَرُ - أي النَّبي - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - عِنْدِيْ إِلا نَائِمَاً رواه البخاري برقم (1133) ، رواه مسلم برقم (742) .وبهذه الطريقة يكون المسلم في أفضل وقت للصلاة بالليل، كما جاء في حديث عبد الله بن عمرو- رضي الله عنهما - السَّابق .وملخَّص الكلام: أنَّ الأفضلية في وقت قيام الليل على ثلاث مراتب :المرتبة الأولى : أن ينام نصف الليل الأول ، ثُم يقوم ثُلثه ، ثم ينام سدسه -كما مضى- . ويدلّ عليه:  حديث عبد الله بن عمرو بن العاص - رضي الله عنهما - الذي تقدَّم قريباً.المرتبة الثانية : أن يقوم في الثُّلث الآخر من الليل.ويدلّ عليها :حديث أبي هريرة - رضي الله عنه - أَنَّ رسول الله - صلَّى الله عليه وسلَّم- قال : يَنْزِلُ رَبُّنَا تَبَارَكَ وَتَعَالَى كُلَّ لَيْلَةٍ إِلَى السَّمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الآخِرُ، فَيَقُولُ: مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ ، وَمَنْ يَسْأَلُنِي فَأُعْطِيَهُ وَمَنْ يَسْتَغْفِرُنِي فَأَغْفِرُ لَهُ رواه البخاري برقم (1145) ، رواه مسلم برقم (758)  ، وكذلك حديث جابر - رضي الله عنه - وسيأتي.فإن خاف ألّا يقوم من آخر الليل فليصلِّ في أوله ، أو في أي أجزاء الليل تيسَّر له ، وهذه هي المرتبة الثالثة.المرتبة الثالثة : أن يصلِّي أول الليل ، أو في الجزء الذي يتيسَّر له من الليل.ويدلّ عليها :حديث جَابِرٍ - رضي الله عنه -  قال: قال رسول اللّه - صلَّى الله عليه وسلَّم-:  مَنْ خَافَ أَنْ لاَ يَقُومَ مِنْ آخِرِ الليْلِ فَلْيُوتِرْ أَوَّلَهُ وَمَنْ طَمِعَ أَنْ يَقُومَ آخِرَهُ فَلْيُوتِرْ آخِرَ اللَّيْلِ ، فَإِنَّ صَلاَةَ آخِرِ اللَّيْلِ مَشْهُودَةٌ ، وَذَلِكَ أَفَضَلُ رواه مسلم برقم (755).وأيضاً يُحمل عليه وصية النَّبيّ - صلَّى الله عليه وسلَّم - لأبي ذر (رواه النسائي في السنن الكبرى (2712)) وصححه الألباني (الصحيحة 2166) ، وأبي الدرداء (رواه أحمد برقم (27481) ، وأبو داود برقم (1433))، وصححه الألباني (صحيح أبي داود 5/177) ، وأبي هريرة _رضي الله عنه- (رواه مسلم برقم (737))  ، فكل واحد يقول:  أَوْصَانِي خَلِيلِي بِثَلَاثٍ ،  وذكر منها: وَأَنْ أُوتِرَ قَبْلَ أَنْ أَنَامَ."},
        {"text": "(2) السُّنَّة أن يقوم بإحدى عشرة ركعة . \n\n وهذا الأكمل لحديث عائشة - رضي الله عنها - أنها قالت:  مَا كَانَ رَسُولُ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ- يَزِيدُ فِي رَمَضَانَ، وَلاَ فِي غَيْرِهِ، عَلَى إِحْدَى عَشْرَةَ رَكْعَةً  رواه البخاري برقم (1147) ، رواه مسلم برقم (738).وورد أنَّ النَّبي - صلَّى الله عليه وسلَّم - صلَّى ثلاث عشرة ركعة، رواه مسلم في صحيحه من حديث عائشة - رضي الله عنها - ، قالت: كَانَ رَسُولُ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ- يُصَلِّي مِنَ اللَّيْلِ ثَلاَثَ عَشْرَةَ رَكْعَةً ، يُوتِرُ مِنْ ذلِكَ بِخَمْسٍ ، لاَ يَجْلِسُ فِي شَيْءٍ إِلاَّ فِي آخِرِهَا رواه مسلم برقم (737)، وفي حديث ابن عباس - رضي الله عنهما - : فَصَلَّى النَّبيُّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ- فِي تِلْكَ اللَّيْلَةِ ثَلاَثَ عَشْرَةَ رَكْعَةً، ثُمَّ نَامَ رَسُولُ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-  رواه البخاري برقم (698) ، رواه مسلم برقم (763).وهذا من باب تنوِّع الوتر، فالغالب من وتره صلَّى الله عليه وسلَّم ، أنه كان يوتر بإحدى عشرة ركعة ، وكان يوتر أحيانا بثلاث عشرة ركعة ، وبهذا نجمع بين الأحاديث الواردة ."},
        {"text": "(3) من السُّنَّة أن يستفتح صلاة الليل بركعتين خفيفتين . \n\n لحديث عائشة - رضي الله عنها – قالت : كَانَ رَسُولُ اللّه - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ- إِذَا قَامَ مِنَ اللَّيْلِ لِيُصَلِّيَ، افْتَتَحَ صَلاَتَهُ بِرَكْعَتَيْنِ خَفِيفَتَيْنِ، رواه مسلم برقم (767) ."},
        {"text": "(4) من السُّنَّة أن يأتي بالاستفتاحات الواردة في صلاة الليل. \n\n ومن ذلك:أ. ما جاء في صحيح مسلم من حديث عائشة - رضي الله عنها - قالت:  كَانَ - أي النَّبي - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ- - إِذَا قَامَ مِنَ اللَّيْلِ افْتَتَحَ صَلاَتَهُ:  اللَّهُمَّ رَبَّ جَبْرَائِيلَ وَمِيكَائِيلَ وَإِسْرَافِيلَ ، فَاطِرَ السَّمَاوَاتِ وَالأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ، اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيم  رواه مسلم برقم (770) .ب. ما جاء في الصحيحين من حديث ابن عباس - رضي الله عنهما - قال:  كَانَ النَّبِيُّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - إِذَا تَهَجَّدَ مِنْ اللَّيْلِ قَالَ : اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ نُورُ السَّمَوَاتِ وَالْأَرْضِ ، وَلَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَوَاتِ وَالْأَرْضِ ، وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ، أَنْتَ الْحَقُّ ،وَوَعْدُكَ الْحَقُّ ، وَقَوْلُكَ الْحَقُّ ، وَلِقَاؤُكَ الْحَقُّ ، وَالْجَنَّةُ حَقٌّ ، وَالنَّارُ حَقٌّ ، وَالنَّبِيُّونَ حَقٌّ ، وَالسَّاعَةُ حَقٌّ، اللَّهُمَّ لَكَ أَسْلَمْتُ، وَبِكَ آمَنْتُ، وَعَلَيْكَ تَوَكَّلْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، وَإِلَيْكَ حَاكَمْتُ، فَاغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ أَنْتَ إِلَهِي لَا إِلَهَ إِلَّا أَنْتَ رواه البخاري برقم (7499) ، رواه مسلم برقم (768) ."},
        {"text": "(5) من السُّنة أن يطيل قيامه، وركوعه، وسجوده. \n\n من السُّنة أن يطيل قيامه، وركوعه، وسجوده فتكون جميع أركان الصلاة الفعلية قريبة من السواء.ويدلّ على ما تقدم:حديث حذيفة - رضي الله عنه - قال: صَلَّيْتُ مَعَ النَّبِيِّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - ذَاتَ لَيْلَةٍ، فَافْتَتَحَ الْبَقَرَةَ، فَقُلْتُ: يَرْكَعُ عِنْدَ الْمِائَةِ ثُمَّ مَضَى، فَقُلْتُ: يُصَلِّي بِهَا فِي رَكْعَةٍ، فَمَضَى، فَقُلْتُ يَرْكَعُ بِهَا، ثُمَّ افْتَتَحَ النِّسَاءَ فَقَرَأَهَا، ثُمَّ افْتَتَحَ آلَ عِمْرَانَ فَقَرَأَهَا، يَقْرَأُ مُتَرَسِّلاً، إِذَا مَرَّ بِآيَةٍ فِيهَا تَسْبيحٌ سَبَّحَ، وَإِذَا مَرَّ بِسُؤَالٍ سَأَلَ، وَإِذَا مَرَّ بِتَعَوُّذٍ تَعَوَّذَ، ثُمَّ رَكَعَ فَجَعَلَ يَقُولُ: سُبْحَانَ رَبِّيَ الْعَظِيمِ فَكَانَ رُكُوعُهُ نَحْواً مِنْ قِيامِهِ ، ثُمَّ قَالَ: سَمعَ الله لِمَنْ حَمِدَهُ ثُمَّ قَامَ طَوِيلاً، قَرِيباً مِمَّا رَكَعَ، ثُمَّ سَجَدَ فَقَالَ: سُبْحَانَ رَبِّيَ الأَعْلَى فَكَانَ سُجُودُهُ قَرِيباً مِنْ قِيَامِهِ رواه مسلم برقم (772) .ولِما رواه أحمد - رحمه الله-  في مسنده ، من حديث أم سلمة - رضي الله عنها - : أَنَّهَا سُئِلَتْ عَنْ قِرَاءَةِ رَسُولِ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ -  فَقَالَتْ كَانَ يُقَطِّعُ قِرَاءَتَهُ آيَةً ، آيَةً:{بِسْمِ الله الرَّحْمنِ الرَّحِيمِ * الحَمْدُ لله رَبِّ الْعَالَمِينَ * الرَّحْمنِ الرَّحِيمِ * مَالِكِ يَوْمِ الدِّيِنِ} رواه أحمد برقم (26583)، وقال الدارقطني (118): إسناد صحيح وكلهم ثقات، وصححه النووي (المجموع 3/333)."},
        {"text": "(6) أن يأتي بالسُّنَن الواردة في قراءته. \n\n ومن ذلك :أ. أن يقرأ مترسِّلاً ، والمقصود : أنه لا يحدر، أو يهذَّ القراءة هذَّاً .ب. أن يُقَطِّعَ قراءته آية ، آية ، والمقصود : أنه لا يَصِلُ آيتين ، أو ثلاث من دون توقف ، بل يقف عند كل آية .ج. إذا مرَّ بآية تسبيح سبَّح ، وإذا مرَّ بآية سؤال سأل ، وإذا مرَّ بآية تعوُّذ تعوَّذ .ويدلّ على ما تقدم:حديث حذيفة - رضي الله عنه - قال: صَلَّيْتُ مَعَ النَّبِيِّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - ذَاتَ لَيْلَةٍ، فَافْتَتَحَ الْبَقَرَةَ، فَقُلْتُ: يَرْكَعُ عِنْدَ الْمِائَةِ ثُمَّ مَضَى، فَقُلْتُ: يُصَلِّي بِهَا فِي رَكْعَةٍ، فَمَضَى، فَقُلْتُ يَرْكَعُ بِهَا، ثُمَّ افْتَتَحَ النِّسَاءَ فَقَرَأَهَا، ثُمَّ افْتَتَحَ آلَ عِمْرَانَ فَقَرَأَهَا، يَقْرَأُ مُتَرَسِّلاً، إِذَا مَرَّ بِآيَةٍ فِيهَا تَسْبيحٌ سَبَّحَ، وَإِذَا مَرَّ بِسُؤَالٍ سَأَلَ، وَإِذَا مَرَّ بِتَعَوُّذٍ تَعَوَّذَ، ثُمَّ رَكَعَ فَجَعَلَ يَقُولُ:  سُبْحَانَ رَبِّيَ الْعَظِيمِ  فَكَانَ رُكُوعُهُ نَحْواً مِنْ قِيامِهِ ، ثُمَّ قَالَ: سَمعَ الله لِمَنْ حَمِدَهُ ثُمَّ قَامَ طَوِيلاً، قَرِيباً مِمَّا رَكَعَ، ثُمَّ سَجَدَ فَقَالَ:  سُبْحَانَ رَبِّيَ الأَعْلَى فَكَانَ سُجُودُهُ قَرِيباً مِنْ قِيَامِهِ رواه مسلم برقم (772) .ولِما رواه أحمد - رحمه الله-  في مسنده ، من حديث أم سلمة - رضي الله عنها - : أَنَّهَا سُئِلَتْ عَنْ قِرَاءَةِ رَسُولِ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ -  فَقَالَتْ كَانَ يُقَطِّعُ قِرَاءَتَهُ آيَةً ، آيَةً:{بِسْمِ الله الرَّحْمنِ الرَّحِيمِ * الحَمْدُ لله رَبِّ الْعَالَمِينَ * الرَّحْمنِ الرَّحِيمِ * مَالِكِ يَوْمِ الدِّيِنِ } رواه أحمد برقم (26583)، وقال الدارقطني (118): إسناد صحيح وكلهم ثقات، وصححه النووي (المجموع 3/333)."},
        {"text": "(7) من السنة أن يُسَلِّم من كل ركعتين. \n\n لحديث ابن عمر - رضي الله عنهما - أنه قال:  قَامَ رَجُلٌ فقَالَ: يَا رَسُولَ اللّهِ كَيْفَ صَلاَةُ اللَّيْلِ؟ قَالَ رَسُولُ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ -: صَلاَةُ اللَّيْلِ مَثْنَى ، مَثْنَى ، فَإِذَا خِفْتَ الصُّبْحَ فَأَوْتِرْ بِوَاحِدَةٍ   رواه البخاري برقم (990) ، رواه مسلم برقم (749).والمقصود بـ : (مَثْنَى ، مَثْنَى) أي : يُصلِّي اثنتين ، اثنتين ، فيُسلِّم من ركعتين، ولا يُصلِّي أربعاً جميعاً."},
        {"text": "(8) من السُّنَّة قراءة سور معينة في آخر ثلاث ركعات. \n\n  يقرأ في الركعة الأولى: {سَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى}، وفي الثانية : {قُلْ يَا أَيُّهَا الْكَافِرُونَ}، وفي الثالثة : {قُلْ هُوَ اللَّهُ أَحَدٌ } فقط .ويدلّ عليه:حديث أُبَيَّ بنِ كعب - رضي الله عنه - قال: كَانَ رَسُولُ الله - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يُوتِرُ بِسَبِّحِ اسْمَ رَبَّكَ الأَعْلَى ، وَقُلْ يَا أَيُّها الكَافِرُوْن ، وَقُلْ هُوَ الله أَحَدْ  رواه أبو داود برقم (1423) ، رواه النَّسائي برقم (1733) ، وابن ماجه برقم (1171)، وصححه النووي (الخلاصة 1/556)، والألباني (صحيح النسائي 1/273) ."},
        {"text": "(9) من السنة أن يقنت في وتره أحياناً . \n\n والمقصود به هنا : الدعاء ، وذلك في الركعة الثالثة التي يقرأ فيها سورة الإخلاص. والقنوت في الوتر من السُّنَّة فعله أحياناً؛ لثبوته عن بعض الصحابة رضي الله عنهم ، وتركه أحياناً ، واختاره شيخ الإسلام ابن تيمية - رحمه الله -  ، والأولى أن يكون الترك أكثر من الفعل . مسألة: وهل يرفع يديه في قنوت الوتر ؟الصحيح : أنه يرفع يديه ، وبه قال جمهور العلماء - رحمهم الله-  ؛ لثبوت ذلك عن عمر - رضي الله عنه - كما عند البيهقي وصحَّحه. وقال البيهقي - رحمه الله -:  إن عدداً من الصحابة - رضي الله عنهم- رفعوا أيديهم في القنوت   انظر : السنن الكبرى (2/211). مسألة: بأي شيء يبدأ قنوته في الوتر ؟القول الراجح - والله أعلم - : أنه يبدأ بحمد الله - تعالى-، والثناء عليه، ثم يُصلَّي على النَّبيِّ - صلَّى الله عليه وسلَّم - ثُم يدعو ؛ لأنّ هذا أقرب للإجابة.ويدلّ عليه:حديث فضالة بن عبيد - رضي الله عنه - قال: سَمِعَ النبيُّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ- رَجُلاً يَدْعُو في صَلاَتِهِ فَلَمْ يُصَلِّ عَلَى النبيِّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ- فقالَ النبيُّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-: عَجِلَ هَذَا ثُمَّ دَعَاهُ ، فقالَ لَهُ ولِغَيْرِهِ: إِذَا صَلَّى أَحَدُكُمْ فَلْيَبْدَأْ بِتَحْمِيدِ الله ، وَالثَّنَاءِ عَلَيْهِ ، ثُمَّ ليُصَلِّ عَلَى النبيِّ، ثُمَّ ليَدْعُ بَعْدُ ما شَاءَ رواه الترمذي برقم (3477) ، وقال:  هذا حديث حسن صحيح.قال ابن القيِّم - رحمه الله -:  المستحب في الدعاء أن يبدأ الداعي بحمد الله ، والثناء عليه بين يدي حاجته ، ثم يسأل حاجته كما في حديث فضالة بن عبيد . انظر : الوابل الصيب (ص110) .  مسألة : هل يمسح وجهه بيديه بعد دعاء القنوت ؟ الصحيح : أنه لا يُسَنُّ مسح الوجه بعد الانتهاء من الدعاء ؛ لعدم الدليل الصحيح على ذلك . سُئِل الإمام مالك - رحمه الله - عن الرجل يمسح بكفيه وجهَه عند الدعاء، فأنكر ذلك ، وقال: ما علمت. انظر : كتاب الوتر للمروزي (ص236) . قال شيخ الإسلام - رحمه الله -  :وأمَّا مسح وجهه بيديه فليس فيه إلا حديث ، أو حديثان لا تقوم بهما الحُجَّة . انظر : الفتاوى(22/519)."},
        {"text": "(10) الدعاء في ثلث الليل الآخر. \n\nمن السُّنَن التي تتأكد آخر الليل الدعاء ، فإن دعا في قنوته آخر الليل كفاه ذلك ، وإن لم يدع فإن من السُّنَن الدعاء في هذا الوقت ؛ لأنه وقت تتأكد فيه إجابة الدعاء ، ففيه نزولاً لله - جلَّ وعلا - يليق بجلاله إلى السماء الدنيا ، فقد جاء في الصحيحين من حديث أبي هريرة - رضي الله عنه - أنَّ رسول الله - صلَّى الله عليه وسلَّم - قال:  يَنْزِلُ رَبُّنَا تَبَارَكَ وَتَعَالَى كُلَّ لَيْلَةٍ إِلَى السَّمَاءِ الدُّنْيَا حِينَ يَبْقَى ثُلُثُ اللَّيْلِ الْآخِرُ ، يَقُولُ: مَنْ يَدْعُونِي فَأَسْتَجِيبَ لَهُ ، مَنْ يَسْأَلُنِي فَأُعْطِيَهُ مَنْ يَسْتَغْفِرُنِي فَأَغْفِرَ لَهُ. رواه البخاري برقم (1145) ، رواه مسلم برقم (758) . "},
        {"text": "(11) يُسنُّ إذا سلَّم من وتره أن يقول : (سبحان الملك القدُّوس) ثلاثًا. \n\nيُسنُّ إذا سلَّم من وتره أن يقول : (سبحان الملك القدُّوس) ثلاثاً، يرفع صوته بالثالثة .ويدلُّ عليه :حديث أُبَيّ بن كعب - رضي الله عنه - قال: كَانَ رَسُولُ اللَّهِ- صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يَقْرَأُ فِي الْوِتْرِ بِـ{سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى}وَ{قُلْ يَا أَيُّهَا الْكَافِرُونَ} وَ{قُلْ هُوَ اللَّهُ أَحَدٌ} فَإِذَا سَلَّمَ قَالَ: سُبْحَانَ الْمَلِكِ الْقُدُّوسِ ثَلاَثَ مَرَّاتٍ رواه النسائي برقم (1702) وصححه النووي والألباني كما تقدم قريبا. وفي حديث عبد الرحمن بن أبزى - رضي الله عنه -:  وَيَرْفَعُ بِسُبْحَانَ الْمَلِكِ الْقُدُّوسِ صَوْتَهُ بِالثَّالِثَةِ. رواه أحمد برقم (15354) ، رواه النسائي برقم (1734)، وصححه الألباني (تحقيق مشكاة المصابيح 1/398) . "},
        {"text": "(12) يُسَنُّ أن يوقظ أهله ؛ لقيام الليل.  \n\n فالرجل يُسنُّ له أن يوقظ أهله ؛ لصلاة الليل ، وكذا المرأة إذا قامت فإنه يُسَنُّ لها أن توقظ زوجها ، وسائر أهلَها لذلك ، وهذا من باب التعاون على الخير .ويدلّ عليه:حديث عائشة - رضي الله عنها – قالت : كَانَ النَّبِيُّ- صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ -يُصَلِّي صَلاَتَهُ مِنَ اللَّيْلِ كُلَّهَا، وَأَنَا مُعْتَرِضَةٌ بَيْنَهُ وَبَيْنَ الْقِبْلَةِ، فَإِذَا أَرَادَ أَنْ يُوتِرَ أَيْقَظَنِي فَأَوْتَرْتُ. رواه البخاري برقم (512) ، رواه مسلم برقم (512) .وعن أمَّ سلمةَ - رضيَ الله عنها-  قالت: استَيقظ النبيُّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ- فقال: سُبْحَانَ اللَّهِ مَاذَا أُنْزِلَ مِنْ الْخَزَائِنِ ، وَمَاذَا أُنْزِلَ مِنْ الْفِتَنِ ، مَنْ يُوقِظُ صَوَاحِبَ الْحُجَرِ ؟- يُرِيدُ بِهِ أَزْوَاجَهُ - حَتَّى يُصَلِّينَ ، رُبَّ كَاسِيَةٍ فِي الدُّنْيَا عَارِيَةٌ فِي الْآخِرَةِ. رواه البخاري برقم (6218) . "},
        {"text": "(13) من السُّنَّة أن يفعل القائم للّيل الأرفق لنفسه. \n\n من السُّنَّة أن يفعل القائم للّيل الأرفق لنفسه؛ لئلا يؤثر على خشوعه .- فإذا أصابه فتور صلَّى جالساً .لحديث أنس - رضي الله عنه - قال: دَخَلَ رَسُولُ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - الْمَسْجِدَ ، وَحَبْلٌ مَمْدُودٌ بَيْنَ سَارِيَتَيْنِ فَقَالَ:  مَا هذَا؟ قَالُوا: لِزَيْنَبَ تُصَلِّي، فَإِذَا كَسِلَتْ أَوْ فَتَرَتْ أَمْسَكَتْ بِهِ ، فَقَالَ:  حُلُّوهُ، لِيُصَلِّ أَحَدُكُمْ نَشَاطَهُ ، فَإِذَا كَسَلَ أَوْ فَتَرَ فَلْيَقْعُدْ . رواه البخاري برقم (1150) ، رواه مسلم برقم (784) .- وإذا أصابه نعاس نام ؛ ليقوم نشيطاً ، فيصلِّي بعد ذلك.لحديث عائشة - رضي الله عنها -  أَنَّ النَّبِيَّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ- قَالَ:  إِذَا نَعَسَ أَحَدُكُمْ فِي الصَّلاَةِ، فَلْيَرْقُدْ حَتَّى يَذْهَبَ عَنْهُ النَّوْمُ. فَإِنَّ أَحَدَكُمْ إِذَا صَلَّى وَهُوَ نَاعِسٌ، لَعَلَّهُ يَذْهَبُ يَسْتَغْفِرُ فَيَسُبَّ نَفْسَهُ. رواه البخاري برقم (212) ، رواه مسلم برقم (786).- وكذا إذا أصابه نعاس ونحوه وهو يقرأ القرآن بالليل ، فإنَّ السُّنَّة أن ينام ؛ ليتقوّى.لحديث أبي هريرة - رضي الله عنه - أنَّ رسول اللّه - صلَّى الله عليه وسلَّم - قال : إِذَا قَامَ أَحَدُكُمْ مِنَ اللَّيْلِ، فَاسْتَعْجَمَ الْقُرْآنُ عَلَى لِسَانِهِ، فَلَمْ يَدْرِ مَا يَقُولُ، فَلْيَضْطَجِعْ . رواه مسلم برقم (787) ."},
        {"text": "(14) السُّنَّة لمن فاته قيام الليل أن يصلِّيه من النهار شفعاً . \n\n فإذا كان من عادته أن يوتر بثلاث فنام عن وتره ، أو مرض ، فلم يستطع أن يُصلِّيه ، فإنه يُصلِّيه من النهار أربعاً، وإذا كان من عادته أن يوتر بخمس فنام عن وتره ، أو مرض ، فإنه يُصليه من النهار سِت ركعات ، وهكذا ، وقد كان النَّبيّ - صلَّى الله عليه وسلَّم - يفعل ذلك ، ولأنه كان من عادته - صلَّى الله عليه وسلَّم - أن يوتر بإحدى عشرة ركعة ، فإن عائشة-رضي الله عنها- تقول عن النَّبيِّ - صلى الله عليه وسلم -: وَكَانَ إِذَا غَلَبَهُ نَوْمٌ أَوْ وَجَعٌ عَنْ قِيَامِ اللَّيْلِ صَلَّى من النَّهَارِ ثِنْتَيْ عَشْرَةَ رَكْعَةً  رواه مسلم برقم (746) ."},

    ],
    "fajr": [
        {"text": "سنن الفجر \n\n (1) سُنَّة الفجر هي أول السُّنَن الراتبة التي يعملها العبد في يومه \n\n وسُنَّة الفجر هي أول السُّنَن الراتبة التي يعملها العبد في يومه ، وفيها عدة سُنَن ، وقبل بيانها لابد من بيان بعض ما يخص السُّنَن الرواتب ، والسُّنَّة الراتبة هي: السُّنَّة الدائمة التابعة للفرائض وهي اثنتا عشرة ركعة .عن أُمَّ حَبِيبَةَ - رضي الله عنها - قَالَتْ : سَمِعْتُ رَسُولَ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يَقُولُ:  مَنْ صَلَّى اثْنَتَيْ عَشْرَةَ رَكْعَةً فِي يَوْمٍ وَلَيْلَةٍ، بُنِيَ لَهُ بِهِنَّ بَيْتٌ فِي الْجَنَّةِ رواه مسلم برقم (728)، وأخرجه الترمذي ،وزاد  أَرْبَعًا قَبْلَ الظُّهْرِ ، وَرَكْعَتَيْنِ بَعْدَهَا ، وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ ، وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ ، وَرَكْعَتَيْنِ قَبْلَ صَلَاةِ الْفَجْرِ   رواه الترمذي برقم (415) . وقال: حسن صحيح ."},
        {"text": "(2) الأفضل أن تؤدَّى السُّنَن الرواتب في البيت. \n\n ويدل عليه: عن زيد بن ثابت - رضي الله عنه - أنَّ النَّبيّ - صلَّى الله عليه وسلَّم - قال:  فَصَلُّوا أَيُّهَا النَّاسُ فِي بُيُوتِكُمْ ، فَإِنَّ أَفْضَلَ صَلَاةِ الْمَرْءِ فِي بَيْتِهِ إِلَّا الصَّلَاةَ الْمَكْتُوبَةَ. رواه البخاري برقم (7290) ، رواه مسلم برقم (781) .وعن ابن عمر - رضي الله عنهما - أنَّ النَّبيّ - صلَّى الله عليه وسلَّم - قال:اجْعَلُوا مِنْ صَلاَتِكُمْ فِي بُيُوتِكُمْ ، وَلاَ تَتَّخِذُوهَا قُبُوراً . رواه البخاري برقم (1187) ، رواه مسلم برقم (777) .وعن جابر - رضي الله عنه - قال: قال رسول الله - صلَّى الله عليه وسلَّم - :  إِذَا قَضَى أَحَدُكُمُ الصَّلاَةَ فِي مَسْجِدِهِ، فَلْيَجْعَلْ لِبَيْتِهِ نَصِيباً مِنْ صَلاَتِهِ ، فَإِنَّ الله جَاعِلٌ فِي بَيْتِهِ مِنْ صَلاَتِهِ خَيْراً . رواه مسلم برقم (778) ."},
        {"text": "(3) آكد السُّنَن الرواتب سنة الفجر \n\n آكد السُّنَن الرواتب سُنَّة الفجر ، ويدلّ على ذلك ما يلي:أ. حديث عائشة - رضي الله عنها -  قالت: لَمْ يَكُنْ عَلَى شَيْءٍ مِنَ النَّوَافِلِ، أَشَدَّ مُعَاهَدَةً مِنْهُ، عَلَى رَكْعَتَيْنِ قَبْلَ الصُّبْح. رواه البخاري برقم (1196) ، رواه مسلم برقم (724) .ب. حديث عائشة- رضي الله عنها - عن النَّبيِّ - صلَّى الله عليه وسلَّم - قال:  رَكْعَتَا الْفَجْرِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا. رواه مسلم برقم (725)."},
        {"text": "(4) مشروعيتها في السَّفر والحضر \n\nسُنَّة الفجر تختص بِعدَّة أمور؛ منها:أولاً: مشروعيتها في السَّفر والحضر كما ورد في الصحيحين ، أمَّا غيرها من السُّنَن الرواتب فالسُّنَّة تركها في السَّفَر كراتبة الظهر ، والمغرب ، والعِشَاء ."},
        {"text": "(5) ثوابها بأنها خير من الدنيا، وما فيها \n\n ومما تختصُّ به سنة الفجر:ثانيا: ثوابها بأنها خير من الدنيا، وما فيها لحديث عائشة- رضي الله عنها - عن النَّبيِّ - صلَّى الله عليه وسلَّم - قال:  رَكْعَتَا الْفَجْرِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا. رواه مسلم برقم (725).ولمسلم أيضاً عن عائشة - رضي الله عنها - ، عن النَّبيِّ- صلَّى الله عليه وسلَّم -  أَنَّه قال: في شأن الركعتين عند طلوع الفجر : لَهُمَا أَحَبُّ إِلَيَّ مِنَ الدُّنْيَا جَمِيعاً . رواه مسلم برقم (725) . "},
        {"text": "(6) يُسَنُّ تخفيفها \n\n ومما تختصُّ به سنة الفجر:ثالثًا: يُسنُّ تخفيفها.ويدلّ عليه: حديث عائشة - رضي الله عنها - أنَّها كانت تقول: كَانَ رَسُولُ اللّهِ يُصَلِّي رَكْعَتَيِ الْفَجْرِ، فَيُخَفِّفُ حَتَّى إني أقول: هَلْ قَرَأَ فِيهِمَا بِأُمِّ الْقُرْآنِ أَمْ لاَ؟ . رواه البخاري برقم (1171) ، رواه مسلم برقم (724).ولكن يُشترط : ألّا يكون هذا التخفيف مُخِلّاً بالواجب ، أو يُفضي إلى أن ينقر صلاته ، فيقع في المنهي عنه. "},
        {"text": "(7) يُسَن أن يقرأ في سُنَّة الفجر بما يلي: \n\n ومما تختصُّ به سنة الفجر:رابعًا: يُسَن أن يقرأ في سُنَّة الفجر ، بعد الفاتحة ، في الركعة الأولى : {قُلْ يَا أَيُّهَا الْكَافِرُونَ } ، وفي الثانية :{قُلْ هُوَ اللَّهُ أَحَدٌ }، لحديث أبي هريرة عند مسلم.أو يقرأ بعد الفاتحة ، في الركعة الأولى :{قُولُواْ آمَنَّا بِاللّهِ وَمَا أُنزِلَ إِلَيْنَا وَمَا أُنزِلَ إِلَى إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالأسْبَاطِ وَمَا أُوتِيَ مُوسَى وَعِيسَى وَمَا أُوتِيَ النَّبِيُّونَ مِن رَّبِّهِمْ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّنْهُمْ وَنَحْنُ لَهُ مُسْلِمُونَ}[البقرة :136] . وفي الثانية :{قُلْ يَا أَهْلَ الْكِتَابِ تَعَالَوْاْ إِلَى كَلَمَةٍ سَوَاء بَيْنَنَا وَبَيْنَكُمْ أَلاَّ نَعْبُدَ إِلاَّ اللّهَ وَلاَ نُشْرِكَ بِهِ شَيْئاً وَلاَ يَتَّخِذَ بَعْضُنَا بَعْضاً أَرْبَاباً مِّن دُونِ اللّهِ فَإِن تَوَلَّوْاْ فَقُولُواْ اشْهَدُواْ بِأَنَّا مُسْلِمُونَ}[آل عمران: 52] ، لحديث ابن عباس عند مسلم. وهذه من السُّنَن التي وردت على وجوه متنوعة ، فمرَّة يأتي بهذه، ومرَّة بهذه."},
        {"text": "(8) يُسَنّ الاضطجاع على الشِّق الأيمن، بعد سُنَّة الفجر. \n\n ومما تختصُّ به سنة الفجر:خامساً: يُسَنّ الاضطجاع على الشِّق الأيمن، بعد سُنَّة الفجر.ويدلّ عليه:أ. حديث عائشة - رضي الله عنها- : كَانَ النَّبِيُّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - إِذَا صَلَّى رَكْعَتَيْ الْفَجْرِ اضْطَجَعَ عَلَى شِقِّهِ الْأَيْمَنِ.. رواه البخاري برقم (1160) ، رواه مسلم برقم (736).ب. حديث عائشة- رضي الله عنها- قالت: كَانَ النَّبِيُّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - إِذَا صَلَّى رَكْعَتَيِ الْفَجْرِ، فَإِنْ كُنْتُ مُسْتَيْقِظَةً، حَدَّثَنِي وَإِلاّ اضْطَجَعَ. رواه مسلم برقم (743)."},
        {"text": "(9) الجلوس بعد الفجر في المصلَّى حتى تطلع الشمس \n\n من السُّنَّة الجلوس بعد الفجر في المصلَّى حتى تطلع الشمس.عن جابر بن سَمُرَة - رضي الله عنه - : أَنَّ النَّبِيَّ - صلَّى الله عليه وسلَّم - كَانَ إِذَا صَلَّى الْفَجْرَ جَلَسَ فِي مُصَلاَّهُ حَتَّى تَطْلُعَ الشَّمْسُ حَسَناً رواه مسلم برقم (670) ، و  حَسَناً  أي : مرتفعة."},
        {"text": "أذكار الصباح وعددها (31) أذكار \n\n ستجدها في الصفحة الرئيسية للتطبيق ◀️"},

    ],
    "duha": [
        {"text": "يُسَنُّ في وقت الضحى أن يُصلِّي العبد صلاة ( الضحى ) \n\n ويدلّ عليه :أ. حديث أبي هريرة - رضي الله عنه - قال: أَوْصَانِي خَلِيلِي - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - بِثَلَاثٍ : صِيَامِ ثَلَاثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ ، وَرَكْعَتَيْ الضُّحَى ، وَأَنْ أُوتِرَ قَبْلَ أَنْ أَنَامَ ، وأيضاً أوصى بها النَّبيُّ - صلَّى الله عليه وسلَّم - أبا الدرداء - رضي الله عنه - رواه مسلم برقم (722)، وأوصى بها أبا ذر- رضي الله عنه - رواه النسائي في السنن الكبرى برقم (2712)، وصححه الألباني (الصحيحة 2166).ب. حديث أَبي ذر - رضي الله عنه - عن النَّبيِّ- صلَّى الله عليه وسلَّم - أنَّه قال:  يُصْبِحُ عَلَى كُلِّ سُلاَمَى مِنْ أَحَدِكُمْ صَدَقَةٌ ، فَكُلُّ تَسْبِيحَةٍ صَدَقَةٌ ، وَكُلُّ تَحْمِيدَةٍ صَدَقَةٌ ، وَكُلُّ تَهْلِيلَةٍ صَدَقَةٌ ، وَكُلُّ تَكْبِيرَةٍ صَدَقَةٌ ، وَأَمْرٌ بِالْمَعْرُوفِ صَدَقَةٌ ، وَنَهْيٌ عَنِ الْمُنْكَرِ صَدَقَةٌ ، وَيُجَزِىءُ، مِنْ ذلِكَ، رَكْعَتَانِ يَرْكَعُهُمَا مِنَ الضُّحَى رواه مسلم برقم (720) .والسُّلَامى: هي العظام المنفصل بعضها عن بعض.وجاء في صحيح مسلم من حديث عائشة - رضي الله عنها - بيان أنَّ كل إنسان خلق على ثلاثمائة وستين مفصل ، وأنَّ من جاء بهذا العدد من الصدقات فإنه يمشي يومئذٍ وقد زحزح نفسَه عن نار جهنم."},
        {"text": "وقت صلاة الضُّحى \n\n يبدأ وقت صلاة الضُّحى من : ارتفاع الشمس قدر رمح - أي: بعد خروج وقت النَّهي .وينتهي: قبيل الزَّوال - أي: قبل دخول وقت الظهر بعشر دقائق تقريباً -.ويدلّ عليه : حديث عمرو بن عبسة - رضي الله عنه - : صَلِّ صَلاَةَ الصُّبْحِ، ثُمَّ أَقْصِرْ عَنِ الصَّلاَةِ حِيْنَ تَطْلُعَ الشَّمْسُ حتى تَرْتَفِعِ ...ثُمَّ صَلِّ ، فَإِنَّ الصَّلاَةَ مَشْهُودَةٌ مَحْضُورَةٌ ، حتى يَسْتَقِلَّ الظِّلَّ بِالرُّمْحِ ، ثُمَّ أَقْصِرْ عَنِ الصَّلاَةِ ، فإنَّه حِينَئِذٍ تُسْجَرُ جَهَنَّمُ... رواه مسلم برقم (832)."},
        {"text": "أفضل وقتها \n\n وأفضل وقتها: في آخر وقتها ، وذلك حين تَرْمضُ الفصال.ويدلّ عليه : حديث زيد بن أرقم - رضي الله عنه - أنَّ النَّبيّ - صلَّى الله عليه وسلَّم - قال: صَلاَةُ الأَوَّابِينَ حِينَ تَرْمضُ الْفِصَالُ   رواه مسلم برقم (748) .قال ابن باز- رحمه الله - : معنى تَرْمضُ : أي يشتد عليها حر الشمس ، والفِصَال: هي أولاد الإبل ، وهي من الصلوات التي فعلها آخر الوقت أفضل  انظر : فتاوى إسلامية (1/515)."},
        {"text": "عدد ركعاتها \n\n أقلُّ صلاة الضحى : ركعتان ؛ لحديث أبي هريرة - رضي الله عنه - في الصحيحين: أوْصَانِيْ خَلِيْلِيْ بِثَلاث - وذكر منها - ورَكعتَيِ الضُّحى رواه البخاري برقم (1981) ، رواه مسلم برقم (721) .وأمَّا أكثر صلاة الضحى فالصحيح : أنه لا حدَّ لأكثرها ، خلافاً لمن حدَّها بثمان ركعات ، فله أن يزيد على ثمان إلى ما يفتح الله - تعالى - به عليه ؛ لحديث عائشة - رضي الله عنها - ، قالت: كَانَ رَسُولُ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يُصَلِّي الضُّحَى أَرْبَعَاً، وَيَزِيدُ مَا شَاءَ اللّهُ رواه مسلم برقم (719) ."},
    ],
    "dhuhr": [
        {"text": "صلاة سُنَّة الظهر القبلية، والبعدية. \n\n يُشرع قبل الظهر أربع ركعات ، ويُشرع بعدها ركعتان، كما دلَّ على ذلك حديث عائشة ، وأم حبيبة ، وابن عمر - رضي الله عنهم - أجمعين .عن أُمَّ حَبِيبَةَ - رضي الله عنها - قَالَتْ : سَمِعْتُ رَسُولَ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يَقُولُ:  مَنْ صَلَّى اثْنَتَيْ عَشْرَةَ رَكْعَةً فِي يَوْمٍ وَلَيْلَةٍ، بُنِيَ لَهُ بِهِنَّ بَيْتٌ فِي الْجَنَّةِ رواه مسلم برقم (728)، وأخرجه الترمذي ،وزاد  أَرْبَعًا قَبْلَ الظُّهْرِ ، وَرَكْعَتَيْنِ بَعْدَهَا ، وَرَكْعَتَيْنِ بَعْدَ الْمَغْرِبِ ، وَرَكْعَتَيْنِ بَعْدَ الْعِشَاءِ ، وَرَكْعَتَيْنِ قَبْلَ صَلَاةِ الْفَجْرِ   رواه الترمذي برقم (415) . وقال: حسن صحيح ."},
        {"text": "من السُّنَة تطويل الركعة الأولى من صلاة الظهر. \n\n لحديث أبي سعيد الخدريِ - رضي الله عنه -  قال : لَقَدْ كَانَتْ صَلاَةُ الظُّهْرِ تُقَامُ ، فَيَذْهَبُ الذَّاهِبُ إِلَى الْبَقِيعِ ، فَيَقْضِي حَاجَتَهُ ثُمَّ يَتَوَضَّأُ ، ثُمَّ يَأْتِي وَرَسُولُ اللّه- صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - في الركْعَةِ الأُولَى، مِمَّا يُطَوِّلُهَا رواه مسلم برقم (454).وعليه فإنَّ من السُّنَّة للإمام أن يطوِّل الركعة الأولى من الظهر ، وكذلك من صلَّى منفرداً ، وكذلك المرأة في صلاتها للظهر، وهذه من السُّنن المندثرة ، نسأل الله - تعالى - تطبيق السُّنَّة على الوجه الأكمل ، والحرص عليها ."},
        {"text": "عند شِدَّة الحر، يُسنَّ تأخير صلاة الظهر حتى ينكسر الحر. \n\n ويدلّ عليه :حديث أبي هريرة - رضي الله عنه - مرفوعاً : إِذَا اشْتَدَّ الْحَرُّ أَبْرِدُوا بِالصَّلاَةِ ، فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ فيح جهنم : هو غليانها ، وانتشار لهبها ، ووهجها . رواه البخاري برقم (534،533) ، ومسلم برقم (615) . قال شيخنا ابن عثيمين - رحمه الله - : فإذا قدَّرنا مثلاً أنَّ الشمس في أيام الصيف تزول على الساعة الثانية عشرة ، وأنَّ العصر على الساعة الرابعة والنِّصف تقريباً ، فيكون الإبراد إلى الساعة الرابعة تقريباً  انظر : الممتع (2/104).والإبراد عام لمن يصلِّي في جماعة، ولمن يصلِّي وحده على الصحيح ، واختاره شيخنا ابن عثيمين - رحمه الله- ، وعليه يدخل في ذلك النساء أيضاً، فيُسَنّ لهن الإبراد في شِدَّة الحرّ ؛ لعموم حديث أبي هريرة - رضي الله عنه -."},

    ],
    "asr": [
        {"text": "لا يُسَنُّ سُنَّة مقيَّدة قبل العصر \n\n تقدَّم الكلام على السُّنَن الرواتب وبيانها ، وليس قبل العصر منها شيء.قال شيخ الإسلام ابن تيمية - رحمه الله -  : وأمَّا قبل العصر، فلم يقل أحد أنَّ النَّبيّ – صلَّى الله عليه وسلَّم - كان يُصلِّي قبل العصر ، إلا فيه ضعف ، بل خطأ  انظر : الفتاوى (23/125).فالصواب - والله أعلم - : أنه لا يُسَنُّ سُنَّة مقيَّدة قبل العصر ، وإنما يبقى الأمر مطلقاً فمن شاء أن يُصلِّي ركعتين ، أو أكثر من ذلك من قبيل التطوع المطلق ، كما يصلِّي في غيرها من الأوقات سوى أوقات النَّهي فله ذلك ، وأمَّا شيء مقيَّد قبل العصر فلا ."},
        {"text": "أذكار المساء وعددها (30) أذكار \n\n ستجدها في الصفحة الرئيسية للتطبيق ◀️"},
    ],
    "maghrib": [
        {"text": "من السُّنَّة كَفّ الصِّبيان أول المغرب. \n\n ففي كفِّ الصبيان في أول ساعة من المغرب حفظ لهم من الشياطين التي تنتشر في ذلك الوقت ... وكم من صبي تمكَّنت الشياطين منه في هذا الوقت ، فما أعظم رعاية الإسلام لصبياننا ، ولبيوتنا !ويدلّ عليه :حديث جابر بن عبد الله - رضي الله عنهما - قال: قال رسولُ الله - صلَّى الله عليه وسلَّم - :  إِذَا كَانَ جُنْحُ اللَّيْلِ - أَوْ أَمْسَيْتُمْ - فَكُفُّوا صِبْيَانَكُمْ ، فَإنَّ الشَّيْطَانَ يَنْتَشِرُ حِينَئِذٍ ، فَإِذَا ذَهَبَ سَاعَةٌ مِنَ اللَّيْلِ فَخَلُّوهُمْ ، وَأَغْلِقُوا الأَبْوَابَ ، وَاذْكُرُوا اسْمَ اللّهِ ، فَإنَّ الشَّيطَانَ لاَ يَفْتَحُ بَاباً مُغْلَقاً  رواه البخاري برقم (3304) ، رواه مسلم برقم (2012)، وجنح الليل هو: إقباله بعد غروب الشمس.وكفّ الصبيان أول المغرب إنما هو من باب الاستحباب انظر : فتاوى اللجنة الدائمة (26/317) ."},
        {"text": "من السُّنَّة إغلاق الأبواب أول المغرب، وذكر اسم الله - تعالى - . \n\n ففي إغلاق الباب في أول ساعة من المغرب وذكر اسم الله - تعالى-  عند إغلاقه حفظ من الشياطين والجن، وكم من بيت تمكَّنت الشياطين منه في هذا الوقت ، فما أعظم رعاية الإسلام لصبياننا ، ولبيوتنا !ويدلّ عليه :حديث جابر بن عبد الله - رضي الله عنهما - قال: قال رسولُ الله - صلَّى الله عليه وسلَّم - :  إِذَا كَانَ جُنْحُ اللَّيْلِ - أَوْ أَمْسَيْتُمْ - فَكُفُّوا صِبْيَانَكُمْ ، فَإنَّ الشَّيْطَانَ يَنْتَشِرُ حِينَئِذٍ ، فَإِذَا ذَهَبَ سَاعَةٌ مِنَ اللَّيْلِ فَخَلُّوهُمْ ، وَأَغْلِقُوا الأَبْوَابَ ، وَاذْكُرُوا اسْمَ اللّهِ ، فَإنَّ الشَّيطَانَ لاَ يَفْتَحُ بَاباً مُغْلَقاً  رواه البخاري برقم (3304) ، رواه مسلم برقم (2012)، وجنح الليل هو: إقباله بعد غروب الشمس .وإغلاق الأبواب أول المغرب إنما هو من باب الاستحباب؛ انظر : فتاوى اللجنة الدائمة (26/317) ."},
        {"text": "صلاة ركعتين قبل المغرب. \n\nلحديث عبد اللّه بن مُغَفَّل المُزني - رضي الله عنه - عنِ النَّبيِّ - صلَّى الله عليه وسلَّم- قال:  صَلُّوا قَبْلَ صَلَاةِ الْمَغْرِبِ ، - قَالَ فِي الثَّالِثَةِ - لِمَنْ شَاءَ ، كَرَاهِيَةَ أَنْ يَتَّخِذَهَا النَّاسُ سُنَّةً  رواه البخاري برقم (1183) .- وأيضاً يُسَنُّ صلاة ركعتين بين كل أذان ، وإقامة.وسواء كانت هاتان الركعتان راتبة كالفجر ، والظهر ، فإنه يكفي بصلاته الراتبة عن هاتين الركعتين ، أو كأن يكون جالساً في المسجد ، ثم أذَّن المؤذِّن لصلاة العصر ، أو العشاء فإن من السُّنَّة أن يقوم ، ويصلي ركعتين.ويدلّ عليه:حديث عبد اللّه بن مُغَفَّل الْمُزَنِي - رضي الله عنه - ، قال: قال رسولُ اللّه - صلَّى الله عليه وسلَّم - : بَيْنَ كُلِّ أَذَانَيْنِ صَلاَةٌ قالها ثلاثا ، قال في الثالثة : لِمَنْ شَاءَ رواه البخاري برقم (624)، رواه مسلم برقم (838) .ولاشك أنَّ الركعتين قبل المغرب ، أو بين كل أذانين ليست مؤكَّدة كتأكيد السُّنَن الرواتب ، وإنما تترك أحياناً ، ولذا قال النَّبيُّ - صلَّى الله عليه وسلَّم- في الثالثة :  لِمَنْ شَاءَ ؛ كراهية أنْ يَتَّخذها الناس سُنَّة . "},
        {"text": "يُكرَه النوم قبل العشاء. \n\nلحديث أبي بَرْزَة الأسْلَميِّ - رضي الله عنه - أنَّ النَّبيّ - صلَّى الله عليه وسلَّم - : كَانَ يَسْتَحِبُّ أَنْ يُؤَخِّرَ الْعِشَاءَ ، قَالَ: وَكَانَ يَكْرَهُ النَّوْمَ قَبْلَهَا، وَالْحَدِيثَ بَعْدَهَا رواه البخاري برقم (599) ، رواه مسلم برقم (647).والعِّلَّة من كراهة النوم وقت المغرب أي : قبل العِشاء ؛ لأنَّ في نومه سبب في تفويت صلاة العِشاء . "},
    ],
    "isha": [
        {"text": "سنن وقت العشاء \n\n (1) يُكره الحديث، والمجالسة بعده \n\nلحديث أبي بَرْزَةَ الأسْلَميِّ - رضي الله عنه - السَّابق ، وفيه :  وَكَانَ يَكْرَهُ النَّوْمَ قَبْلَهَا ، وَالْحَدِيثَ بَعْدَهَا ، فإن كان حديثه لحاجة فلا كراهة في ذلك.وسبب الكراهة - والله أعلم - : أنَّ نومه يتأخر ، فيُخَافُ منه تفويت الصبح عن وقتها ، أو عن أولها ، أو يفوته قيام الليل ممَّن يعتاده. "},
        {"text": "(2) الأفضل في صلاة العِشاء أن تؤخَّر \n\n الأفضل في صلاة العِشاء أن تؤخَّر ، ما لم يكن في ذلك مشقة على المأمومين.ويدلّ عليه :حديث عائشة - رضي الله عنها - قالت: أَعْتَمَ النَّبِيُّ - صلَّى الله عليه وسلَّم - ذَاتَ لَيْلَةٍ ، حَتَّى ذَهَبَ عَامَّةُ اللَّيْلِ، وَحَتَّى نَامَ أَهْلُ الْمَسْجِدِ ثُمَّ خَرَجَ فَصَلَّى ، فَقَالَ:  إِنَّهُ لَوَقْتُهَا ، لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي  رواه مسلم برقم (638) .وعليه فالسُّنَّة في حق المرأة حيث إنها لا ترتبط بجماعة أن تؤخَّر العِشَاء إذا لم يكن في ذلك مشقة عليها ، وكذا الرجل إن لم يكن مرتبطاً بجماعة كأن يكون في طريق سفر ، ونحوه ."},
        {"text": "(3) من السنة أن يوتر قبل أن ينام. \n\n من السنة أن يوتر قبل أن ينام إذا خشي ألا يقوم من آخر الليل.لحديث أبي هريرة رضي الله عنه، قال: أوصاني خليلي ﷺ بثلاثٍ: بصيامِ ثلاثةِ أيامٍ من كل شهرٍ، وركعتي الضحى، وأن أوترَ قبل أن أرقدَ رواه مسلم برقم ٧٣٧.وعن جَابِرِ بْنِ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُمَا، قال رسولُ اللهِ ﷺ: من خاف أن لا يقومَ من آخرِ اللَّيلِ فلْيوتِرْ أولَه (رواه مسلم برقم ٧٥٥). "},
        {"text": "سنن النوم \n\n (1) إغلاق الأبواب عند النوم. \n\n لحديث جابر - رضي الله عنه - قال: قال رسولُ الله - صلَّى الله عليه وسلَّم - : أَطْفِئُوا الْمَصَابِيحَ إِذَا رَقَدْتُمْ ، وَغَلِّقُوا الْأَبْوَابَ وَأَوْكُوا الْأَسْقِيَةَ ، وَخَمِّرُوا الطَّعَامَ وَالشَّرَابَ  رواه البخاري برقم (5624) ، رواه مسلم برقم (2012).والعِلَّة من الأمر بإغلاق الأبواب : منع الشياطين من الدخول ،كما تقدَّم في حديث جابر- رضي الله عنه -  الآخر:  وَأَغْلِقُوا الأَبْوَابَ ، وَاذْكُرُوا اسْمَ اللّهِ ، فَإنَّ الشَّيْطَانَ لاَ يَفْتَحُ بَاباً مُغْلَقاً  رواه البخاري برقم (5623) ، رواه مسلم برقم (2012) . "},
        {"text": "(2) إطفاء النار قبل النوم. \n\n لحديث جابر - رضي الله عنه - السَّابق ، وفيه : أَطْفِئُوا الْمَصَابِيحَ إِذَا رَقَدْتُمْ  .وأيضاً حديث ابن عمر- رضي الله عنهما -، قال النَّبيُّ - صلَّى الله عليه وسلَّم - : لاَ تَتْرُكُوا النَّارَ فِي بُيُوتِكُمْ حِينَ تَنَامُونَ رواه مسلم برقم (2015).وعليه يُقاس أي شيء يكون سبباً في جرِّ الحريق لأهل البيت ، فيُحترز مثلاً من الأشياء التي ربما تؤثر على وسائل التدفئة ؛ لقربها منها ، فتكون سبباً في اشتعال الحريق ونحو ذلك ، لأنَّ العِّلَّة واحدة ، والنار عدوٌّ كما أخبر النَّبيُّ - صلَّى الله عليه وسلَّم -.وبناءً عليه: لو أَمِن النائم من هذه النار، وأنها لن تؤثر بأن لم يكن حولها ما يسبب في انتشارها ، فلا بأس حينئذ من إبقائها ؛ لأنَّ الحكم يدور مع عِلَّته وجوداً ، وعدما . "},
        {"text": "(3) الوضوء قبل النوم . \n\n لحديث البَرَاء بن عازب - رضي الله عنه - أَنَّ رسول اللّه - صلَّى الله عليه وسلَّم - قال: إِذَا أَخَذْتَ مَضْجَعَكَ فَتَوَضَّأْ وُضُوءَكَ لِلصَّلاَة ، ثُمَّ اضْطَجِـعُ علَى شِقِّكَ الأَيْمَنِ ، ثُمَّ قُلِ : اللَّهُمَّ إِنِّي أَسْلَمْتُ وَجْهِي إِلَيْكَ... رواه البخاري برقم (247) ، رواه مسلم برقم (2710) ."},
        {"text": "(4) نفض الفراش قبل الاضطجاع عليه. \n\n لحديث أبي هريرة - رضي الله عنه - قال: قال النَّبيُّ - صلَّى الله عليه وسلَّم - :  إِذَا أَوَى أَحَدُكُمْ إِلَى فِرَاشِهِ فَلْيَنْفُضْ فِرَاشَهُ بِدَاخِلَةِ إِزَارِهِ ، فَإِنَّهُ لَا يَدْرِي مَا خَلَفَهُ عَلَيْهِ ثُمَّ يَقُولُ : بِاسْمِكَ رَبِّ وَضَعْتُ جَنْبِي ... رواه البخاري برقم (6320) ، رواه مسلم برقم (2714) .وداخلة الإزار ، هي : طرفه الداخل الذي يلي الجسد.فمِمَّا تقدَّم ، يتبيَّن أنَّ السُّنَّة أن ينفض فراشه بداخلة إزاره ، وأنَّ النَّفض ثلاث مرات ، وأنه يُسمِّي عند النَّفض.والأفضل أن يكون نفضه بداخلة الثوب ، ومن أهل العلم من قال بأي شيء ، وأهم شيء أن ينفض الفراش ، ومنهم الشيخ ابن جبرين - رحمه الله -، حيث قال :  وليس شرطًا استعمال داخلة الإزار، بل لو نفض الفراش كله ، أو نفضه بعمامة أو نحوها ، حصل المقصود.  انظر : فتوى له برقم (2693) . "},
        {"text": "(5) النوم على الشِّقِّ الأيمن. \n\n ويدلُّ عليه: حديث البَراء بن عَازِبٍ - رضي الله عنه - ، أَنَّ رسول اللّه - صلَّى الله عليه وسلَّم - قال:  إِذَا أَخَذْتَ مَضْجَعَكَ فَتَوَضَّأْ وُضُوءَكَ لِلصَّلاَة ، ثُمَّ اضْطَجِعُ علَى شِقِّكَ الأَيْمَنِ ، ثُمَّ قُلِ: اللَّهُمَّ إِنِّي أَسْلَمْتُ وَجْهِي إِلَيْكَ... رواه البخاري برقم (2710) ، رواه مسلم برقم (247) ."},
        {"text": "(6) وضع يده اليمنى تحت الخَّد الأيمن . \n\n ويدلُّ عليه:حديث حذيفة - رضي الله عنه - قال : كَانَ النَّبِيُّ- صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ -إِذَا أَخَذَ مَضْجَعَهُ مِنْ اللَّيْلِ وَضَعَ يَدَهُ تَحْتَ خَدِّهِ.. رواه البخاري برقم (6314)."},
        {"text": "(7) يُسنُّ لمن استيقظ بالليل قولُ هذا الذكر  \n\n وهو ما جاء في حديث عُبادَة بن الصامت - رضي الله عنه - عنِ النَّبيِّ - صلَّى الله عليه وسلَّم - قال:  مَنْ تَعَارَّ مِنْ اللَّيْلِ فَقَالَ: لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، الْحَمْدُ لِلَّهِ ، وَسُبْحَانَ اللَّهِ ، وَلَا إِلَهَ إِلَّا اللَّهُ ، وَاللَّهُ أَكْبَرُ ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ، ثُمَّ قَالَ:  اللَّهُمَّ اغْفِرْ لِي ، أَوْ دَعَا اسْتُجِيبَ لَهُ ، فَإِنْ تَوَضَّأَ وَصَلَّى قُبِلَتْ صَلَاتُهُ  رواه البخاري برقم  (1154) .قال ابن الأثير - رحمه الله -  :  مَن تَعارَّ منَ الليلِ  أي هبَّ من نومه ، واستيقظ  انظر : النهاية في غريب الأثر ،لابن الأثير (ص108). وفي هذا الحديث بشارتان عظيمتان ، وذلك إذا قال من هبَّ من نومه هذا الذكر، وهو: لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، الْحَمْدُ لِلَّهِ، وَسُبْحَانَ اللَّهِ ، وَلَا إِلَهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ، فلِمَن قال هذا الذكر بشارتان:الأولى : إن قال :  اللَّهُمَّ اغْفِرْ لِي  ، أو دعا ، فإنَّ دعوته مستجابة.الثانية : إن قام فتوضأ ، وصلَّى فصلاته مقبولة ، فالحمد لله الذي منَّ علينا بهذه الفضائل ، ونسأله التوفيق للعمل .فائدة: اختُلف في معنى تعارَّ في الحديث السابق:فقيل: انتبه. وقيل: أنَّ وفزع. وقيل: اليقظة مع صوت.وقيل: استيقظ. وقيل: غير ذلك."},
        {"text": "قراءة أذكار قبل النوم وعددها (15) أذكار \n\n ستجدها في الصفحة الرئيسية للتطبيق ◀️"},
        {"text": "سٌنَن فيما يراه النائم \n\n (1) ما يراه النائم لا يخلو من ثلاث أحوال  \n\n ما يراه النائم لا يخلو من ثلاث أحوال جاءت في حديث أبي هريرة رضي الله عنه عند مسلم:1- رؤيا صالحة، وهي بشرى من الله –عز وجل-، ولها آداب ستأتي.2- رؤيا تحزين، وهي من الشيطان، ولن تضر العبد إذا امتثل آدابها وستأتي.3- أن يرى ما حدث به نفسه قبل نومه، فليست بشيء."},
        {"text": "(2) من رأى رؤيا حسنة , فإنه يُسَنُّ له \n\n عن أبي سلمة - رضي الله عنه – قال : إِنْ كُنْتُ لأَرَى الرؤْيَا تُمْرِضُنِي ، قَالَ فَلَقِيتُ أَبَا قَتَادَةَ ، فَقَالَ: وَأَنَا كُنْتُ لأَرَى الرُّؤيَا فَتُمْرِضُنِي، حَتَّى سَمِعْتُ رَسُولَ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يَقُولُ:  الرُّؤْيَا الصَّالِحَةُ مِنَ اللّهِ، فَإِذَا رَأَى أَحَدُكُمْ مَا يُحِبُّ فَلاَ يُحَدِّثْ بِهَا إِلاَّ مَنْ يُحِبُّ ، وَإِنْ رَأَى مَا يَكْرَهُ فَلْيَتْفِلْ عَنْ يَسَارِهِ ثَلاَثاً، وَلْيَتَعَوَّذْ بِاللّهِ مِنْ شَرِّ الشَّيْطَانِ وَشَرِّهَا، وَلاَ يُحَدِّثْ بِهَا أَحَداً فَإِنَّهَا لَنْ تَضُرَّهُ.وقال أبو سَلَمة :  وَإِنْ كُنْتُ لَأَرَى الرُّؤْيَا أَثْقَلَ عَلَيَّ مِنْ الْجَبَلِ ، فَمَا هُوَ إِلَّا أَنْ سَمِعْتُ هَذَا الْحَدِيثَ فَمَا أُبَالِيهَا  رواه البخاري برقم (5747) ، رواه مسلم برقم (2261) ، وفي رواية :  الرُّؤْيَا الصَّالِحَةُ مِنْ اللَّهِ ، وَالْحُلُمُ مِنْ الشَّيْطَانِ ، فَإِذَا حَلَمَ أَحَدُكُمْ حُلُمًا يَخَافُهُ فَلْيَبْصُقْ عَنْ يَسَارِهِ وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّهَا فَإِنَّهَا لَا تَضُرُّهُ  رواه البخاري برقم (3292) ، رواه مسلم برقم (2261) . وفي حديث جَابِرٍ - رضي الله عنه - عند مسلم ، قال رسول اللّه - صلَّى الله عليه وسلَّم -: و َلْيَسْتَعِذْ بِاللّهِ مِنَ الشَّيْطَانِ ثَلاَثاً ، وَلْيَتَحَوَّلْ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ رواه مسلم برقم (2262) .وفي حديث أَبي سعيد الخُدريِّ - رضي الله عنه -  عند البخاري :  إِذَا رَأَى أَحَدُكُمْ الرُّؤْيَا يُحِبُّهَا فَإِنَّهَا مِنْ اللَّهِ فَلْيَحْمَدْ اللَّهَ عَلَيْهَا  رواه البخاري برقم (7045) .وتحصَّل من الأحاديث السابقة : أنَّ من رأى رؤيا حسنة ، فإنه يُسَنُّ له أن يفعل ما يلي :أولاً : أن يحمد الله عليها ؛ لأنها منه - سبحانه -  .ثانياً : أن يخبر بها ، ولا يخبر بها إلا من يحب .ويُستفاد من الأحاديث السابقة : أنَّ رؤيا المسلم جزء من النبوة ، وأنَّ أصدق الناس رؤيا ، أصدقهم حديثاً في اليقظة ، وهذا من تأثير الصدق ، وبركته على المسلم حتى حال النَّوم ."},
        {"text": "(3) من رأى رؤيا يكرهها , فإنه يُسَنُّ له \n\n عن أبي سلمة - رضي الله عنه – قال : إِنْ كُنْتُ لأَرَى الرؤْيَا تُمْرِضُنِي ، قَالَ فَلَقِيتُ أَبَا قَتَادَةَ ، فَقَالَ: وَأَنَا كُنْتُ لأَرَى الرُّؤيَا فَتُمْرِضُنِي، حَتَّى سَمِعْتُ رَسُولَ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يَقُولُ:  الرُّؤْيَا الصَّالِحَةُ مِنَ اللّهِ، فَإِذَا رَأَى أَحَدُكُمْ مَا يُحِبُّ فَلاَ يُحَدِّثْ بِهَا إِلاَّ مَنْ يُحِبُّ ، وَإِنْ رَأَى مَا يَكْرَهُ فَلْيَتْفِلْ عَنْ يَسَارِهِ ثَلاَثاً، وَلْيَتَعَوَّذْ بِاللّهِ مِنْ شَرِّ الشَّيْطَانِ وَشَرِّهَا، وَلاَ يُحَدِّثْ بِهَا أَحَداً فَإِنَّهَا لَنْ تَضُرَّهُ.وقال أبو سَلَمة :  وَإِنْ كُنْتُ لَأَرَى الرُّؤْيَا أَثْقَلَ عَلَيَّ مِنْ الْجَبَلِ ، فَمَا هُوَ إِلَّا أَنْ سَمِعْتُ هَذَا الْحَدِيثَ فَمَا أُبَالِيهَا  رواه البخاري برقم (5747) ، رواه مسلم برقم (2261) ، وفي رواية :  الرُّؤْيَا الصَّالِحَةُ مِنْ اللَّهِ ، وَالْحُلُمُ مِنْ الشَّيْطَانِ ، فَإِذَا حَلَمَ أَحَدُكُمْ حُلُمًا يَخَافُهُ فَلْيَبْصُقْ عَنْ يَسَارِهِ وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّهَا فَإِنَّهَا لَا تَضُرُّهُ  رواه البخاري برقم (3292) ، رواه مسلم برقم (2261) . وفي حديث جَابِرٍ - رضي الله عنه - عند مسلم ، قال رسول اللّه - صلَّى الله عليه وسلَّم -: و َلْيَسْتَعِذْ بِاللّهِ مِنَ الشَّيْطَانِ ثَلاَثاً ، وَلْيَتَحَوَّلْ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ رواه مسلم برقم (2262) .وفي حديث أَبي سعيد الخُدريِّ - رضي الله عنه -  عند البخاري :  إِذَا رَأَى أَحَدُكُمْ الرُّؤْيَا يُحِبُّهَا فَإِنَّهَا مِنْ اللَّهِ فَلْيَحْمَدْ اللَّهَ عَلَيْهَا  رواه البخاري برقم (7045) .وتحصَّل من الأحاديث السابقة : أنَّ من رأى رؤيا يكرهها ، فإنه يُسَنُّ له أن يفعل ما يلي :أولاً : يتفل ، أو ينفث عن يساره ثلاثاً .ثانياً : أن يستعيذ بالله - تعالى - من الشيطان ، ومن شر ما رأى ثلاثاً ، بأن يقول :أعوذ بالله من الشيطان ومن شرِّها ، ثلاث مرات.ثالثاً : لا يخبر بها أحداً ، فإن فعل ذلك ، فإنها لا تضره كما أخبر النَّبيُّ - صلَّى الله عليه وسلَّم - ، وإن زاد على ذلك بأن :رابعاً : يتحوَّل عن جنبه الذي نام عليه ، فإن كان مستلقياً على ظهره فلينم على جنبه ، وهكذا .خامساً : وأن يقوم فيصلِّي ركعتين ."},
        
    ],
    "yawm_aljumuea": [
        {"text": "صلاة الجمعة \n\n قال الله تعالى : (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نُودِي لِلصَّلاةِ مِنْ يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَى ذِكْرِ اللَّهِ وَذَرُوا الْبَيْعَ ذَلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنتُمْ تَعْلَمُونَ)"},
        {"text": "الاجتهاد في الدعاء \n\nفيه ساعة لا يوافقها عبد مسلم وهو قائم يصلي يسأل الله تعالى شيئاً إلا أعطاه إياه \n\nرواه البخاري (893) ومسلم (852) "},
        {"text": "قراءة سورة الكهف \n\n من قرأ سورة الكهف في يوم الجمعة أضاء له من النور ما بين الجمعتين \n\n رواه الحاكم وصححه الألباني في صحيح الترغيب (836) "},
        {"text": "الإكثار من الصلاة على الرسول \n\n إن من أفضل أيامكم يوم الجمعة، فيه خلق آدم عليه السلام، وفيه قبض، وفيه النفخة، وفيه الصعقة، فأكثروا علي من الصلاة فإن صلاتكم معروضة علي \n\nرواه أبو داود"},

    ],
}




untimed_sunan = {

    "wodu": [
        {"text": "السِّواك . \n\nوذلك قبل البدء بالوضوء ، أو قبل المضمضة ، وهذا هو الموضع الثاني الذي يُسَنُّ فيه السِّواك - وتقدَّم الموضع الأول - فيُسَنّ لمن أراد الوضوء أن يستاك؛ لحديث أبي هريرة - رضي الله عنه - أنَّ رسول الله - صلَّى الله عليه وسلَّم - قال :  لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي لَأَمَرْتُهُمْ بِالسِّوَاكِ مَعَ كُلِّ وُضُوءٍ  . رواه أحمد برقم (9928) ، رواه ابن خزيمة وصححه (1/73/140) ، والحاكم (1/245) ،والبخاري تعليقًا بصيغة الجزم في باب : سواك الرطب واليابس للصائم. ولحديث عائشة – رضي الله عنها – قالت:  كُنَّا نُعِدُّ لَهُ سِوَاكَهُ وَطَهُورَهُ ، فيَبْعَثُهُ الله مَا شَاءَ أَنْ يَبْعَثَهُ مِنَ اللَّيْلِ ، فَيَتَسَوَّكُ وَيَتَوَضَّأُ وَيُصَلِّي ... رواه مسلم برقم (746). "},
        {"text": "التسمية . \n\n لحديث أبي هريرة - رضي الله عنه - مرفوعاً :  لَا وُضُوءَ لِمَنْ لَمْ يَذْكُرِ اسْمَ الله . رواه أحمد برقم (11371) ، وأبو داود برقم (101)، وابن ماجه برقم (397)."},
        {"text": "غسل الكفين ثلاثًا. \n\n لحديث عثمان - رضي الله عنه - في صِفة وضوء النَّبي - صلَّى الله عليه وسلَّم -  وفيه: دَعَا بِوَضُوءٍ ، فَتَوَضَّأَ فَغَسَلَ كَفَّيْهِ ثَلاَثَ مَرَّاتٍ... ،  ثم قال :  رَأَيْتُ النَّبِيَّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يَتَوَضَّأُ نَحْوَ وُضُوئِي هَذَا . رواه البخاري برقم (164) ، رواه مسلم برقم (226)"},
        {"text": "التَّيامن في غسل اليدين، والقدمين . \n\n لحديث عائشةَ - رضي الله عنها - قالت :  كَانَ النَّبِيُّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يُعْجِبُهُ التَّيَمُّنُ فِي تَنَعُّلِهِ وَتَرَجُّلِهِ وَطُهُورِهِ وَفِي شَأْنِهِ كُلِّهِ  . رواه البخاري برقم (168) ، رواه مسلم برقم (268) ."},
        {"text": "البداءة بالمضمضة، والاستنشاق . \n\n لحديث عثمان - رضي الله عنه - في صِفة وضوء النَّبي - صلَّى الله عليه وسلَّم - : ... فَمَضْمَضَ ، وَاسْتَنْثَرَ ، ثُمَّ غَسَلَ وَجْهَهُ ثَلاَثَ مَرَّاتٍ... رواه البخاري برقم (199) ، رواه مسلم برقم (226) ، فإن أخَّر المضمضة والاستنشاق بعد غسل الوجه جاز ."},
        {"text": "المبالغة في المضمضة، والاستنشاق لغير الصائم . \n\n لحديث لقيط بن صبرة - رضي الله عنه - أنَّ النَّبيّ - صلَّى الله عليه وسلَّم - قال له :  أَسْبِغ الوُضُوءَ، وخَلِّلْ بَيْنَ الأصَابِعِ ، وبَالِغْ فِي الاسْتِنْشَاقِ إِلاَّ أَنْ تَكُونَ صَائِماً رواه أحمد برقم (17846) ، وأبو داود برقم (142). وقال ابن حجر:هذا حديث صحيح الإصابة (9/15)، و أُخذِت المبالغة في المضمضمة من قوله : أَسْبِغ الوُضُوءَ. "},
        {"text": "المضمضة، والاستنشاق من كفٍّ واحدة. \n\n لحديث عبد الله بن زيد - رضي الله عنه - في صِفة وضوء النَّبي - صلَّى الله عليه وسلَّم - قال :  .... أَدْخَلَ يَدَهُ فَاسْتَخْرَجَهَا، فَمَضْمَضَ وَاسْتَنْشَقَ مِنْ كَفِ وَاحِدَةٍ، فَفَعَلَ ذلِكَ ثَلاَثاً... رواه البخاري برقم (192) ، رواه مسلم برقم (235) . "},
        {"text": "في مسح الرأس تُسَنُّ الصِّفة المسنونة. \n\n وهي أن يبدأ في مسحه لرأسه فيضع يديه في مقدَّم رأسه ، ثم يذهب بهما إلى قِفا رأسه ، ثم يرجعهما للمكان الذي بدأ منه ، والمرأة أيضاً تفعل هذه السُّنَّة بنفس الطريقة ، وما زاد من الشعر عن عنق المرأة فإنه لا يُمسح .ويدلّ عليه :حديث عبد الله بن زيد - رضي الله عنه - في صِفة وضوء النَّبيّ - صلَّى الله عليه وسلَّم - وفيه :  بَدَأَ بِمُقَدَّمِ رَأْسِهِ ثُمَّ ذَهَبَ بِهِمَا إِلَى قَفَاهُ، ثُمَّ رَدَّهُمَا حَتَّى رَجَعَ إِلَى الْمَكَانِ الَّذِي بَدَأَ مِنْهُ . رواه البخاري برقم (185) ، رواه مسلم برقم (235) ."},
        {"text": "التثليث في غسل الأعضاء . \n\nالغَسْلَة الأولى واجبة ، وأمَّا الثانية ، والثالثة فهي سُنَّة ، ولا يُزاد على ثلاث .ويدلّ عليه :ما ثبت عند البخاري - رحمه الله - من حديث ابن عباس - رضي الله عنهما - : أنَّ النَّبيّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - تَوَضَأَ مَرَّة ، مرَّة رواه البخاري برقم (157)، وثبت عند البخاري أيضا من حديث عبد الله بن زيد - رضي الله عنه - : أَنَّ النَّبِيَّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - تَوَضَّأَ مَرَّتَيْنِ ،مَرَّتَيْنِ رواه البخاري برقم (158)، وثبت في الصحيحين من حديث عثمان - رضي الله عنه – : أنَّ النَّبيّ - صلَّى الله عليه وسلَّم - توضأ ثلاثا رواه البخاري برقم (159)، ولذا فمن الأفضل التنويع أحياناً ، فأحياناً يتوضأ مرَّة ، مرَّة ، وأحياناً مرَّتين ، مرَّتين ، وأحياناً ثلاثاً ، ثلاثاً ، وأحياناً يخالف في العدد، فيغسل مثلاً الوجه ثلاثاً ، واليدين مرتين ، والقدمين مرَّة ،كما في الصحيحين من حديث عبد الله بن زيد - رضي الله عنه - في رواية أخرى انظر : زاد المعاد (1 / 192)، ولكن الأغلب أن يأتي بالكمال ثلاثاً ، ثلاثاً ، فهو هدي النَّبي - صلَّى الله عليه وسلَّم - . "},
        {"text": "الدعاء الوارد بعد الوضوء. \n\n عن عمر - رضي الله عنه -  قال : قال رسول الله - صلَّى الله عليه وسلَّم:  مَا مِنْكُمْ مِنْ أَحَدٍ يَتَوَضَأُ فَيُبْلِغُ - أَوْ فَيُسْبِغُ - الْوُضُوءَ ثُمَّ يَقُولُ: أَشْهَدُ أَنَّ لاَ إِلهَ أَلاَّ اللّهُ ، وَأَنَّ مُحمَّداً عَبْدُ اللّهِ وَرَسُولُهُ ، إلاَّ فُتِحَتْ لَهُ أَبْوَابُ الْجَنَّةِ الثَّمَانِيَةُ، يَدْخُلُ مِنْ أَيِّهَا شَاءَ رواه مسلم برقم (234).أو : ما جاء في حديث أبي سعيد - رضي الله عنه - مرفوعا ً:  من توضأ ففرغ من وضوئه فقال: سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لا إِلَهَ إلاَّ أَنْتَ، أَسْتَغْفِرُكَ وأَتُوبُ إلَيْكَ طَبَعَ اللهُ عَلَيْهَا بِطَابِع (الطابع : بفتح الباء وكسرها، لغتان فصيحتان، وهو: الخاتم، ومعنى طَبَعَ: خَتَمَ) ثُمَّ رُفِعَتْ تَحْتَ الْعَرْش فَلَمْ تُكْسَر إِلَى يَوْمِ القِيَامَةِ  رواه النسائي في عمل اليوم والليلة (ص147) ، رواه الحاكم (1/752)، وصحح إسناده ابن حجر-رحمه الله-  انظر : نتائج الأفكار ( 1/246 )، وبيَّن أنه إن لم يصحّ مرفوعاً فهو موقوف، ولن يضره ذلك ؛ لأن له حكم الرفع ، لأنه مما لا مجال فيه للرأي ."},

    ],
    "azaan": [
        {"text": "متابعة المؤذِّن . \n\n يُسَنَّ لمن سمع الأذان أن يقول مثل ما يقول المؤذِّن ، إلا في الحيعلتين ، فيقول:  لا حول ولا قوة إلا بالله  .لحديث عبد اللّه بن عمرو بن العاص - رضي الله عنهما - أَنَّهُ سمع النَّبيَّ - صلَّى الله عليه وسلَّم - يَقُولُ: إِذَا سَمِعْتُمُ الْمُؤَذِّنَ فَقُولُوا مِثْلَ مَا يَقُولُ ... رواه مسلم برقم (384)، وحديث عمر بن الخطاب - رضي الله عنه-  قال: قال رسول اللّه - صلَّى الله عليه وسلم- :  إِذَا قَالَ الْمُؤَذِّنُ: اللّهُ أَكْبَرُ اللّهُ أَكْبَرُ. فَقَالَ أَحَدُكُمْ: اللّهُ أَكْبَرُ الله أَكْبَرُ. ثُمَّ قَالَ: أَشْهَدُ أَنْ لاَ إِلهَ إِلاَّ اللّهُ. قَالَ: أَشْهَدُ أَنْ لاَ إِلهَ إِلاَّ الله. ثُمَّ قَالَ: أَشْهَدُ أَنَّ مُحَمَّداً رَسُولُ اللّهِ. قَالَ: أَشْهَدُ أَنَّ مُحَمَّداً رَسُولُ اللّهِ. ثُمَّ قَالَ: حَيَّ عَلَى الصَّلاَةِ. قَالَ: لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بالله. ثُمَّ قَالَ: حَيَّ عَلَى الْفَلاَحِ. قَالَ: لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِالله. ثُمَّ قَالَ: الله أَكْبَرُ الله أَكْبَرُ. قَالَ: الله أَكْبَرُ الله أَكْبَرُ. ثُمَّ قَالَ: لاَ إِلهَ إِلاَّ الله. قَالَ: لاَ إِلهَ إِلاَّ الله، مِنْ قَلْبِهِ دَخَلَ الْجَنَّةَ. رواه مسلم برقم (385) .عند التثويب لصلاة الفجر، فإنه من تابع الأذان يقول مثل ما يقول المؤذن:  الصلاة خير من النوم  ."},
        {"text": "قول الذِّكر المخصوص بعد الشهادتين. \n\n يُسَنّ أن يقال بعد ما يقول المؤذن :  أشهد أن محمداً رسول الله  الثانية ، ما جاء في حديث سعد - رضي الله عنه - عن رسول الله - صلَّى الله عليه وسلَّم - أنه قال :  مَنْ قَالَ حِينَ يَسْمَعُ الْمُؤَذِّنَ: أَشْهَدُ أَنْ لاَ إِلهَ إِلاَّ الله وَحْدَهُ لاَ شَرِيكَ لَهُ، وَأَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، رَضِيتُ بِالله رَبَّاً ، وَبِمُحَمَّدٍ رَسُولاً ، وَبِالإِسْلاَمِ دِيناً، غُفِرَ لَهُ ذَنْبُهُ . رواه مسلم برقم (386) ."},
        {"text": "الصلاة على النَّبيِّ - صلَّى الله عليه وسلَّم - بعد الأذان . \n\n لحديث عبد الله بن عمرو - رضي الله عنهما -  قال : قال رسول الله - صلَّى الله عليه وسلَّم - : إِذَا سَمِعْتُمُ الْمُؤَذِّنَ فَقُولُوا مِثْلَ مَا يَقُولُ، ثُمَّ صَلُّوا عَلَيَّ ، فَإِنَّهُ مَنْ صَلَّى عَلَيَّ صَلاَةً صَلَّى الله عَلَيْهِ بِهَا عَشْراً، ثُمَّ سَلُوا الله لِي الْوَسِيلَةَ، فَإِنَّهَا مَنْزِلَةٌ فِي الْجَنَّةِ لاَ تَنْبَغِي إِلاَّ لِعَبْدٍ مِنْ عِبَادِ الله، وَأَرْجُو أَنْ أَكُونَ أَنَا هُوَ، فَمَنْ سَأَلَ لِيَ الْوَسِيلَةَ حَلَّتْ له الشَّفَاعَةُ. رواه مسلم برقم (384) .وأفضل أنواع الصلاة :الصلاة الإبراهيمية :  اللهم صلِّ على محمد وعلى آل محمد ،كما صليت على إبراهيم...."},
        {"text": "قول الدعاء الوارد بعد الأذان. \n\n لحديث جابر- رضي الله عنه - قال : قال رسول الله - صلَّى الله عليه وسلَّم - :  مَنْ قَالَ حِينَ يَسْمَعُ النِّدَاءَ : اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلَاةِ الْقَائِمَةِ ، آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ ، وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ ، حَلَّتْ لَهُ شَفَاعَتِي يَوْمَ الْقِيَامَةِ . رواه البخاري برقم (614)."},
        {"text": "الدعاء بعد الأذان. \n\n لحديث عبد الله بن عمرو - رضي الله عنهما - :  أَنَّ رَجُلاً قال: يَا رسولَ الله إِنَّ المُؤَذِّنِينَ يَفْضُلُونَنَا، فقال رسولُ الله - صلَّى الله عليه وسلَّم -: قُلْ كَمَا يَقُولُونَ فإِذَا انْتَهَيْتُ فَسَلْ تُعْطَهُ. رواه أبو داود برقم (524) ، وحسنه ابن حجر (نتائج الأفكار 1/367) ، والألباني (صحيح الكلم الطيب ص 73).ولحديث أنس - رضي الله عنه - أنَّ النَّبيّ - صلَّى الله عليه وسلَّم - قال: الدُعَاءُ بَيْنَ الأَذَانِ وَالإقَامَةِ لا يُرَدّ . رواه النسائي برقم (9895) ، وصححه ابن خزيمة (1/221/425) .فائدة : الخروج من المسجد بعد الأذان منهي عنه .ويدلّ عليه : ما رواه مسلم من حديث أبي الشَّعثاءِ - رضي الله عنه- قال: كُنَّا قُعُوداً فِي الْمَسْجِدِ مَعَ أَبِي هُرَيْرَةَ -رَضِيَ اللهُ عَنَه - فَأَذَّنَ الْمُؤَذِّنُ، فَقَامَ رَجُلٌ مِنَ الْمَسْجِدِ يَمْشِي، فَأَتْبَعَهُ أَبُو هُرَيْرَةَ - رَضِيَ الله عَنَه - بَصَرَهُ حَتَّى خَرَجَ مِنَ الْمَسْجِدِ، فَقَالَ أَبُو هُرَيْرَةَ - رَضِيَ اللهُ عَنَهُ - : أَمَّا هَـذَا فَقَدْ عَصَى أَبَا الْقَاسِمِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ -. رواه مسلم برقم (655)."},

    ],

    "mazjed": [
        {"text": "يُسَنُّ التبكير بالذهاب إلى المسجد. \n\n لحديث أبي هريرة - رضي الله عنه - قال : قال رسول الله - صلَّى الله عليه وسلَّم- :  لَوْ يَعْلَمُونَ مَا فِي التَّهْجِيرِ لاَسْتَبَقُوا إِلَيْهِ. رواه البخاري برقم (615) ، رواه مسلم برقم (437).  والتهجير : هو التبكير للصلاة . "},
        {"text": "أن يخرج من بيته متطهراً ؛ لتكتب خطاه. \n\n لحديث أبي هريرة - رضي الله عنه -  قال: قال رسول اللّه - صلَّى الله عليه وسلَّم - : صَلاَةُ الرَّجُلِ فِي جَمَاعَةٍ تَزِيدُ عَلَى صَلاَتِهِ فِي بَيْتِهِ، وَصَلاَتِهِ فِي سُوقِهِ، بِضْعاً وَعِشْرِينَ دَرَجَةً ، وَذلِكَ أَنَّ أَحَدَهُمْ إِذَا تَوَضَّأَ فَأَحْسَنَ الْوُضُوءَ ثُمَّ أَتَى الْمَسْجِدَ، لاَ يَنْهَزُهُ إِلاَّ الصَّلاَةُ، لاَ يُرِيدُ إِلاَّ الصَّلاَةَ ، فَلَمْ يَخْطُ خَطْوَةً إِلاَّ رُفِعَ لَهُ بِهَا دَرَجَةٌ ، وَحُطَّ عَنْهُ بِهَا خَطِيئَةٌ ، حَتَّى يَدْخُلَ الْمَسْجِدَ ، فَإِذَا دَخَلَ الْمَسْجِدَ كَانَ فِي الصَّلاَةِ مَا كَانَتِ الصَّلاَةُ هِيَ تَحْبِسُهُ ، وَالْمَلاَئِكَةُ يُصَلُّونَ عَلَى أَحَدِكُمْ مَا دَامَ فِي مَجْلِسِهِ الَّذِي صَلَّى فِيهِ ، يَقُولُونَ: اللَّهُمَّ ارْحَمْهُ ، اللَّهُمَّ اغْفِرْ لَهُ ، اللّهُمَّ تُبْ عَلَيْهِ ، مَا لَمْ يُؤْذِ فِيهِ ، مَا لَمْ يُحْدِثْ فِيهِ . رواه مسلم برقم (649) "},
        {"text": "أن يخرج إلى الصلاة بسكينة، ووقار \n\n لحديث أبي هريرة - رضي الله عنه - عن النبيِّ - صلَّى الله عليه وسلَّم - قال: إِذَا سَمِعْتُمْ الْإِقَامَةَ فَامْشُوا إِلَى الصَّلَاةِ ، وَعَلَيْكُمْ بِالسَّكِينَةِ وَالْوَقَارِ ، وَلَا تُسْرِعُوا فَمَا أَدْرَكْتُمْ فَصَلُّوا ، وَمَا فَاتَكُمْ فَأَتِمُّوا . رواه البخاري برقم (636) ، رواه مسلم برقم (602) .قال النووي -رحمه الله -:  ... السكينة : التأنَّي في الحركات، واجتناب العبث، والوقار : في الهيئة كغض الطرف ، وخفض الصوت ، وعدم الالتفات. شرح مسلم للنووي، حديث(602) ، باب استحباب إتيان الصلاة بوقار، وسكينة، والنهي عن إتيانها سعياً."},
        {"text": "تقديم الرجل اليمنى عند دخول المسجد، وتقديم اليسرى عند الخروج منه \n\n لحديث أنس - رضي الله عنه - أنه قال : من السُّنَّة إذا دخلت المسجد أن تبدأ برجلك اليمنى ، وإذا خرجت أن تبدأ برجلك اليسرى رواه الحاكم (1/338) ، وصححه على شرط مسلم."},
        {"text": "أن يقول الذِّكر الوارد عند دخول المسجد، وعند الخروج منه \n\n لحديث أبي حميد ، أو أبي أسيد قال: قال رسول اللّه - صلَّى الله عليه وسلَّم- :  إِذَا دَخَلَ أَحَدُكُمْ الْمَسْجِدَ، فَلْيَقُلِ: اللّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ ، وَإِذَا خَرَجَ ، فَلْيَقُلِ: اللّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ . رواه مسلم برقم (713) ."},
        {"text": "أن يُصلِّي ركعتين تحية للمسجد. \n\n وهذا إذا جاء مبكراً للصلاة ، فإنه يُسَنّ له ألّا يجلس حتى يصلِّي ركعتين ؛ لحديث أبي قتادة - رضي الله عنه - قال: قال النَّبيُّ - صلَّى الله عليه وسلَّم- :  إِذَا دَخَلَ أَحَدُكُمْ الْمَسْجِدَ فَلَا يَجْلِسْ حَتَّى يُصَلِّيَ رَكْعَتَيْنِ. رواه البخاري برقم (1163) ، رواه مسلم برقم (714).ويكفي عن تحية المسجد السُّنَّة القَبْلِية للصلاة إن كان لها سُنَّة قبلية كالفجر، والظهر ، أو سُنَّة الضحى إن دخل المسجد ضحى ، أو الوتر إن صلَّاه في المسجد ، أو الفرض ؛ لأن المقصود من تحية المسجد : ألَّا يجلس حتى يُصلِّي ؛ لِمَا في ذلك من عمارة المساجد بالصَّلاة ؛ لئلا يرتادها من غير صلاة."},
        {"text": "يُسَن للرجال المبادرة إلى الصَّف الأول \n\n يُسَن للرجال المبادرة إلى الصَّف الأول ، فهو أفضل الصفوف ، وللنِّساء أفضلها آخرها .لحديث أبي هريرة - رضي الله عنه - أنَّ النَّبيّ - صلَّى الله عليه وسلَّم -  قال:  خَيْرُ صُفُوفِ الرِّجَالِ أَوَّلُهَا، وَشَرُّهَا آخِرُهَا، وَخَيْرُ صُفُوفِ النِّسَاءِ آخِرُهَا، وَشَرُّهَا أَوَّلُهَا رواه مسلم برقم (440)، خيرها ، أي: أكثرها ثواباً وفضلاً ، وشرها ، أي: أقلّها ثواباً وفضلاً.وهذا الحديث فيما إذا صلَّى الرجال والنَّساء جماعة ، وليس بينهما حائل من جدار ونحوه ، فتكون خير صفوف النساء آخرها ؛ لأنه أسترُ لهنَّ عن أعين الرجال ، وأمَّا إذا كان بينهما حائل كجدار ونحوه ، أو كما يكون في كثير من مساجدنا اليوم بأن يُخصَّص للنساء مُصلَّى مستقل ففي هذه الحالة تكون أفضل صفوف النِّساء أولها ؛ لانتفاء عِلَّة القُرب من الرِّجال ؛ لأنَّ الحكم يدور مع عِلَّته وجوداً وعدما ، ولعموم فضل الصَّف الأول في أحاديثٍ منها:حديث أبي هريرة - رضي الله عنه- أَنَّ رسول اللّه - صلَّى الله عليه وسلَّم- قال: لَوْ يَعْلَمُ النَّاسُ مَا فِي النِّدَاءِ وَالصَّفِّ الأَوَّل ، ثُمَّ لَمْ يَجِدُوا إِلاَّ أَنْ يَسْتَهِمُوا عَلَيْهِ لاَسْتَهَمُوا، وَلَوْ يَعْلَمُونَ مَا فِي التَّهْجِيرِ لاَسْتَبَقُوا إِلَيْهِ ، وَلَوْ يَعْلَمُونَ مَا فِي الْعَتَمَةِ - أي : العِشَاء- وَالصُّبْحِ، لأَتَوْهُمَا وَلَوْ حَبْواً  رواه البخاري برقم (615) ، رواه مسلم برقم (437)."},
        {"text": "يُسَنُّ للمأموم أن يكون قريباً من إمامه. \n\n فالأفضل في حقِّ المأموم من حيث اصطفافه للصَّلاة الصف الأول كما تقدَّم، ثُم يحرص أن يكون قريباً من الإمام ، فالأقرب من الجهتين اليمنى أو اليسرى هو الأفضل. ويدلّ عليه :حديث عبد اللّه بن مسعود - رضي الله عنه - قال: قال رسول اللّه - صلَّى الله عليه وسلَّم -: ليَلِنِي مِنْكُمْ أُولُو الأَحْلاَمِ وَالنُّهَى رواه أبو داود برقم (674) ، رواه الترمذي برقم (228) ، فقوله :  ليَلِنِي  أي : ليقترب مني ،  وفي هذا دليل على أنَّ القرب من الإمام مطلوب في أي جهة كان ."},

    ],

        "salah": [
        {"text": "السترة وعددها (4) سنن \n\n (1) يُسَنُّ اتخاذ السترة . \n\n  والسترة سُنَّة للإمام والمنفرد ، وأمَّا المأموم فسترة الإمام سترة له ، فاتخاذ السترة سُنَّة .لحديث أبي سعيد الخدري - رضي الله عنه - مرفوعاً ، وفيه : إِذَا صَلَّى أَحَدُكُمْ إِلَى شَيْءٍ يَسْتُرُهُ مِنَ النَّاسِ... رواه البخاري برقم (509) ، رواه مسلم برقم (505).  والأحاديث في سنيَّة السترة كثيرة فقد استتر النَّبيُّ بالسرير ، والجدار ، والجذع ، والخشبة ، والحربة ، والعَنَزَة ، والراحلة، وغير ذلك .والسترة مشروعة في العمران والفضاء ، في الحضر والسَّفَر ، سواءً خشي ماراً أولم يخشَ ؛ لأن الأحاديث لم تفرِّق بين العمران والفضاء ؛ ولأنَّ النبي - صلَّى الله عليه وسلَّم - كان يستتر في حضره وسفره ، كما في حديث أبي جحيفة- رضي الله عنه -. رواه البخاري برقم (501) ،  رواه مسلم برقم (503) ."},
        {"text": "(2) يُسنُّ الدنو من السترة. \n\n وإذا دنا من السترة؛ فإن السُّنَّة أن يكون بين موضع سجوده وبين السُّترة قدر ممر الشَّاة.لحديث سهل بن سعد السَّاعدي - رضي الله عنه - قال: كَانَ بَيْنَ مُصَلَّى رَسُولِ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - وَبَيْنَ الْجِدَارِ مَمَرُّ الشَّاةِ رواه البخاري برقم (496) ، رواه مسلم برقم (508) ، والمقصود بالمُصلَّى هو: موضع سجوده - صلَّى الله عليه وسلَّم - وجاء عند أحمد ، وأبي داود أنَّ بينه وبين السترة ثلاثة أذرع - رواه أحمد برقم (6231) ، وأبو داود برقم (2024)، وصححه الألباني (صحيح ابي داود 6/263) وأصله في البخاري برقم (506)، وهذا باعتبار إذا وقف يكون بينهما كذلك."},
        {"text": "(3) يُسَنُّ ردُّ المارّ بين يدي المصلِّي. \n\nلحديث أبي سعيد - رضي الله عنه- قال : قال رسول الله - صلَّى الله عليه وسلَّم - : إِذَا صَلَّى أَحَدُكُمْ إِلَى شَيْءٍ يَسْتُرُهُ مِنَ النَّاسِ، فَأَرَادَ أحد أَنْ يَجْتَازَ بَيْنَ يَدَيْهِ، فَلْيَدْفَعْ فِي نَحْرِهِ ، فَإِنْ أَبَى فَلْيُقَاتِلْهُ ، فَإِنَّمَا هُوَ شَيْطَانٌ رواه مسلم برقم (505).وأمَّا إذا كان المارّ بين يدي المصلِّي امرأة ، أو كلب أسود ، أو حمار فإنه يجب دفعه على الصحيح؛ لأنها تقطع الصلاة كما في حديث أبي ذر -رضي الله عنه- رواه مسلم برقم (510)، بخلاف غيرها فإنه لا يقطع الصلاة، واختاره شيخنا ابن عثيمين رحمه الله. "},
        {"text": "(4) يُسَنّ التسوك عند كل صلاة . \n\n ويدلّ عليه :حديث أبي هريرة - رضي الله عنه -  أَنَّ رسول الله - صلَّى الله عليه وسلَّم- قال:  لَوْلَا أَنْ أَشُقَّ عَلَى أُمَّتِي أَوْ عَلَى النَّاسِ لَأَمَرْتُهُمْ بِالسِّوَاكِ مَعَ كُلِّ صَلَاةٍ  رواه البخاري برقم (887) ."},
        {"text": "سنن القيام وعددها (10) سنن \n\n (1) رفع اليدين عند تكبيرة الإحرام . \n\n لحديث ابن عمر - رضي الله عنهما -: أَنَّ رَسُولَ اللهِ- صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - كانَ يَرْفَعُ يديه حَذْوَ مَنكِبيهِ إذا افتَتحَ الصلاةَ ، وإذا كَبَّرَ  للرُّكوعِ ، وإذا رَفعَ رأْسَهُ منَ الرُّكوعِ رفَعَهما أَيضاً وقال: سَمعَ اللّهُ لمن حَمِده ربَّنا ولكَ الحمدُ، وكان لا يَفعلُ ذلكَ في السُّجودِ رواه البخاري برقم (735)، رواه مسلم برقم (390).قال ابن هبيرة - رحمه الله - : وأجمعوا على أنَّ رفع اليدين عند تكبيرة الإحرام سُنَّة ، وليس بواجب انظر : الإفصاح (1/123) . ومواضع رفع اليدين التي وردت فيها النصوص أربعة مواضع :- عند تكبيرة الإحرام.- وعند الركوع.- وعند الرفع منه.وهذه الثلاثة ثابتة في الصحيحين عن ابن عمر - رضي الله عنهما - أَنَّ رَسُولَ اللهِ- صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - كانَ يَرْفَعُ يديه حَذْوَ مَنكِبيهِ إذا افتَتحَ الصلاةَ ، وإذا كَبَّرَ  للرُّكوعِ ، وإذا رَفعَ رأْسَهُ منَ الرُّكوعِ رفَعَهما أَيضاً وقال: سَمعَ اللّهُ لمن حَمِده ربَّنا ولكَ الحمدُ، وكان لا يَفعلُ ذلكَ في السُّجودِ رواه البخاري برقم (735)، رواه مسلم برقم (390).والموضع الرابع : عند القيام من التشهد الأول، وهذا ثابت عن ابن عمر - رضي الله عنهما-  أيضاً في صحيح البخاري."},
        {"text": "(2) يُسَنُّ عند رفع اليدين أن تكون الأصابع ممدودة. \n\n لحديث أبي هريرة - رضي الله عنه - قال : أَنَّ النَّبِيَّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - كَانَ إِذَا قَامَ إِلَى الصَّلَاةِ رَفَعَ يَدَيْهِ مَدًّا رواه أحمد برقم (8875)، وأبو داود برقم (753) ، والترمذي برقم (240)، وصححه الألباني (صحيح أبي 3/341)."},
        {"text": "(3) يُسَنُّ أن يكون رفع اليدين إلى الموضع المسنون. \n\n وجاءت النصوص بوجهين عن النَّبيِّ - صلَّى الله عليه وسلَّم- في حدِّ رفع اليدين ، فقد جاء حذو المنكبين في الصحيحين عن ابن عمر - رضي الله عنهما – رواه البخاري برقم (735)، ومسلم برقم (390)، وجاء حذو فروع الأذنين - أي : حذو عوالي الأذنين - عند مسلم ، من حديث مالك بن الحويرث - رضي الله عنه - رواه مسلم برقم (391)، فيُنوِّع المصلِّي تارة يفعل هذه ، وتارة هذه ."},
        {"text": "(4) يُسَنُّ للمصلي بعد تكبيرة الإحرام أن يضع يدَه اليمنى على اليسرى. \n\n وهذا بإجماع أهل العلم ، كما نقله ابن هبيرة - رحم الله الجميع - انظر : الإفصاح ( 1/124 )."},
        {"text": "(5) يُسَنُّ أن يقبض بيده اليمنى اليدَ اليسرى . \n\n الصِّفَة الأولى : يضع يده اليمنى على يده اليسرى ؛ لحديث وائل بن حجر - رضي الله عنه - قال :  رَأَيْتُ رَسُولَ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - إذَا كَانَ قَائِمًا فِي الصَّلاةِ ، قَبَضَ بِـيَمِينِهِ عَلَى شِمَالِهِ. رواه أبو داود برقم (755)، رواه النَّسائي برقم (888) ، وصححه الألباني .والصِّفَة الثانية : أن يضع اليد اليمنى على الذراع اليسرى ؛ لحديث سهل بن سعد - رضي الله عنه - قال :  كَانَ النَّاسُ يُؤْمَرُونَ أَنْ يَضَعَ الرَّجُلُ الْيَدَ الْيُمْنَى ، عَلَى ذِرَاعِهِ الْيُسْرَى فِي الصَّلَاةِ  رواه البخاري برقم (740) .فهو مرَّة يضعها على اليد ، ومرَّة على الذراع ؛ لينوِّع في تطبيق السُّنَّة ."},
        {"text": "(6) يُسَنُّ أن يقول دعاء الاستفتاح. \n\n ولدعاء الاستفتاح عِدَّة صيغ ، يُستحب أن يُنوِّع بينها ، فمرَّة يأتي بهذه الصِّيغة ، ومرَّة بهذه ، وممِّا ورد :أ.  سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ ، تَبَارَكَ اسْمُكَ وَتَعَالَى جَدُّكَ ، وَلاَ إِلهَ غَيْرُكَ  - رواه أحمد برقم (11473)، وأبو داود برقم (776) ، والترمذي (243) ، والنَّسائي (900) ، من حديث أبي سعيد - رضي الله عنه -، والحديث فيه مقال وله طرق يتقوى بها، وقد حسنه ابن حجر (نتائج (الأفكار1/412) ، وجاء عند مسلم أنَّ عمر - رضي الله عنه - كان يجهر به ؛ ليعلمه الصحابة - رضي الله عنهم أجمعين - رواه مسلم برقم (399) .ب.  الْحَمْدُ للّهِ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ  ، وفي فضله قال رسول الله - صلَّى الله عليه وسلَّم- :  لَقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكاً يَبْتَدِرُونَهَا. أَيُّهُمْ يَرْفَعُهَا رواه مسلم برقم (600) ، من حديث أنس - رضي الله عنه -. ج .اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ رواه البخاري برقم (744)، رواه مسلم برقم (598)، من حديث أبي هريرة -رضي الله عنه- .د.  اللّهُ أَكْبَرُ كَبِيراً ، وَالْحَمْدُ للّهِ كَثِيراً ، وَسُبْحَانَ اللّهِ بُكْرَةً وَأَصِيلاً  ، وفي فضله قال رسول الله - صلَّى الله عليه وسلم- :  عَجِبْتُ لَهَا ، فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ رواه مسلم برقم (601) ، من حديث ابن عمر - رضي الله عنهما -."},
        {"text": "(7) الاستعاذة. \n\n والاستعاذة سُنَّة ، ويُسَنُّ أن يُنوِّع في صيغ الاستعاذة ، فمرَّة يأتي بهذه ، ومرَّة هذه ومما ورد :أ.  أعوذ بالله من الشيطان الرجيم .وهي الصِّفَة التي اختارها جمهور العلماء - رحمهم الله - ؛ لقوله تعالى:{فَإِذَا قَرَأْتَ الْقُرْآنَ فَاسْتَعِذْ بِاللّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ} [النحل : 98].ب.  أعوذ بالله السميع العليم من الشيطان الرجيم .لقوله تعالى : {وَإِمَّا يَنزَغَنَّكَ مِنَ الشَّيْطَانِ نَزْغٌ فَاسْتَعِذْ بِاللَّهِ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ} [فصلت : 36]."},
        {"text": "(8) البسملة . \n\n فمن السُّنَّة أن يُبسمل بعد الاستعاذة ، فيقول :  بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ ؛ لحديث نعيم المجمر- رضي الله عنه - قال :  صَلَّيْتُ وَرَاءَ أَبِي هُرَيْرَةَ - رَضِيَ اللهُ عَنَهُ -  فَقَرَأَ: بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيمِ ، ثُمَّ قَرَأَ بِأُمِّ القُرْآن ... ، وفيه : وَالَّذِي نَفْسِي بِيَدِهِ، إِنِّي لأَشْبَهُكُمْ صَلاةً بِرَسُولِ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ-  رواه النَّسَائي برقم (906) ، رواه ابن خزيمة وصححه (1/251)، قال الدارقطني: هذا حديث صحيح ، ورواته كلهم ثقات السنن (2/46).والصَّارف عن الوجوب أيضاً : أنَّ النَّبيّ - صلَّى الله عليه وسلَّم -لم يُعلِّمها المسيء في صلاته ، وإنما أرشده إلى فاتحة الكتاب ،كما في حديث أبي هريرة - رضي الله عنه - المتفق عليه - رواه البخاري برقم (757) ، رواه مسلم برقم (397)."},
        {"text": "(9) التأمين مع الإمام. \n\n وذلك إذا قرأ الإمام الفاتحة في الجهرية فإنَّ من السُّنَّة أن يؤمِّن المأموم إذا أمَّن الإمام ؛ لحديث أبي هريرة - رضي الله عنه- أنَّ النَّبيّ - صلَّى الله عليه وسلَّم-  قال:إِذَا أَمَّنَ الإِمَامُ فَأَمِّنُوا ، فإِنَّهُ مَنْ وَافَقَ تَأْمِينُهُ تَأْمِينَ الْمَلاَئِكَةِ، غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ رواه البخاري برقم (780) ، رواه مسلم برقم (410)."},
        {"text": "(10) قراءة السورة التي بعد الفاتحة. \n\n فقراءتها سُنَّة في الركعتين الأولى ، والثانية ، وهو قول جمهور العلماء - رحمهم الله - ؛ لحديث أبي قتادة - رضي الله عنه - قال:  كَانَ النَّبِيُّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ- يَقْرَأُ فِي الرَّكْعَتَيْنِ الْأُولَيَيْنِ مِنْ صَلَاةِ الظُّهْرِ بِفَاتِحَةِ الْكِتَابِ ، وَسُورَتَيْنِ يُطَوِّلُ فِي الْأُولَى وَيُقَصِّرُ فِي الثَّانِيَةِ  رواه البخاري برقم (759)، رواه مسلم برقم (451)  .وأمَّا المأموم في الصلاة الجهرية لا يقرأ السورة التي بعد الفاتحة بل يستمع لإمامه .قال ابن قدامة - رحمه الله - :  لا نعلم بين أهل العلم خلافا في أنه يُسَنَّ قراءة سورة بعد الفاتحة في الركعتين الأوليين من كل صلاة  انظر : المغني (1/568) ."},
        {"text": "سنن الركوع وعددها (4) سنن \n\n (1) يُسَنُّ وضع اليدين على الركبتين، كالقابض عليهما ويُفرِّج الأصابع. \n\n لحديث أبي حميد - رضي الله عنه-  قال :  أَنَا كُنْتُ أَحْفَظَكُمْ لِصَلَاةِ رَسُولِ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - ، رَأَيْتُهُ إِذَا كَبَّرَ جَعَلَ يَدَيْهِ حِذَاءَ مَنْكِبَيْهِ ، وَإِذَا رَكَعَ أَمْكَنَ يَدَيْهِ مِنْ رُكْبَتَيْهِ ، ثُمَّ هَصَرَ ظَهْرَهُ...  رواه البخاري برقم (828) ، وفي حديث أبي مسعود – رضي الله عنه-  :  وَفَرَّجَ بَيْنَ أَصَابِعَهُ مِنْ وَرَاءِ رُكْبَتَيْهِ ...  رواه أحمد برقم (17081) ، و أبو داود برقم (863)، رواه النَّسَائي برقم (1038)، بسند حسن، وله شاهد من حديث وائل بن حجر عند ابن خزيمة (594) ."},
        {"text": "(2) يُسنُّ للراكع أن يمد ظهره مستوياً. \n\n لحديث أبي حميد السَّاعدي - رضي الله عنه - أنَّ رسول الله - صلَّى الله عليه وسلَّم- : وَإِذَا رَكَعَ أَمْكَنَ يَدَيْهِ مِنْ رُكْبَتَيْهِ ، ثُمَّ هَصَرَ ظَهْرَهُ...  رواه البخاري برقم (828) ، و هَصَرَ ظهرَهُ : أي ثناه في استواء من غير تقويس ، وكذلك يُسَنُّ أن يكون رأسه على مستوى رأسه ، فلا يرفعه ولا يخفضه ؛ لحديث عائشة - رضي الله عنها - عند مسلم ، وفيه قالت في وصف ركوع النَّبي - صلَّى الله عليه وسلَّم - : وَكَانَ إِذَا رَكَعَ لَمْ يُشْخِصْ رَأْسَهُ وَلَمْ يُصَوِّبْهُ ، وَلكِنْ بَيْنَ ذلِكَ  رواه مسلم برقم (498).و يُشْخِصْ  : بضم الياء وإسكان الشين : أي :لم يرفعه ، وَلَمْ يُصَوِّبْهُ بضم الياء ، وفتح الصاد: أي: لم يخفضه خفضاً بليغاً ."},
        {"text": "(3) يُسَنّ للمصلِّي عند الركوع أن يجافي مرفقيه عن جنبيه. \n\n أي: يباعد يديه عن جنبيه ؛ لحديث أبي مسعود  - رضي الله عنه - السابق، وفيه :  ثُمَّ رَكَعَ وَجَافَى يَدَيْهِ وَوَضَعَ يَدَيْهِ عَلَى رُكْبَتَيْهِ وَفَرَّجَ بَيْنَ أَصَابِعَهُ... وقال : هَكَذَا رَأَيْتُ رَسُوْلُ اللهِ - صلَّى الله عليه وسلَّم - يُصَلِّي رواه أحمد برقم (17081)، وأبو داود برقم (863)، والنسائي برقم (1038)، انظر : حاشية (2). و(المجافاة) هي : المباعدة ، لكن هذا مشروط فيما إذا لم يؤذِ من كان بجانبه ، فإنه لا ينبغي للمصلِّي أن يفعل سُنَّة يؤذي بها غيره من المصلِّين.قال النووي - رحمه الله -  عن المجافاة :  ولا أعلم في استحبابها خلافاً لأحد من العلماء ، وقد نقل الترمذي استحبابها في الركوع ، والسجود عن أهل العلم مطلقاً  انظر : المجموع (3/410)."},
        {"text": "(4) يُسَنُّ أن يأتي بالأذكار الواردة في الركوع. \n\n فيسنُّ للراكع أن يأتي مع ( سبحان ربي العظيم ) أذكاراً أخرى وردت في الركوع ، وممَّا ورد : أ.  سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي رواه البخاري برقم (794)، رواه مسلم برقم (484) ، من حديث عائشة -رضي الله عنها- . ب.  سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلاَئِكَةِ وَالرُّوحِ  رواه مسلم برقم (487)  ، من حديث عائشة - رضي الله عنها - .ج.  اللَّهُمَّ لَكَ رَكَعْتُ ، وَبِكَ آمَنْتُ ، وَلَكَ أَسْلَمْتُ ، خَشَعَ لَكَ سَمْعِي، وَبَصَرِي ، وَمُخِّي ، وَعَظْمِي ،  وَعَصَبِي رواه مسلم برقم (771) ، من حديث علي- رضي الله عنه - .د.  سبحانَ ذِي الجَبَرُوتِ وَالمَلَكوتِ وَالكِبْرِياءِ وَالعَظَمَةِ رواه أحمد برقم (23411)، و أبو داود برقم (873)، ورواه النَّسَائي برقم (1050) من حديث عن عوف بن مالك -رضي الله عنه -، وصححه الألباني (صحيح أبي داود 4/27)."},
        {"text": "الرفع من الركوع وعددها (3) سنن \n\n (1) تطويل هذا الركن . \n\n لحديث ثابت البناني عن أنس - رضي الله عنه - أنه قال :  إِنِّي لاَ آلُو (لا آلو : أي لا أُقصِّر) أَنْ أُصَلِّيَ بِكُمْ كَمَا رَأَيْتُ رَسُولَ اللّهِ - صلَّى الله عليه وسلَّم - يُصَلِّي بِنَا، قَالَ : فَكَانَ أَنَسٌ يَصْنَعُ شَيْئاً لاَ أَرَاكُمْ تَصْنَعُونَهُ، كَانَ إِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ انْتَصَبَ قَائِماً، حَتَّى يَقُولَ الْقَائِلُ: قَدْ نَسِيَ ، وَإِذَا رَفَعَ رَأْسَهُ مِنَ السَّجْدَةِ مَكَثَ حَتَّى يَقُولَ الْقَائِلُ: قَدْ نَسِيَ  رواه البخاري برقم (821) ، رواه مسلم برقم (472) ."},
        {"text": "(2)  التنويع في صيغ :  ربنا ولك الحمد . \n\n لتنويع في صيغ :  ربنا ولك الحمد  بين ما يلي :أ.  اللَّهُمَّ رَبَّنَا وَلَكَ الْحَمْدُ  رواه البخاري برقم (795) من حديث أبي هريرة  - رضي الله عنه -.ب.  اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ رواه البخاري برقم (796) ، رواه مسلم برقم (404) من حديث أبي هريرة  - رضي الله عنه -.ج.  رَبَّنَا وَلَكَ الْحَمْدُ  رواه البخاري برقم (799) ، رواه مسلم برقم (411) من حديث عائشة  - رضي الله عنها -.د. رَبَّنَا لَكَ الْحَمْدُ  رواه البخاري برقم (722)، من حديث أبي هريرة - رضي الله عنه .فمرَّة يأتي بهذه ، ومرَّة يأتي بهذه ."},
        {"text": "(3) يُسَنُّ أن يأتي بالأذكار الواردة بعد الرفع من الركوع. \n\n ومن الأذكار التي تُشرع بعد الرفع من الركوع ما يلي :أ.  رَبَّنَا لَكَ الْحَمْدُ ، مِلْءُ السَّمَاوَاتِ وَالأَرْضِ ، وَمِلْءُ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ ، أَهْلُ الثَّنَاءِ وَالْمَجْدِ ، أَحَقُّ مَا قَالَ الْعَبْدُ ، وَكُلُّنَا لَكَ عَبْدٌ ، اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ رواه مسلم برقم (477) من حديث أبي سعيد - رضي الله عنه - .ب.  الْحَمْدُ للّهِ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ  قال النَّبي - صلَّى الله عليه وسلَّم - عن هذا اللفظ :  لَقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكاً يَبْتَدِرُونَهَا، أَيُّهُمْ يَرْفَعُهَا رواه مسلم برقم (600) ، ورواه البخاري برقم (799).ج.  اللَّهُمَّ طَهِّرْنِي بِالثَّلْجِ وَالْبَرَدِ وَالْمَاءِ الْبَارِدِ ، اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ وَالْخَطَايَا كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الْوَسَخِ  رواه مسلم برقم (476) .وإذا أتى المسلم بهذه الأذكار استطاع أن يطيل هذه الركن ."},
        {"text": "سنن السجود وعددها (4) سنن \n\n (1) يُسَنُّ للساجد أن يجافي عضديه عن جنبه، وبطنه عن فخذيه . \n\n لحديث عبد الله بن بحينة - رضي الله عنه - : أَنَّ رَسُولَ اللّهِ - صلَّى الله عليه وسلَّم -كَانَ إِذَا صَلَّى فَرَّجَ بَيْنَ يَدَيْهِ ، حَتَّى يَبْدُوَ بَيَاضُ إِبْطَيْهِ  رواه البخاري برقم (390) ، رواه مسلم برقم (495)، وحديث ميمونة - رضي الله عنها - قالت : كَانَ النَّبِيُّ - صلَّى الله عليه وسلَّم - إِذَا سَجَدَ ، لَوْ شَاءَتْ بَهْمَةٌ (و البَهْمَة : واحدة البَهَم ، وهي أولاد الغنم من الذكور والإناث) أَنْ تَمُرَّ بَيْنَ يَدَيْهِ لَمَرَّتْ  رواه مسلم برقم (496) ، وفي هذا المبالغة في التفريج بين اليدين ، فالسُّنَّة التفريج بين اليدين ما لم يكن في ذلك أذية لمن حوله ،كما مضى في المجافاة في الركوع .ومن السُّنَّة أيضاً إذا سجد المصلِّي أن يفرج بين فخذيه فلا يجمعهما ، وأن لا يحمل بطنه على فخذيه ، بل يباعد فخذيه عن بطنه ؛ لحديث أبي حميد - رضي الله عنه - في صِفة صلاة النَّبيّ - صلَّى الله عليه وسلَّم- :  وَإِذَا سجد فَرَّجَ بَيْنَ فَخِذَيْهِ غَيْرَ حَامِلٍ بَطْنَهُ عَلَى شَيْء مِنْ فَخِذَيْهِ رواه أبو داود برقم (735)، وهو سنة بإجماع أهل العلم كما نقل الشوكاني وغيره . الشوكاني – رحمه الله -  : والحديث يدل على مشروعية التفريج بين الفخذين في السجود ، ورفع البطن عنهما ، ولا خلاف في ذلك  انظر : نيل الأوطار(2/257 ) ."},
        {"text": "(2) يُسَنّ للسَّاجد أن يستقبل بأطراف أصابع رجليه القِبْلَةَ. \n\nلحديث أبي حميد - رضي الله عنهما - أنه قال :  أنا أحفظكم لصلاة رسول الله - صلَّى الله عليه وسلَّم - ، وفيه :  فإذا سَجدَ وضعَ يدَيهِ غيرَ مُفتَرِشٍ ولا قابضِهما ، واستقبَلَ بأَطرافِ أصابعِ رجلَيهِ القِبلةَ  رواه البخاري برقم (828).وأمَّا أصابع اليدين أثناء السجود فالسُّنَّة أن تكون مضمومة ويجعل يديه مستقبلة القبلة ؛ لِمَا ثبت عن ابن عمر - رضي الله عنهما - في موطأ الإمام مالك (انظر : موطأ مالك)، وأيضاً في مصنَّف ابن أبي شيبة عن حفص بن عاصم - رضي الله عنه - قال :  من السُّنَّة في الصلاة أن يبسط كفيه ويضم أصابعه ، ونوجههما مع جهة القِبْلة  انظر : مصنف ابن أبي شيبة (1/236)، وله شاهد من حديث وائل ابن حجر: أن النبي -صلى الله عليه وسلم- كان إذا سجد ضم أصابعه وحسنه الهيثمي (مجمع الزوائد 2/135). "},
        {"text": "(3) يُسَنُّ أن يأتي بالأذكار الواردة في السجود. \n\n فيُسنُّ للساجد أن يأتي مع ( سبحان ربي الأعلى ) أذكاراً أخرى وردت في السجود ، وممَّا ورد :أ.  سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي رواه البخاري برقم (794) ، رواه مسلم برقم (484) من حديث عائشة - رضي الله عنه -.ب.  سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلاَئِكَةِ وَالرُّوحِ  رواه مسلم برقم (487)، من حديث عائشة - رضي الله عنه - .ج.  اللَّهُمَّ لَكَ سَجَدْتُ ، وَبِكَ آمَنْتُ ، وَلَكَ أَسْلَمْتُ ، سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ الله أَحْسَنُ الْخَالِقِينَ  رواه مسلم برقم (771) ، من حديث علي- رضي الله عنه - .د.  اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ دِقَّهُ وَجِلَّهُ ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلاَنِيَتَهُ وَسِرَّهُ  رواه مسلم برقم (483) ، من حديث أبي هريرة - رضي الله عنه -.ﻫ. اللَّهُمَّ أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ ، وَأَعُوذُ بِكَ مِنْكَ ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ  رواه مسلم برقم (486) من حديث عائشة - رضي الله عنها - ، فيُسَنُّ أن يأتي بما يستطيع من هذه الأذكار في سجوده وينوِّع بينها ، ومعلوم أنَّ الواجب في الركوع (سبحان ربي العظيم) مرَّة واحدة وما زاد فهو سُنَّة ، وكذا في السجود الواجب قول : (سبحان ربي الأعلى ) مرَّة واحدة ، وأمَّا الثانية ، و الثالثة فسُنَّة ."},
        {"text": "(4) يُسَنُّ الإكثار من الدعاء في السجود. \n\n لأنَّ السجود أقرب موضع للعبد من ربه جلَّ في علاه، فيُسَنُّ أن يُكْثِر من الدعاء فيه ، لقول النَّبيِّ - صلَّى الله عليه وسلَّم - كما في لحديث ابن عباس - رضي الله عنهما - عند مسلم :وَأَمَّا السُّجُودُ فَاجْتَهِدُوا فِي الدُّعَاءِ ، فَقَمِنٌ - ( قَمِنٌ أي: حريٌّ أن يُستجاب له)- ، أَنْ يُسْتَجَابَ لَكُمْ رواه مسلم برقم (479) ."},
        {"text": "سنن الجلسة بعد السجدتين وعددها (3) سنن \n\n (1) من السُّنَّة أن يفرش المصلِّي رجله اليسرى، ويجلس عليها، وينصب اليمنى. \n\n لحديث أبي حميد السَّاعدي - رضي الله عنه - مرفوعاً ، وفيه : فَإِذَا جَلَسَ فِي الرَّكْعَتَيْنِ جَلَسَ عَلَى رِجْلِهِ الْيُسْرَى وَنَصَبَ الْيُمْنَى رواه البخاري برقم (828)."},
        {"text": "(2) تطويل هذا الركن. \n\n لحديث ثابت البناني عن أنس - رضي الله عنه - أنه قال : إِنِّي لاَ آلُو (لا آلو : أي لا أُقصِّر) أَنْ أُصَلِّيَ بِكُمْ كَمَا رَأَيْتُ رَسُولَ اللّهِ - صلَّى الله عليه وسلَّم - يُصَلِّي بِنَا، قَالَ : فَكَانَ أَنَسٌ يَصْنَعُ شَيْئاً لاَ أَرَاكُمْ تَصْنَعُونَهُ، كَانَ إِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ انْتَصَبَ قَائِماً، حَتَّى يَقُولَ الْقَائِلُ: قَدْ نَسِيَ ، وَإِذَا رَفَعَ رَأْسَهُ مِنَ السَّجْدَةِ مَكَثَ حَتَّى يَقُولَ الْقَائِلُ: قَدْ نَسِيَ  رواه البخاري برقم (821) ، رواه مسلم برقم (472).  "},
        {"text": "(3) يُسنُّ لمن أراد القيام إلى أي ركعة، ثانية، أو رابعة، أن يجلس يسيراً قبل أن يقوم . \n\n وهذه تسمَّى : ( جلسة الاستراحة ) ، وليس لها ذكر معيَّن.وجاء ثبوتها في ثلاثة أحاديث منها :حديث مالك بن الحويرث - رضي الله عنه - : أَنَّهُ رَأَى النَّبِيَّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يُصَلِّي فَإِذَا كَانَ فِي وِتْرٍ مِنْ صَلَاتِهِ ، لَمْ يَنْهَضْ حَتَّى يَسْتَوِيَ قَاعِدًا  رواه البخاري برقم (823)، ومالك بن الحويرث - رضي الله عنه - هو الذي نقل قول النَّبيّ - صلَّى الله عليه وسلَّم -: صَلُّوا كَمَا رَأَيْتُمُوْنِيْ أُصَلِّيْ  رواه البخاري برقم (631) .واختُلِف في سنيَّة ( جلسة الاستراحة ) ، والصواب : أنها سُنَّة مطلقاً ؛ لحديث مالك - رضي الله عنه - ، وممن رجَّح سنيَّتها مطلقاً : النووي ، والشوكاني ، وابن باز ، والألباني - رحمهم الله - ، واللجنة الدائمة للبحوث العلمية والإفتاء – (انظر:فتاوى ومقالات متنوعة(11/99)، وفتاوى اللجنة الدائمة (6/445-446)-.وقال النووي - رحمه الله - :  وهذا هو الصواب الذي ثبتت فيه الأحاديث الصحيحة  انظر : المجموع (3/441)."},
        {"text": "سنن التشهد وعددها (8) سنن \n\n (1) يُسَنّ أن يفترش المصلِّي رجله اليسرى في التشهد، وينصب اليمنى. \n\n وهذه الصِّفة يفعلها المصلِّي بعدما يُصلِّي الثانية بركوعها ، وسجودها ، وقيامها ، وقعودها ، سواء كان في صلاة رباعية ، أو ثلاثية ، أو ثنائية ، فأي ركعة ثانية في الجلوس في تشهدها تكون على هذه الصِّفة ؛ لحديث أبي حميد السَّاعدي - رضي الله عنه -  مرفوعاً، وفيه :  فَإِذَا جَلَسَ فِي الرَّكْعَتَيْنِ جَلَسَ عَلَى رِجْلِهِ الْيُسْرَى وَنَصَبَ الْيُمْنَى رواه البخاري برقم (828)، وحديث عائشة - رضي الله عنها - :  وَكَانَ يَقُولُ فِي كُلِّ رَكْعَتَيْنِ التَّحِيَّةَ ، وَكَانَ يَفرشُ رِجْلَهُ الْيُسْرَى وَيَنْصِبُ رِجْلَهُ الْيُمْنَى رواه مسلم برقم (498) .وأمَّا التشهد الأخير في الصَّلاة الرباعية ، والثلاثية فسيأتي بيان صِفته ."},
        {"text": "(2) السُّنَّة أن ينوِّع في وضع اليدين حال التشهد. \n\n ووضع الكفين حال التشهد له صفتان :الصِّفَة الأولى : أن يضع اليدين على الفخذين .الصِّفَة الثانية : أن يضع اليدين على الركبتين ، وذلك بأن يُلْقِمَ يده اليسرى ركبته اليسرى ، وأمَّا اليمنى فيُشير بها - كما سيأتي بيانه - وأمَّا اليسرى فهي مبسوطة دائماً.لحديث ابن عمر - رضي الله عنهما - قال : كَانَ - أي: النَّبي - صلَّى الله عليه وسلَّم - - إِذَا جَلَسَ فِي الصَّلاَةِ، وَضَعَ كَفَّهُ الْيُمْنَى عَلَى فَخِذِهِ الْيُمْنَى، وَقَبَضَ أَصَابِعَهُ كُلَّهَا، وَأَشَارَ بِإِصْبَعِهِ الَّتِي تَلِي الإِبْهَامَ، وَوَضَعَ كَفَّهُ الْيُسْرَى عَلَى فَخِذِهِ الْيُسْرَى رواه مسلم برقم (580)، وفي رواية : وَيُلْقِمُ كَفَّهُ الْيُسْرَى رُكْبَتَهُ  رواه مسلم برقم (579) ."},
        {"text": "(3) السُّنَّة أن ينوِّع في كيفيَّة وضع الأصابع حال التشهد. \n\n ووضع الأصابع حال التشهد له صِفَتان :الصِّفَة الأولى : أن يقبض أصابع كفه اليمنى كلها ، ويُشِير بإصبعه السَّبابة ، واليسرى تكون مبسوطة .لحديث ابن عمر - رضي الله عنهما - السَّابق:  ...قَبَضَ أَصَابِعَهُ كُلَّهَا، وَأَشَارَ بِإِصْبَعِهِ الَّتِي تَلِي الإِبْهَامَ... رواه مسلم برقم (580) .الصِّفة الثانية : أن يعقد ثلاثاً وخمسين ، بأن يقبض الخنصر والبنصر ، ويُحلِّق الإبهام مع الوسطى ، ويُشير بالسبابة ، وأمَّا اليسرى فتكون مبسوطة .لحديث ابن عمر - رضي الله عنهما - السَّابق في رواية : كَانَ - أي : النَّبي صلَّى الله عليه وسلَّم - إِذَا قَعَدَ فِي التَّشَهِّدِ وَضَعَ يَدَهُ الْيُسْرَى عَلَى رُكْبَتِهِ الْيُسْرَى ، وَوَضَعَ يَدَهُ الْيُمْنَى عَلَى رُكْبَتِهِ الْيُمْنَى ، وَعَقَدَ ثَلاَثَةً وَخَمْسِينَ ، وَأَشَارَ بِالسَّبَّابَةِ ، رواه مسلم برقم (580)."},
        {"text": "(4) السُّنَّة أن ينوِّع المصلِّي بين صيغ التشهَّد. \n\n فيفعل هذه الصيغة تارة ، وهذه تارة ، وممّا ورد :أ.  التَّحِيَّاتُ لِلَّهِ ، وَالصَّلَوَاتُ ، وَالطَّيِّبَاتُ ، السَّلَامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ ، السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ  رواه البخاري برقم (1202) ، رواه مسلم برقم (402) من حديث ابن مسعود - رضي الله عنه -.ب.  التَّحِيَّاتُ الْمُبَارَكَاتُ ، الصَّلَوَاتُ الطَّيِّبَاتُ لِلَّهِ ، السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ... رواه مسلم برقم (403) من حديث ابن عباس - رضي الله عنهما -.. ثم يُكمل كما سبق .ج.  التَّحِيَّاتُ الطَّيِّبَاتُ الصَّلَوَاتُ لله ، السَّلاَمُ عَلَيْكَ أيُّهَا النَّبِيُّ... رواه مسلم برقم (404) من حديث أبي موسى- رضي الله عنه - ،  ثم يُكمل كما سبق ."},
        {"text": "(5) السُّنَّة أن يجلس المصلِّي في التشهد الأخير مُتَوَرِّكاً في الصلاة الثلاثية، والرباعية. \n\n والمقصود أن يقعد في التشهد الأخير إذا كانت الصلاة رباعية ، أو ثلاثية على مقعدته ، فيقعد على الورك الأيسر ، والتَّورك ورد على أكثر من وجه ، فيُستحب التنويع حينئذ .وممّـا ورد : 1/ أن يفرش رجله اليسرى ، ويخرجها من الجانب الأيمن ، وينصب اليمنى ،  ويجعل مقعدته على الأرض.وهذه الصِّفَة رواها البخاري - رحمه الله -  عن أبي حميد السَّاعدي - رضي الله عنه - رواه البخاري برقم (828) .                                                                              2/ أن يفرش القدمين جميعاً ، ويُخرجهما من الجانب الأيمن ، ويجعل مقعدته على الأرض .وهذه الصِّفة رواها أبو داود برقم (731) ، وابن حبان برقم (1867)، والبيهقي (2/128)  من حديث أبي حميد السَّاعدي - رضي الله عنه - وصحَّحها الألباني - رحم الله الجميع -.وليُعلَم أنَّ التَّورك على الصحيح ليس في كل تشهدٍ أخير ، وإنما في التشهد الأخير في الصلاة الثلاثية ، والرباعية دون الثنائية."},
        {"text": "(6) السُّنَّة أن ينوِّع المصلِّي بين صِيغ الصَّلاة على النَّبيِّ - صلَّى الله عليه وسلَّم- . \n\n فقد وردت عِدَّة صيغ في الصَّلاة على النَّبيِّ - صلَّى الله عليه وسلَّم - ،  فالسُّنَّة أن ينوِّع بينها ، وممّا ورد :أ. اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ ، وَعَلَى آلِ مُحَمَّدٍ ،كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ ، وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ ، وَعَلَى آلِ مُحَمَّدٍ ،كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ ،وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ  رواه البخاري برقم (3370) من حديث كعب بن عجرة - رضي الله عنه- .ب.  اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّد كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ ، وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ ، فِي الْعَالَمِينَ ، إِنَّكَ حَمِيدٌ مَجِيدٌ  رواه مسلم برقم (405) من حديث أبي مسعود الأنصاري - رضي الله عنه - .ج. اللَّهُمَّ صَلِّ عَلى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ ،كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ ، وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ ، إِنَّكَ حَمِيدٌ مَجِيدٌ . رواه البخاري برقم (3369)، رواه مسلم برقم (407) من حديث أبي حميد السَّاعدي- رضي الله عنه-. "},
        {"text": "(7) يُسَنُّ أن يستعيذ المصلِّي من أربع قبل أن يُسلِّم . \n\n وهو قول جمهور العلماء - رحمهم الله - ، لحديث أبي هريرة - رضي الله عنه - ، أنَّ النَّبيّ - صلَّى الله عليه وسلَّم - قال : إِذَا فَرَغَ أَحَدُكُمْ مِنَ التَّشَهِّدِ الآخِرِ، فَلْيَتَعَوَّذْ بِاللّهِ مِنْ أَرْبَعٍ: مِنْ عَذَابِ جَهَنَّمَ ، وَمِنْ عَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ الْمَسِيحِ الدَّجَّالِ رواه مسلم برقم (588) ، رواه البخاري برقم (832) ، رواه مسلم برقم (589) ، من حديث عائشة - رضي الله عنها - ."},
        {"text": "(8) أدعية أخرى يُسَنُّ للمصلِّي أن ينوِّع في الإتيان بها قبل السَّلام \n\n وهناك أدعية أخرى وردت في السُّنَّة ، يُسَنُّ للمصلِّي أن ينوِّع في الإتيان بها قبل السَّلام ، وممّـا ورد : \n\n 1/ اللَّهُمَّ إنِّي أَعُوذُ بِكَ من المأْثَمِ والمغْرَمِ \n\n رواه البخاري برقم 832 ، رواه مسلم برقم 589 \n\n 2/ اللَّهُمَّ إنِّي أَسْأَلُكَ الجَنَّةَ وَأَعَوْذُ بِكَ مِنَ النَّارِ \n\n رواه أبو داود برقم 792، وصحح إسناده الألباني صحيح أبي داود 3/377 \n\n 3/ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي ، إِنَّك أَنْتَ الْغَفُورُ الرَّحِيمُ \n\n رواه البخاري برقم 6326 ، رواه مسلم برقم 2705 \n\n 4/ اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ ، وَشُكْرِكَ ، وَحُسْنِ عِبَادَتِكَ \n\n رواه أحمد برقم 22119 ، رواه أبو داود برقم 1522، رواه النَّسائي برقم 1304، وصححه الألباني صحيح الجامع 2/1320 \n\n5/ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْبُخْلِ ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ ، وَأَعُوذُ بِكَ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ \n\n رواه البخاري برقم 6370 \n\n6/ اللَّهُمَّ حَاسِبْنِي حِسَابًا يَسِيرًا \n\n رواه أحمد برقم 24215 وصححه الألباني تحقيق مشكاة المصابيح 3/1544 \n\nثم يُسلِّم ملتفتاً في سلامه ، والتفاته في الصَّلاة سُنَّة ، والمبالغة في الالتفات سُنَّة أيضاً ؛ وذلك لأنَّ النَّبيّ - صلَّى الله عليه وسلَّم - كان يلتفت حتى يرى مَن وراءه بياضَ خدِّه - صلَّى الله عليه وسلَّم - فعَن سعد بن أبي وقاص - رضي الله عنه - قال: كُنْتُ أَرَى رَسُولَ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ- يُسَلِّمُ عَنْ يَمِينِهِ وَعَنْ يَسَارِهِ ، حَتَّى أَرَى بَيَاضَ خَدِّهِ \n\n رواه مسلم برقم 582 \n\n "},
        {"text": "أذكار بعد الصلاة وعددها (15) أذكار \n\n ستجدها في الصفحة الرئيسية للتطبيق ◀️"},

    ],

    "taam": [
        {"text": "التسمية أول الطعام \n\n عن عمرَ بن أبي سلمةَ - رضي الله عنه - يقولَ:  كُنْتُ غُلَامًا فِي حَجْرِ رَسُولِ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - وَكَانَتْ يَدِي تَطِيشُ فِي الصَّحْفَةِ ، فَقَالَ لِي رَسُولُ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - : يَا غُلَامُ سَمِّ اللَّهَ ،وَكُلْ بِيَمِينِكَ ،وَكُلْ مِمَّا يَلِيكَ فَمَا زَالَتْ تِلْكَ طِعْمَتِي بَعْدُ  رواه البخاري برقم (5376) ، رواه مسلم برقم (2022). وإذا نسي التسمية: فإنه يسن أن يقول إذا تذكرها: بسم الله أوله وآخره .لحديث عائشة - رضي الله عنها - ، أنَّ رسول الله - صلَّى الله عليه وسلَّم - قال:  إذَا أكَلَ أحَدُكُم فَلْيَذْكُرِ اسْمَ الله ، فإنْ نَسِيَ أنْ يَذْكُرَ اسْمَ الله في أوَّلِهِ ، فَلْيَقُلْ : بِسْمِ الله أوَّلَهُ وَآخِرَهُ  رواه أبو داود برقم (3767) ، رواه الترمذي برقم (1858)، وصححه الألباني. وكذلك دلّ الحديث على أن الإنسان يأكل بيمينه حتى لا يشابه الشيطان ، فالمسلم إذا لم يُسمِّ شاركه الشيطان في طعامه ، وإذا أكل أو شرب بشماله شابه الشيطان بذلك ؛ لأن الشيطان يأكل ، ويشرب بشماله . ويدلّ عليه : حديث عبد اللّه بن عُمَرَ- رضي الله عنه - أَن رسول اللّه - صلَّى الله عليه وسلَّم - قَالَ : لاَ يَأْكُلَنَّ أَحَدٌ مِنْكُمْ بِشِمَالِهِ ، وَلاَ يَشْرَبَنَّ بِهَا، فإِنَّ الشَّيْطَانَ يَأْكُلُ بِشِمالِهِ وَيَشْرَبُ بِهَا . قَالَ : وَكَانَ نَافِعٌ يَزِيدُ فِيهَا : وَلاَ يَأْخُذُ بِهَا وَلاَ يَعْطِي بِهَا  رواه مسلم برقم (2020) .والشيطان حريص في أن يدخل البيوت ؛ ليبيت فيها ، و يشارك أهلها الطعام والشراب ، عن جابر بن عبد اللّه – رضي الله عنهما- أنَّه سمع النَّبِيَّ - صلَّى الله عليه وسلَّم - يقول:  إِذَا دَخَلَ الرَّجُلُ بَيْتَهُ ، فَذَكَرَ اللّهَ عِنْدَ دُخُولِهِ وَعِنْدَ طَعَامِهِ ، قَالَ الشَّيْطَانُ: لاَ مَبِيتَ لَكُمْ وَلاَ عَشَاءَ ، وَإِذَا دَخَلَ فَلَمْ يَذْكُرِ اللّهَ عِنْدَ دُخُولِهِ، قَالَ الشَّيْطَانُ: أَدْرَكْتُمُ الْمَبِيتَ. وَإِذَا لَمْ يَذْكُرِ اللّهَ عِنْدَ طَعَامِهِ، قَالَ: أَدْرَكْتُمُ الْمَبِيتَ وَالْعَشَاءَ رواه مسلم برقم (2018) ."},
        {"text": "الأكل مما يلي \n\n لحديث عمر بن أبي سلمة –رضي الله عنه- يقول:  كُنْتُ غُلَامًا فِي حَجْرِ رَسُولِ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - وَكَانَتْ يَدِي تَطِيشُ فِي الصَّحْفَةِ ، فَقَالَ لِي رَسُولُ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - : يَا غُلَامُ سَمِّ اللَّهَ ،وَكُلْ بِيَمِينِكَ ،وَكُلْ مِمَّا يَلِيكَ فَمَا زَالَتْ تِلْكَ طِعْمَتِي بَعْدُ  رواه البخاري برقم (5376) ، رواه مسلم برقم (2022)."},
        {"text": "أخذ اللقمة الساقطة، وإماطة ما بها من أذى، وأكلها \n\n لحديث جَابِرٍ - رضي الله عنه -  قال : سمعت النَّبيَّ - صلَّى الله عليه وسلَّم – يقول :  إِنَّ الشَّيْطَانَ يَحْضُرُ أَحَدَكُمْ عِنْدَ كُلِّ شَيْءٍ مِنْ شَأْنِهِ ، حَتَّى يَحْضُرَهُ عِنْدَ طَعَامِهِ ، فَإِذَا سَقَطَتْ مِنْ أَحَدِكُمُ اللُّقْمَةُ فَلْيُمِطْ مَا كَانَ بِهَا مِنْ أَذَىً ، ثُمَّ لْيَأْكُلْهَا، وَلاَ يَدَعْهَا لِلشَّيْطَانِ، فَإِذَا فَرَغَ فَلْيَلْعَقْ أَصَابِعَهُ ، فَإِنَّهُ لاَ يَدْرِي فِي أَيِّ طَعَامِهِ تَكُونُ الْبَرَكَةُ رواه مسلم برقم (2033).والمتأمل للحديث يجد الشيطان حريصاً على مشاركة الإنسان في كل أموره ؛ لينزع البركة من حياته ، ويفسد عليه كثيرٌ من شأنه ، ومما يدلّ على حرصه على ملازمة العبد في كل أموره قوله - صلَّى الله عليه وسلَّم - :  إِنَّ الشَّيْطَانَ يَحْضُرُ أَحَدَكُمْ عِنْدَ كُلِّ شَيْءٍ مِنْ شَأْنِهِ ."},
        {"text": "لعق الأصابع \n\n ولعقها ، أي : لحسها بطرف لسانه ، فالسُّنَّة أن يلعقها ، أو يُلعِقْها غيره كزوجته مثلاً ، بل السُّنَّة ألَّا يمسح ما يعلق بيده بمنديل ، ونحوه حتى يلعقها.ويدلّ عليه : حديث جابر - رضي الله عنه - السابق .وفي الصحيحين من حديث ابن عبّاس - رضي الله عنهما - أنَّ النَّبيَّ - صلَّى الله عليه وسلَّم - قال:  إِذَا أَكَلَ أَحَدُكُمْ فَلَا يَمْسَحْ يَدَهُ حَتَّى يَلْعَقَهَا، أَوْ يُلْعِقَهَا  رواه البخاري برقم (5456) ، ورواه مسلم برقم (2033)."},
        {"text": "سَلْتُ القَصْعَة \n\n والمقصود مِن سَلْتُ القَصْعَة : تنظيف الآكل حافته من الطعام ، فمثلاً : من يأكل أرزاً ، فإن السُّنَّة ألّا يُبْقِي شيئاً في حافته التي يأكل منها ، فيمسح ما بقي في حافته ، ويأكله ، فقد تكون البركة في هذا المتبقي في حافته.ويدلّ عليه: حديث أنس - رضي الله عنه - قال :  وَأَمَرَنَا - أيّ النَّبيّ - صلَّى الله عليه وسلَّم - أَنْ نَسْلُتَ الْقَصْعَةَ رواه مسلم برقم (2034)، وفي رواية لمسلم من حديث أبي هريرة - رضي الله عنه - :  وَلْيَسْلُتْ أَحَدُكُمُ الصَّحْفَةَ  رواه مسلم برقم (2035) .قال شيخنا ابن عثيمين - رحمه الله -  :  بمعنى : أن تتبع ما علق فيه من طعام بأصابعك ، وتلعقها ، فهذا أيضاً من السُّنَّة التي غفل عنها كثير من الناس مع الأسف حتى من طلبة العلم أيضاً انظر: شرح رياض الصالحين (1/892 ) ."},
        {"text": "الأكل بثلاث أصابع \n\n والسُّنَّة أن يأكل بثلاث أصابع ، وهذا فيما يُحمل بثلاث أصابع كالتمر مثلاً، فيُسن أن يأكله بثلاث أصابع . ويدلّ عليه : حديث كَعْبِ بْنِ مالك - رضي الله عنه – قال :  كَانَ رَسُولُ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يَأْكُلُ بِثَلاَثِ أَصَابِعَ ، وَيَلْعَقُ يَدَهُ قَبْلَ أَنْ يَمْسَحَهَا  رواه مسلم برقم (2032)."},
        {"text": "التنفس خارج الإناء ثلاثاً \n\n مِن السُّنَّة أن يشرب الإناء على ثلاث دفعات ، ويتنفس بعد كل واحدة . ويدلّ عليه : حديث أَنَسٍ - رضي الله عنه - قال: كَانَ رَسُولُ اللّهِ - صلَّى الله عليه وسلَّم - يَتَنَفَّسُ فِي الشَّرَابِ ثَلاَثاً ، وَيَقُولُ : إِنَّهُ أَرْوَى ، وَأَبْرَأُ ، وَأَمْرَأُ، قَالَ أَنَسٌ - رضي الله عنه - :فَأَنَا أَتَنَفَّسُ فِي الشَّرَابِ ثَلاَثاً رواه البخاري برقم (5631) ، رواه مسلم برقم (2028).والمقصود من التنفس في الإناء : التنفس أثناء شربه للإناء ، بمعنى : أنه يتنفس خارج الإناء ؛ لأنَّ التنفس في الإناء مكروه ؛ لحديث أبي قَتادة - رضي الله عنه - في الصحيحين ، قال: قال رسول الله - صلَّى الله عليه وسلَّم - : إِذَا شَرِبَ أَحَدُكُمْ فَلَا يَتَنَفَّسْ فِي الْإِنَاءِ  رواه البخاري برقم (5630) ، رواه مسلم برقم (267)."},
        {"text": "حمد الله - تعالى- بعد الطعام \n\n ويدل على هذه السنة : \n\n حديث أنس بن مالك - رضي الله عنه -  قال: قال رسول اللّه - صلَّى الله عليه وسلَّم - :  إِنَّ اللّه لَيَرْضَى عَنِ الْعَبْدِ أَنْ يَأْكُلَ الأَكْلَةَ فَيَحْمَدَهُ عَلَيْهَا، أَوْ يَشْرَبَ الشَّرْبَةَ فَيَحْمَدَهُ عَلَيْهَا رواه مسلم برقم (2743) .وللحمد صِيَغ متنوعة ، منها :أ.  الْحَمْدُ لِلَّهِ كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ غَيْرَ مَكْفِيٍّ ، وَلَا مُوَدَّعٍ ، وَلَا مُسْتَغْنًى عَنْهُ رَبَّنَا  رواه البخاري برقم (5458). ب.  الْحَمْدُ لِلَّهِ الَّذِي كَفَانَا وَأَرْوَانَا غَيْرَ مَكْفِيٍّ ، وَلَا مَكْفُورٍ  رواه البخاري برقم (5459). (غيرَ مَكفِيٍّ) : أي: غير محتاج إلى أحد ، فهو الذي يطعم عباده ويكفيهم، ( ولا مُودَّع ) : بفتح الدال ، وتشديدها ، أي : غير متروك ، ( كَفَانَا ) : من الكفاية ، و (أرْوَانَا) من الرِيّ ، (وَلَا مَكْفُورٍ) : أي: مجحود فضله ونعمته ."},
        {"text": "الاجتماع على الطعام \n\n فمن السُّنَّة الاجتماع على الطعام ، وعدم التفرُّق فيه . \n\n ويدلّ عليه: حديث جابر بن عبد اللّه - رضي الله عنهما – يقول : سِمِعْتُ رَسُولَ اللّهِ - صلَّى الله عليه وسلَّم - يَقُولُ:  طَعَامُ الْوَاحِدِ يَكْفِي الإِثْنَيْنِ ، وَطَعَامُ الإِثْنَيْنِ يَكْفِي الأَرْبَعَةَ ، وَطَعَامُ الأَرْبَعَةِ يَكْفِي الثَّمَانِيَةَ رواه مسلم برقم (2059)."},
        {"text": "مدح الطعام إذا أعجبه \n\n مِن السُّنَّة : مدح الطعام إذا أعجبه ، ولا شكّ أنه لا يمدحه إلا بما فيه . ويدل عليه : حديث جابر بن عبد اللّه - رضي الله عنه - أَنَّ النَّبِيَّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - سَأَلَ أَهْلَهُ الأُدُمَ ، فَقَالُوا: مَا عِنْدَنَا إِلاَّ خَلٌّ ، فَدَعَا بِهِ ، فَجَعَلَ يَأْكُلُ بِهِ وَيَقُولُ: نِعْمَ الأُدُمُ الْخَلُّ. نِعْمَ الأُدُمُ الْخَلُّ  رواه مسلم برقم (2052)، والخَلُّ من أنواع الإدام عندهم وهو حلو ليس حامض ، كالخل الذي عندنا اليوم. قال شيخنا ابن عثيمين - رحمه الله - : وهذا أيضاً من هدي النَّبيّ - صلَّى الله عليه وسلَّم - أنه إذا أعجبه الطعام أثنى عليه ، وكذلك مثلاً لو أثنيت على الخبز ، قلت : نعم الخبز خبز بني فلان ، أو ما أشبه ذلك ، فهذا أيضاً سُنَّة الرسول - صلَّى الله عليه وسلَّم -  انظر : شرح رياض الصالحين (2/1057).والمتأمل لواقعنا يجد كثيراً ما يقع الناس في خلاف سُنَّة النَّبيّ - صلَّى الله عليه وسلَّم - فهم لم يكتفوا بترك السُّنَّة بل خالفوها أيضاً ، وذلك بعيبهم للطعام، وذمهم له في بعض الأحيان ، وهذا خلاف هديه - صلَّى الله عليه وسلَّم - ، ففي الصحيحين من حديث أبي هريرةَ - رضي الله عنه - قال: مَا عَابَ النَّبِيُّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - طَعَامًا قَطُّ إِنْ اشْتَهَاهُ أَكَلَهُ وَإِلَّا تَرَكَهُ، رواه البخاري برقم (3563) ، رواه مسلم برقم (2064) ."},
        {"text": "الدعاء لصاحب الطعام \n\nويدلّ عليه : حديث عبد اللّه بن بُسْرٍ - رضي الله عنه – قال : نَزَلَ رَسُولُ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - عَلَى أَبِي، قَالَ: فَقَرَّبْنَا إِلَيْهِ طَعَاماً وَوَطْبَةً ، فَأَكَلَ مِنْهَا ، ثُمَّ أُتِيَ بِتَمْرٍ فَكَانَ يَأْكُلُهُ ، وَيُلْقِي النَّوَى بَيْنَ إِصْبَعَيْهِ ، وَيَجْمَعُ السَّبَّابَةَ وَالْوُسْطَى ، ثُمَّ أُتِيَ بِشَرَابٍ فَشَرِبَهُ ، ثُمَّ نَاوَلَهُ الَّذِي عَنْ يَمِينِهِ ، قَالَ فَقَالَ أَبِي، وَأَخَذَ بِلِجَامِ دَابَّتِهِ: ادْعُ اللّهَ لَنَا ، فَقَالَ:  اللَّهُمَّ بَارِكْ لَهُمْ فِي مَا رَزَقْتَهُمْ ، وَاغْفِرْ لَهُمْ ، وَارْحَمْهُمْ رواه مسلم برقم (2042) ، و(الوَطْبَة) : هي الحيس الذي يجمع التمر البرني ، والأقط المدقوق ، والسمن . "},
        {"text": "استحباب أن يسقي الشارب مَن على يمينه قبل يساره \n\nوالمقصود : أنه إذا شرب فمن السُّنَّة أن يعطي مَن على يمينه قبل شماله . \n\n ويدل عليه : حديث أَنَسِ بن مالك - رضي الله عنه - قال: أَتَانَا رَسُولُ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - فِي دَارِنَا ، فَاسْتَسْقَى ، فَحَلَبْنَا لَهُ شَاةً ، ثُمَّ شُبْتُهُ مِنْ مَاءِ بِئْرِي هَـذِهِ ، قَالَ: فَأَعْطَيْتُ رَسُولَ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ -، فَشَرِبَ رَسُولُ اللّهِ ، وَأَبُو بَكْرٍ عَنْ يَسَارِهِ، وَعُمَرُ وِجَاهَهُ ، وَأَعْرَابِيٌّ عَنْ يَمِينِهِ. فَلَمَّا فَرَغَ رَسُولُ اللّهِ مِنْ شُرْبِهِ، قَالَ عُمَرُ: هَـذَا أَبُو بَكْرٍ، يَا رَسُولَ اللّهِ يُرِيهِ إيَّاهُ، فَأَعْطَى رَسُولُ اللّهِ الأَعْرَابِيَّ ، وَتَرَكَ أَبَا بَكْرٍ وَعُمَرَ ، وَقَالَ رَسُولُ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ -: الأَيْمَنُونَ ، الأَيْمَنُونَ، الأَيْمَنُونَ ، قَالَ أَنَسٌ - رضي الله عنه - :  فَهْيَ سُنَّةٌ، فَهْيَ سُنَّةٌ ، فَهْيَ سُنَّة  رواه البخاري برقم (2571) ، رواه مسلم برقم (2029) . "},
        {"text": "ساقي القوم آخرهم شرباً \n\nيُسنُّ لمن يسقي جماعة أن يكون آخرهم شرباً . \n\n  ويدلّ عليه : حديث أبي قتادة - رضي الله عنه - الطويل ، وفيه: قال:... فَجَعَلَ رَسُولُ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يَصُبُّ وَأَسْقِيهِمْ، حَتَّى مَا بَقِيَ غَيْرِي ، وَغَيْرُ رَسُولِ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - ، قَالَ ثُمَّ صَبَّ رَسُولُ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - فَقَالَ لِي: اشْرَبْ فَقُلْتُ: لاَ أَشْرَبُ حَتَّى تَشْرَبَ يَا رَسُولَ اللّهِ ، قَالَ:  إِنَّ سَاقِيَ الْقَوْمِ آخِرُهُمْ شُرْباً ، قَالَ: فَشَرِبْتُ وَشَرِبَ رَسُولُ اللّهِ ....  رواه مسلم برقم (681) .فائدة : ومن السُّنَّة لمن شرب لبناً أن يتمضمض بالماء بعد شربه للبن ؛ ليزيل ما في فمه من الدسم الذي يكون من اللبن . ويدلّ عليه : حديث ابْنِ عَبَّاسٍ- رضي الله عنهما -: أَنَّ النَّبِيَّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - شَرِبَ لَبَناً ، فَدَعَا بِمَاءٍ ، فَتَمَضْمَضَ ، وَقَالَ: إِنَّ لَهُ دَسَماً رواه البخاري برقم (211) ، رواه مسلم برقم (358) ."},
        {"text": "تغطية الإناء، وذكر اسم الله - تعالى- عند قدوم الليل \n\n يُسَنُّ تغطية الإناء المكشوف عند قدوم الليل ، وإيكاء السقاء - أي: إغلاقه- إن كان له غلقاً ، وذكر اسم الله عند ذلك . \n\n ويدلّ عليه : حديث جابر بْنِ عبد اللّه - رضي الله عنهما - قَالَ: سَمِعْتُ رَسُولَ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يَقُولُ:  غَطُّوا الإِنَاءَ ، وَأَوْكُوا السِّقَاءَ ، فَإنَّ فِي السَّنَةِ لَيْلَةً يَنْزِلُ فِيهَا وَبَاءٌ ، لاَ يَمُرُّ بِإِنَاءٍ لَيْسَ عَلَيْهِ غِطَاءٌ ، أَوْ سِقَاءٍ لَيْسَ عَلَيْهِ وِكَاءٌ ، إِلاَّ نَزَلَ فِيهِ مِنْ ذلِكَ الْوَبَاءِ رواه مسلم برقم (2014)، وعند البخاري من حديث جابرٍ - رضي الله عنهما - أيضاً:  وَأَوْكُوا قِرَبَكُمْ ، وَاذْكُرُوا اسْمَ اللَّهِ ، وَخَمِّرُوا آنِيَتَكُمْ ، وَاذْكُرُوا اسْمَ اللَّهِ ، وَلَوْ أَنْ تَعْرُضُوا عَلَيْهَا شَيْئًا  رواه البخاري برقم (5623) ."},

    ],

    "salam": [
        {"text": "من السُّنَّة : إلقاء السلام . \n\n  والأدلة على السُّنيَّة كثيرة مستفيضة ، ومنها: حديث أبي هريرة - رضي الله عنه -  أَنَّ رَسُولَ اللّهِ - صلَّى الله عليه وسلَّم - قَالَ:  حَقُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ سِتٌّ ، قِيلَ: مَا هُنَّ يَا رَسُولَ اللّهِ ؟ قَالَ:  إِذَا لَقِيتَهُ فَسَلِّمْ عَلَيْهِ ، وَإِذَا دَعَاكَ فَأَجِبْهُ ، وَإِذَا اسْتَنْصَحَكَ فَانْصَحْ لَهُ ، وَإِذَا عَطَسَ فَحَمِدَ اللّهَ فَشمِّتْهُ، وَإِذَا مَرِضَ فَعُدْهُ، وَإِذَا مَاتَ فَاتَّبِعْهُ  رواه مسلم برقم (2162). - وأمَّا ردُّه فهو : واجب ، ويدل عليه :  قوله تعالى:{وَإِذَا حُيِّيْتُم بِتَحِيَّةٍ فَحَيُّواْ بِأَحْسَنَ مِنْهَا أَوْ رُدُّوهَا إِنَّ اللّهَ كَانَ عَلَى كُلِّ شَيْءٍ حَسِيباً} [النساء : 86].  والأصل في الأمر الوجوب ما لم يصرفه صارف، ونقل الإجماع على وجوب الرد غير واحد من أهل العلم ، منهم : ابن حزم ، وابن عبد البر ، والشيخ تقي الدين وغيرهم - رحم الله الجميع - ، انظر : الآداب الشرعية (1/356) ط . مؤسسة الرسالة. - وأفضل لفظ بالسَّلام ، والردّ ، وأكمله ، هو: ( السلام عليكم ورحمة الله وبركاته ) فإن هذه أحسن تحية وأكملها . قال ابن القيم - رحمه الله - :  وكان هديه - أي : النَّبي صلَّى الله عليه وسلَّم - انتهاء السَّلام ، إلى : ( وبركاته )  انظر : زاد المعاد (2/417 ). وإفشاء السلام ؛ سُنَّة بل سُنَّة مرغَّب بها بفضل عظيم ؛ لحديث أبي هريرة - رضي الله عنه – قال : قال رسول اللّه - صلَّى الله عليه وسلَّم - :  وَالَّذِي نَفْسِي بِيَدِهِ لاَ تَدْخُلُونَ الْجَنَّةَ حَتَّى تُؤْمِنُوا، وَلاَ تُؤْمِنُوا حَتَّى تَحَابُّوا، أَوَلاَ أَدُلُّكُمْ عَلَى شَيْءٍ إِذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ ؟ أَفْشُوا السَّلاَمَ بَينَكُمْ رواه مسلم برقم (54)."},
        {"text": "استحباب تكرار السلام ثلاثًا، إن دعت الحاجة لذلك. \n\n كأن يشك في سماع المُسَلَّم عليه حينما سلَّمَ عليه أول مرَّة ؛ فيستحب أن يُكرِّر مرتين ، وإن لم يسمع ، فثلاثاً ، وكذا إذا دخل على جمع كثير ، كأن يدخل على مجلس كبير، فيه جمع كثير ، فلو سلَّم مرَّة في أول دخوله لم يسمعه إلا من كان أول المجلس ، فيحتاج إلى أن يُسلِّم ثلاثاً ؛ من أجل أن يستوعب جميع مَن في المجلس . ويدلّ عليه : حديث أنس - رضي الله عنه - عنِ النبيِّ - صلَّى الله عليه وسلَّم - : أَنَّهُ كَانَ إِذَا تَكَلَّمَ بِكَلِمَةٍ أَعَادَهَا ثَلَاثًا ؛ حَتَّى تُفْهَمَ عَنْهُ ، وَإِذَا أَتَى عَلَى قَوْمٍ فَسَلَّمَ عَلَيْهِمْ ، سَلَّمَ عَلَيْهِمْ ثَلَاثًا  رواه البخاري برقم (95) . ويؤخذ من حديث أنس - رضي الله عنه - السَّابق ، سنيَّة إعادة الكلمة ثلاثاً إذا دعت الحاجة للتكرار ، كأن يتكلم ولا تفهم عنه الكلمة ، فيُسنُّ أن يكرِّرها ، فإن لم تُفهم كرَّرها الثالثة ."},
        {"text": "من السُّنَّة تعميم السلام على من عرفت، ومن لم تعرف. \n\n لحديث عبد الله بن عَمْرٍو - رضي الله عنهما -  أَنَّ رَجُلاً سَأَلَ رَسُولَ اللّهِ - صلَّى الله عليه وسلَّم - : أَيُّ الإِسْلاَمِ خَيْرٌ؟ قَالَ:  تُطْعِمُ الطَّعَامَ ، وَتَقْرَأُ السَّلاَمَ عَلَى مَنْ عَرَفْتَ ، وَمَنْ لَمْ تَعْرِفْ رواه البخاري برقم (12) ، رواه مسلم برقم (39) ."},
        {"text": "السُّنَّة أن يكون ابتداء السلام ممن جاءت السُّنَّة بابتدائه. \n\nعن أبي هريرة - رضي الله عنه – يقول : قَالَ رَسُولُ اللهِ - صلَّى الله عليه وسلَّم - :  يُسَلِّمُ الرَّاكِبُ عَلَى المَاشِي، والمَاشِي عَلَى القَاعِدِ، وَالقَلِيلُ عَلَى الكَثِيرِ رواه البخاري برقم (6233) ، رواه مسلم برقم (2160)، وفي رواية للبخاري : يُسَلِّمُ الصَّغِيرُ عَلَى الْكَبِيرِ ، وَالْمَارُّ عَلَى الْقَاعِدِ ، وَالْقَلِيلُ عَلَى الْكَثِيرِ  رواه البخاري برقم (6234) .ولا يعني مخالفة الأولى بالسَّلام الكراهة ، بل لا بأس به ، ولكنه خلاف الأولى ، كأن يسلم الكبير على الصغير ، أو الماشي على الرَّاكب ، ونحو ذلك . "},
        {"text": "من السُّنَّة السلام على الصِّبيان. \n\n لحديث أنس بن مالك - رضي الله عنه -: أَنَّهُ كَانَ يَمْشِي مَعَ رَسُولِ اللّهِ - صلَّى الله عليه وسلَّم - فَمَرَّ بِصِبْيَانٍ فَسَلَّمَ عَلَيْهِمْ رواه البخاري برقم (6247) ، رواه مسلم برقم (2168).وفي السَّلام على الصبيان: حملٌ للنَّفس على التواضع ، وتعويد للصبيان على هذه الشعيرة ، وإحياؤها في نفوسهم"},
        {"text": "من السُّنَّة السَّلام عند دخول البيت. \n\n وهذا يدخل في عموم السَّلام ، وذلك بعدما يستاك ؛ لأنَّ السِّواك سُنَّة عند دخول المنزل ، وهذا هو الموضع الرابع من مواضع تأكُّد سنيَّة السواك ، وهو: عند دخول المنزل \n\n لحديث عائشة - رضي الله عنها - عند مسلم قالت : أَنَّ النَّبِيَّ - صلَّى الله عليه وسلَّم - كَانَ إِذَا دَخَلَ بَيْتَهُ بَدَأَ بِالسِّوَاكِ \n\n رواه مسلم برقم 253 \n\nفإذا بدأ بيته بالسِّواك دخل وسلَّم على أهل البيت ، حتى أن بعض أهل العلم قال : من السُّنَّة أن تسلِّم إذا دخلت البيت ، وأي بيت ولو لم يكن فيه أحد ؛ لقوله تعالى: فَإِذَا دَخَلْتُم بُيُوتاً فَسَلِّمُوا عَلَى أَنفُسِكُمْ تَحِيَّةً مِّنْ عِندِ اللَّهِ مُبَارَكَةً طَيِّبَةً كَذَلِكَ يُبَيِّنُ اللَّهُ لَكُمُ الْآيَاتِ لَعَلَّكُمْ تَعْقِلُون \n\n النور:61 \n\nقال ابن حجر - رحمه الله - : ويدخل في عموم إفشاء السَّلام على النفس لمن دخل مكاناً ليس فيه أحد ؛ لقوله تعالى: فَإِذَا دَخَلْتُم بُيُوتاً فَسَلِّمُوا عَلَى أَنفُسِكُمْ... \n\n انظر : فتح الباري ، حديث 6235 ، باب إِفشاءِ السلام \n\nفائدة : تحصَّل مما سبق أنه يُسَنُّ عند دخول المنزل ثلاث سُنَن : \n\nالأولى : ذكر اسم الله - تعالى - لاسيما ليلاً \n\nلحديث جابر بْنِ عبد اللّه - رضي الله عنهما - أَنَّه سمـع النَّبيَّ - صلَّى الله عليه وسلَّم - يقول: إِذَا دَخَلَ الرَّجُلُ بَيْتَهُ، فَذَكَرَ اللّهَ عِنْدَ دُخُولِهِ وَعِنْدَ طَعَامِهِ، قَالَ الشَّيْطَانُ: لاَ مَبِيتَ لَكُمْ وَلاَ عَشَاءَ. وَإِذَا دَخَلَ فَلَمْ يَذْكُرِ اللّهَ عِنْدَ دُخُولِهِ ، قَالَ الشَّيْطَانُ: أَدْرَكْتُمُ الْمَبِيتَ ، وَإِذَا لَمْ يَذْكُرِ اللّهَ عِنْدَ طَعَامِهِ، قَالَ: أَدْرَكْتُمُ الْمَبِيتَ ، وَالْعَشَاءَ \n\n رواه مسلم برقم 2018 \n\nالثانية : السِّواك \n\nلحديث عائشة - رضي الله عنها - عند مسلم: أَنَّ النَّبِيَّ - صلَّى الله عليه وسلَّم - كَانَ إِذَا دَخَلَ بَيْتَهُ بَدَأَ بِالسِّوَاكِ \n\n رواه مسلم برقم 253 \n\nالثالثة : السَّلام على أهل البيت \n\n"},
        {"text": "من السُّنَّة خفض الصوت بالسَّلام، إذا دخل على قوم، وفيهم نائمون. \n\n وهكذا كان يفعل النَّبي - صلَّى الله عليه وسلَّم - ،كما في حديث المقداد بن الأسود- رضي الله عنه - ففيه قال : ... فَكُنَّا نَحْتَلِبُ فَيَشْرَبُ كُلُّ إنْسَانٍ مِنَّا نَصِيبَهُ ، وَنَرْفَعُ لِلنَّبِيِّ - صلَّى الله عليه وسلَّم- نَصِيبَهُ ، قَالَ: فَيَجِيءُ مِنَ اللَّيْلِ فَيُسَلِّمُ تَسْلِيماً لاَ يُوقِظُ نَائِماً، وَيُسْمِـعُ الْيَقْظَانَ  رواه مسلم برقم (2055) ."},
        {"text": "من السُّنَّة تبليغ السَّلام . \n\n فتبليغ السَّلام سُنَّة كأن يقول لك شخص : سلِّم لي على فلان ، فإنَّ من السُّنَّة أن توصِّل هذا السَّلام لصاحبه .ويدلّ عليه : لحديث عائشة - رضي الله عنها - أَنَّ النَّبيَّ - صلَّى الله عليه وسلَّم - قال لها:  إِنَّ جِبْرِيلَ يَقْرَأُ عَلَيْكِ السَّلاَمَ  قَالَتْ: فَقُلْتُ: وَعَلَيْهِ السَّلاَمُ وَرَحْمَةُ اللّهِ رواه البخاري برقم (3217) ، رواه مسلم برقم (2447).ففي الحديث إيصال السَّلام لصاحبه؛ كما أوصل النَّبيُّ - صلَّى الله عليه وسلَّم - سلام جبريل - عليه السلام - على عائشة - رضي الله عنها - ، ويؤخذ من الحديث السَّابق أيضاً سنيَّة بعث السَّلام مع أحد."},
        {"text": "السَّلام عند دخول المجلس، وعند مفارقته أيضاً. \n\nلحديث أبي هريرة - رضي الله عنه - قال : قال رَسولُ الله - صلَّى الله عليه وسلَّم -: إِذَا انْتَهَى أَحَدُكُمْ إِلَى المَجْلِسِ فَلْيُسَلِّمْ، فإِذَا أَرَادَ أَنْ يَقُومَ فَلْيُسَلِّمْ ، فلَيْسَتِ الأولَى بِأَحَقَّ مِنَ الآخِرَةِ  رواه أحمد برقم (9664)، وأبو داود برقم (5208) ، والترمذي برقم (2706)،وصححه الألباني (صحيح الجامع 1/132). "},
        {"text": "تُسَنُّ المصافحة مع السَّلام عند اللُّقيا. \n\nوعلى هذا عمل الصحابة - رضي الله عنهم - ، دلَّ على ذلك : حديث قَتادةَ - رضي الله عنه -  قال:  قُلْتُ لِأَنَسٍ : أَكَانَتْ الْمُصَافَحَةُ فِي أَصْحَابِ النَّبِيِّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - ؟ قَالَ : نَعَمْ  رواه البخاري برقم (6263). "},
        {"text": "يُسَنُّ التبسّم وطلاقة الوجه عند اللقاء. \n\n لحديث أَبِي ذَرّ - رضي الله عنه -  قال : قال لي النَّبيُّ - صلَّى الله عليه وسلَّم - :  لاَ تَحْقِرَنَّ مِنَ الْمَعْرُوفِ شَيْئاً، وَلَوْ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلْقٍ رواه مسلم برقم (2626)، وعند الترمذي من حديث أبي ذَرّ - رضي الله عنه - قال رسول الله - صلَّى الله عليه وسلَّم - :  تَبَسُّمُكَ في وَجْهِ أَخِيكَ لَكَ صَدَقَةٌ  رواه الترمذي برقم (1956) ، وصححه الألباني (الصحيحة 572) ."},
        {"text": "تُسَنُّ الكلمة الطيبة فهي صدقة. \n\n وسواء كانت عند اللقاء، أو المجالسة، أو في أي حال، فالكلمة الطيبة سُنَّة؛ لأنها صدقة \n\n  ويدلّ عليه: حديث أبي هريرة - رضي الله عنه - قال: قال رسول الله - صلَّى الله عليه وسلَّم -: وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ \n\n رواه البخاري برقم 2989، رواه مسلم برقم 1009 \n\n  وكثيراً ما يجري على ألسنة الناس كلامٌ طيبٌ، لو احتسبوه لأُجروا على ذلك كثيراً، وأخذوا من هذه الصدقات بحظ وافر \n\n  قال شيخنا ابن عثيمين - رحمه الله -: كلمة طيبة مثل أن تقول له: كيف أنت؟ كيف حالك؟ كيف إخوانك؟ كيف أهلك؟ وما أشبه ذلك؛ لأن هذه من الكلمات الطيبة التي تدخل السرور على صاحبك، كل كلمة طيبة فهي صدقة لك عند الله، وأجر، وثواب \n\n انظر: شرح رياض الصالحين لشيخنا 2/996 باب: استحباب طيب الكلام، وطلاقة الوجه عند اللقاء \n\n"},
        {"text": "استحباب ذكر الله - تعالى- في المجلس. \n\n والأحاديث في فضائل مجالس الذكر، والحث عليها كثيرة ، ومن ذلك حديث أبي هريرة - رضي الله عنه - قال: قال رسولُ الله - صلَّى الله عليه وسلَّم - : إِنَّ لِلَّهِ مَلَائِكَةً يَطُوفُونَ فِي الطُّرُقِ يَلْتَمِسُونَ أَهْلَ الذِّكْرِ ، فَإِذَا وَجَدُوا قَوْمًا يَذْكُرُونَ اللَّهَ تَنَادَوْا : هَلُمُّوا إِلَى حَاجَتِكُمْ ، قَالَ فَيَحُفُّونَهُمْ بِأَجْنِحَتِهِمْ إِلَى السَّمَاءِ الدُّنْيَا...رواه البخاري برقم (6408) ، رواه مسلم برقم (2689)."},
        {"text": "يُسَنُّ ختم المجلس بـ : ( كفارة المجلس ). \n\n لحديث أَبي هريرة - رضي الله عنه -  قال: قال رسول الله - صلَّى الله عليه وسلَّم - :  مَنْ جَلَس في مَجْلِسٍ فَكثُرَ فيهِ لَغَطُهُ  فَقَالَ قَبْلَ أَنْ يَقُومَ مِنْ مَجْلِسِهِ ذَلِكَ : سُبْحَانَكَ اللّهُمَّ وَبِحَمْدِكَ أَشْهَدُ أن لاَ إلَهَ إلاّ أنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ إِلاّ غُفِرَ لَهُ مَا كَانَ في مَجْلِسِهِ ذَلِكَ  رواه الترمذي برقم (3433)، وصححه الألباني (صحيح الجامع 2/1065)."},

    ],

    "zeina": [
        {"text": "من السُّنَّة التَّيامن في التَّنعُّل. \n\n من السُّنَّة إذا أراد المسلم أن يلبس نعليه أن يبدأ باليمنى، ومن السُّنَّة إذا أراد أن ينزع نعليه أن يبدأ باليسرى \n\n  ويدلّ عليه: حديث أبي هريرة - رضي الله عنه - أن رسول الله - صلَّى الله عليه وسلَّم - قال: إِذَا انْتَعَلَ أَحَدُكُمْ فَلْيَبْدَأْ بِالْيَمِينِ وَإِذَا نَزَعَ فَلْيَبْدَأْ بِالشِّمَالِ لِيَكُنْ الْيُمْنَى أَوَّلَهُمَا تُنْعَلُ وَآخِرَهُمَا تُنْزَعُ \n\n رواه البخاري برقم 5856 \n\n  وفي لفظ آخر لمسلم: لاَ يَمْشِ أَحَدُكُمْ فِي نَعْلٍ وَاحِدَةٍ، لِيُنْعِلْهُمَا جَمِيعاً، أَوْ لِيَخْلَعْهُمَا جَمِيعاً \n\n رواه مسلم برقم 2097 \n\n  ففي هذين الحديثين، ثلاث سُنَن: \n\n  1. أن يبدأ باليمنى عند لبس النعال \n\n  2. أن يبدأ باليسرى عند نزع النعال \n\n  3. أن يلبس النعلين جميعاً، أو يخلعهما جميعاً، بحيث لا يمشي بنعل واحدة \n\n"},
        {"text": "مِن السُّنَّة لبس البياض من الثياب. \n\n والمقصود أن يلبس من الألوان في ثيابه (الأبيض) فإنه من السُّنَّة ؛ لحديث ابن عبَّاس - رضي الله عنهما -  قال : قال رسول الله - صلَّى الله عليه وسلَّم - :  الْبَسُوا مِنْ ثِيَابِكُم الْبَيَاضَ فإنَّهَا مِنْ خَيْرِ ثِيَابِكم، وَكَفِّنُوا فِيهَا مَوْتَاكُم رواه أحمد برقم (2219) ، وأبو داود برقم (3878) ، والترمذي برقم (994) وصححه الألباني (صحيح الجامع 1/267) .قال شيخنا ابن عثيمين - رحمه الله -: وهو شامل للبس الثياب البيض : القمص ، والأُزر ، والسراويل ، كلها مما ينبغي أن تكون من البياض ، فإنه أفضل ، ولكن لو أنه لبس من لون آخر فلا بأس ، بشرط ألَّا يكون مما يختص لبسه بالنساء انظر : شرح رياض الصالحين ، لشيخنا (2/1087 )."},
        {"text": "من السُّنَّة استعمال الطِّيب. \n\n لحديث أَنَسٍ - رضي الله عنه - قال: قال رسول اللَّه - صلَّى الله عليه وسلَّم -: حُبِّبَ إلَيَّ مِنَ الدُّنْيَا النِّسَاءُ وَالطِّيبُ وَجُعِلَ قُرَّةُ عَيْنِي فِي الصَّلاَةِ \n\n رواه أحمد برقم 12293، والنَّسَائي برقم 3940، وقال الألباني في صحيح النَّسَائي: حسن صحيح \n\n  وأمَّا لفظ: حُبِّبَ إلَيَّ مِنْ دُنْيَاكُمْ ثَلَاثٌ فضعيف \n\n  - وكان يَكرَه - صلَّى الله عليه وسلَّم - أن توجد منه ريح كريهة: فقد جاء عند البخاري في حديث طويل عن عائشة - رضي الله عنها - قالت: وَكَانَ رَسُولُ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يَشْتَدُّ عَلَيْهِ أَنْ يُوجَدَ مِنْهُ الرِّيحُ \n\n رواه البخاري برقم 6972، أي: الريح غير الطيبة \n\n  يُكْرَه ردُّ الطيب \n\n  لحديث أَنسٍ - رضي الله عنه -: أَنَّ النَّبِيَّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - كَانَ لَا يَرُدُّ الطِّيبَ \n\n رواه البخاري برقم 2582 \n\n"},
        {"text": "من السُّنَّة التيمُّن عند ترجيل الشَّعَر. \n\n والمقصود بترجيل الشعر هو : مشطه ، فإنَّ مِن السُّنَّة أن يبدأ بالجهة اليمنى ، ثم اليسرى. \n\n ويدلّ عليه :حديث عائشة - رضي الله عنها - قالت: كَانَ النَّبيُّ - صلَّى الله عليه وسلَّم - يُعجِبهُ التَّيَمُّنُ في تَنَعُّلهِ وتَرَجُّلهِ وطُهورِه وفي شأنهِ كلِّه رواه البخاري برقم (168) ، رواه مسلم برقم (268) ."},


    ],

    "alaetas": [
        {"text": " يُسَنُّ للعاطس أن يقول :  الحمد لله  .  \n\n لحديث أبي هريرة - رضي الله عنها -  عن النَّبيِّ - صلَّى الله عليه وسلَّم - قال:  إِذَا عَطَسَ أَحَدُكُمْ فَلْيَقُلْ : الْحَمْدُ لِلَّهِ ، وَلْيَقُلْ لَهُ أَخُوهُ أَوْ صَاحِبُهُ : يَرْحَمُكَ اللَّهُ ، فَإِذَا قَالَ لَهُ يَرْحَمُكَ اللَّهُ ، فَلْيَقُلْ يَهْدِيكُمُ اللَّهُ ، وَيُصْلِحُ بَالَكُمْ رواه البخاري برقم (6224) .ويسنُّ له أن ينوِّع فيقول أحياناً : الحمد لله على كل حال  ، فقد جاء في رواية أبي داود : إِذَا عَطَسَ أَحَدُكُم فَلْيَقُلْ : الْحَمدُ لله عَلَى كلِّ حَال  رواه أبو داود برقم (5031) ، وقال ابن القيّم - رحمه الله  في زاد المعاد (2/436 ) عن هذا الحديث: إسناده صحيح .ويقول له المشمِّت : يرحمك الله  ، ويُسَنُّ للعاطس أن يردَّ عليه ، فيقول : يَهْدِيكُمُ اللَّهُ ، وَيُصْلِحُ بَالَكُمْ  وكل هذا دلَّ عليه حديث أبي هريرة - رضي الله عنه - السَّابق ."},
        {"text": "السُّنَّة إذا لم يحمد الله - تعالى- العاطس أنه لا يُشمَّت . \n\n فإذا لم يحمد اللهَ - تعالى - العاطس فليس من السُّنَّة أن نشمِّته، بل السُّنَّة ألا يُشمَّت \n\n  لحديث أنس - رضي الله عنه - قال: عَطَسَ رَجُلَانِ عِنْدَ النَّبِيِّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - فَشَمَّتَ أَحَدَهُمَا، وَلَمْ يُشَمِّتْ الْآخَرَ، فَقَالَ الرَّجُلُ: يَا رَسُولَ اللَّهِ شَمَّتَّ هَذَا وَلَمْ تُشَمِّتْنِي، قَالَ: إِنَّ هَذَا حَمِدَ اللَّهَ وَلَمْ تَحْمَدْ اللَّهَ \n\n رواه البخاري برقم 6225 \n\n  وهذا من فعله - صلَّى الله عليه وسلَّم - وجاء من قوله - صلَّى الله عليه وسلَّم - ما رواه مسلم، عن أبي موسى - رضي الله عنه - قال: سَمِعْتُ رَسُولَ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يقول: إِذَا عَطَسَ أَحَدُكُمْ فَحَمِدَ اللّهَ، فَشَمِّتُوهُ، فَإِنَّ لَمْ يَحْمَدِ اللّهَ، فَلاَ تُشَمِّتُوهُ \n\n رواه مسلم برقم 2992 \n\n  ولكن إذا كان المقام مقام تعليم كأن يربي الأبُ ابنَه، أو المعلمُ طلابَه، أو نحو ذلك ممّا هو في مقام التعليم، فإنه يقول له: قل الحمد لله؛ ليربيه على هذه السُّنَّة فقد يكون جاهلاً في سنّيتها \n\n  وكذا من كان مزكوماً فإنه لا يُشمَّت بعد الثالثة، فإذا عطس ثلاث مرات يُشمَّت، وبعدها لا يُشمَّت \n\n  ويدلّ عليه: ما رواه أبو داود في سننه عن أبي هريرة - رضي الله عنه - موقوفاً ومرفوعاً، قالَ: شَمِّتْ أَخاكَ ثَلاَثاً فَمَا زَادَ فَهُوَ زُكَامٌ \n\n رواه أبو داود برقم 5034، وقال الألباني - رحمه الله -: حسن موقوف، ومرفوع (صحيح أبي داود 4/308) \n\n  ويؤيده ما رواه مسلم في صحيحه، من حديث سَلَمَةَ بْنِ الأَكْوَعِ - رضي الله عنه - أَنَّهُ سَمِعَ النَّبِيَّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - وَعَطَسَ رَجُلٌ عِنْدَهُ فَقَالَ لَهُ: يَرْحَمُكَ اللّهُ، ثُمَّ عَطَسَ أُخْرَى فَقَالَ لَهُ رَسُولُ اللّهِ - صلَّى الله عليه وسلَّم -: الرَّجُلُ مَزْكُومٌ \n\n رواه مسلم برقم 2993 \n\n  فتحصَّل مما سبق أنَّ العاطس لا يُشمَّت في حالين: \n\n  1. إذا لم يحمد الله - تعالى - \n\n  2. إذا زاد على ثلاث مرات؛ لأنَّه مزكوم \n\n"},

    ],

    "tsawob": [
        {"text": "من السُّنَّة كظم الفم عند التثاؤب، أو ردُّه باليد. \n\nويدلّ عليه :حديث أبي هريرة - رضي الله عنه - عن النَّبيِّ - صلَّى الله عليه وسلَّم - قال:  إِنَّ اللَّهَ يُحِبُّ الْعُطَاسَ ، وَيَكْرَهُ التَّثَاؤُبَ ، فَإِذَا عَطَسَ فَحَمِدَ اللَّهَ ، فَحَقٌّ عَلَى كُلِّ مُسْلِمٍ سَمِعَهُ أَنْ يُشَمِّتَهُ ، وَأَمَّا التَّثَاؤُبُ فَإِنَّمَا هُوَ مِنْ الشَّيْطَانِ فَلْيَرُدَّهُ مَا اسْتَطَاعَ ، فَإِذَا قَالَ هَا ضَحِكَ مِنْهُ الشَّيْطَانُ  رواه البخاري برقم (2663) .وعند مسلم من حديث أبي سعيد - رضي الله عنه – ، قال النَّبيُّ - صلَّى الله عليه وسلَّم - :  إِذَا تَثَاوَبَ أَحَدُكُمْ، فَلْيُمْسِكْ بِيَدِهِ عَلَى فِيهِ ، فَإِنَّ الشَّيْطَانَ يَدْخُلُ رواه مسلم برقم (2995)، فيكون كظم التثاؤب إمَّا بالتحكم عن طريق الفم ، وذلك بمنع انفتاحه ، أو بضغط الأسنان على الشفة ، وإمَّا بوضع اليد على الفم ، ونحو ذلك. "},
        {"text": "الأفضل للمتثائب ألَّا يرفع صوته بالتثاؤب \n\n الأفضل للمتثائب ألَّا يرفع صوته بالتثاؤب، كأن يقول: (ها)، أو (آه)، ونحوها من الأصوات التي يصدرها؛ لأنَّ هذا مدعاة لضحك الشيطان عليه \n\n  ويدل عليه: \n\n  حديث أبي هريرة - رضي الله عنه - عن النبيِّ - صلَّى الله عليه وسلَّم - قال: التَّثَاؤُبُ مِنْ الشَّيْطَانِ، فَإِذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَرُدَّهُ مَا اسْتَطَاعَ؛ فَإِنَّ أَحَدَكُمْ إِذَا قَالَهَا ضَحِكَ الشَّيْطَانُ \n\n  رواه البخاري برقم 3298، رواه مسلم برقم 2994 \n\n  وجاء بلفظ عند أحمد - رحمه الله -: إذَا تَثَاءَبَ أَحَدُكُمْ فَلْيَرُدَّه مَا اسْتَطَاع، وَلا يَقُل: آه آه، فَإِنَّ أَحَدَكُم إِذَا فَتَحَ فَاهُ، فَإِنَّ الشَيْطَانَ يَضْحَكُ مِنْهُ أَو بِه \n\n  رواه أحمد برقم 9530، وصححه الألباني (الصحيحة 2420) \n\n  فينبغي للمسلم عند التثاؤب أن: \n\n  1. يكتم التثاؤب ما استطاع \n\n  2. يضع يده على فمه \n\n  3. يتجنب إصدار الأصوات المزعجة \n\n  4. يحاول مقاومة التثاؤب بقدر الإمكان \n\n  لأن في ذلك: \n\n  - اتباعاً لهدي النبي صلى الله عليه وسلم \n\n  - وقاية من استهزاء الشيطان \n\n  - أدباً في التعامل مع الآخرين \n\n  - حفظاً للوقار والهيئة الحسنة \n\n"},
        {"text": "تنبيه \n\n تنبيه : اعتاد بعض الناس على التَّعوذ من الشيطان بعد التثاؤب ، ولا دليل على ذلك بل هو مخالفة لهدي النَّبي - صلَّى الله عليه وسلَّم - ؛ لأنه جاء بذكر لم يقله النَّبيُّ - صلَّى الله عليه وسلَّم - في هذا الموطن ."},

    ],

    "yawmieya": [
        {"text": "قول الذكر الوارد عند دخول الخلاء، والخروج منه. \n\n فيُسَنُّ لمن دخل الخلاء ، أن يقول ما جاء في الصحيحين :قال عن أَنَس - رضي الله عنه - : كَانَ رَسُولُ اللّهِ - صلَّى الله عليه وسلَّم - إِذَا دَخَلَ الْخَلاَءَ، قَالَ:  اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبثِ وَالْخَبَائِثِ رواه البخاري برقم (6322) ، رواه مسلم برقم (375) .( الخبُث ) بضم الباء :ذكران الشياطين ، والخبائث إناثهم ، فتكون الاستعاذة من ذكران الشياطين وإناثهم .و( الخبْث ) بتسكين الباء : الشر ، والخبائث النفوس الشريرة ، فتكون الاستعاذة من الشَّر وأهله، والتسكين أعمّ. وهو أكثر روايات الشيوخ ،كما قال القاضي عياض ، والخطابي وغيرهما - رحم الله الجميع - .- ويُسَنُّ لمن خرج من الخلاء أن يقول :ما جاء في مسند أحمد ، وسنن أبي داود ، والترمذي ، وصححه الألباني: عن عائشة - رضي الله عنها -  قالت:  كَانَ النَّبِيُّ - صلَّى الله عليه وسلَّم - إِذَا خَرَجَ مِنَ الْخَلاَءِ قَالَ: غُفْرَانَكَ رواه أحمد برقم (25220) ، وأبوداود برقم (30) ، والترمذي برقم (7) وصححه الألباني (تحقيق مشكاة المصابيح 1/116) .فائدة : قيل : مناسبة قول :  غفرانك  أنَّ الإنسان لمَّا تخفَّف من أذيَّة الجسم ، تذكَّر أذيَّة الإثم ، فدعا الله- تعالى-  أن يخفف عنه أذيَّة الإثم ، كما منَّ عليه بتخفيف أذية الجسم . ذكره ابن القيم - رحمه الله - انظر : إغاثة اللهفان (1/58 ) .وقيل : إنَّ مناسبة ذلك هو: استغفاره ؛ لانقطاعه عن الذِّكر حال الخلاء ، وقيل غير ذلك."},
        {"text": "تسنُّ كتابة الوصيَّة . \n\n فالوصيَّة سُنَّة لكل مسلم حال المرض ، أو الصِّحة ؛ لقول رسول اللّه - صلَّى الله عليه وسلَّم - :  مَا حَقُّ امْرِىءٍ مُسْلِمٍ ، لَهُ شَيْءٌ يُرِيدُ أَنْ يُوصِيَ فِيهِ ، يَبِيتُ لَيْلَتَيْنِ ، إلاَّ وَوَصِيَّتهُ مَكْتُوبَةٌ عِنْدَهُ رواه البخاري برقم (2783) ، رواه مسلم برقم (1626) من حديث ابن عمر - رضي الله عنهما- ، وذكر الليلتين في الحديث ليس تحديداً ، وإنما المراد به ألَّا يمر عليه زمن قصير إلا ووصيته مكتوبة عنده؛ لأنه لا يدري متى يموت ، وهذه سُنَّة عامَّة لكل الناس .أمَّا الوصية فيما عليه من حقوق الله - تعالى - كزكاة ، أو حج ، أو كفَّارة ، أو حقوق الآدميين كالدَّيْن ، وأداء الأمانات ، فهذه واجبة لا سُنَّة ؛ لأنه يتعلَّق بها أداء حقوق واجبة ، لاسيما إذا لم يعلم بهذه الحقوق أحد ، [ ومالا يتم الواجب إلا به فهو واجب ] ."},
        {"text": "السماحة واللين في البيع والشراء. \n\n وذلك بأن يتحلَّى كل من البائع ، والمشتري ، بالسماحة ، واللين أثناء البيع ، ولا يتشدَّد كل منهما مع الآخر في المساومة في السِّعر والجدل فيه،  بل يتسامحان.ويدلّ عليه :حديث جابرِ بنِ عبدِ الله - رضي الله عنهما -  أنَّ رسول الله - صلَّى الله عليه وسلَّم - قال:  رَحِمَ اللَّهُ رَجُلًا سَمْحًا ؛ إِذَا بَاعَ ، وَإِذَا اشْتَرَى ، وَإِذَا اقْتَضَى  رواه البخاري برقم (2076) .وكذلك إذا طالب بقضاء حَقِّه ، فإنَّ من السُّنَّة أن يُطالب بسهولة ، ولين ؛ لقول النَّبي- صلَّى الله عليه وسلَّم -:  وإذا اقتضى  ."},
        {"text": "صلاة ركعتين بعد كل وضوء. \n\n وهذه من السُّنَن اليوميَّة التي يترتب عليها فضل عظيم ، وهو : دخول الجنة ، فعَن أبي هريرة - رضي الله عنه - : أَنَّ النَّبِيَّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - قَالَ لِبِلَالٍ عِنْدَ صَلَاةِ الْفَجْرِ: يَا بِلَالُ حَدِّثْنِي بِأَرْجَى عَمَلٍ عَمِلْتَهُ فِي الْإِسْلَامِ ؛ فَإِنِّي سَمِعْتُ دَفَّ نَعْلَيْكَ بَيْنَ يَدَيَّ فِي الْجَنَّةِ ، قَالَ: مَا عَمِلْتُ عَمَلًا أَرْجَى عِنْدِي أَنِّي لَمْ أَتَطَهَّرْ طَهُورًا فِي سَاعَةِ لَيْلٍ ، أَوْ نَهَارٍ ، إِلَّا صَلَّيْتُ بِذَلِكَ الطُّهُورِ مَا كُتِبَ لِي أَنْ أُصَلِّيَ رواه البخاري برقم (1149) ، رواه مسلم برقم (2458)، و(دَفَّ نَعْلَيْكَ) يعني : تحريك نعليك ."},
        {"text": "انتظار الصَّلاة . \n\n وانتظار الصلاة من السُّنَن التي يترتَّب عليها فضل عظيم \n\nويدل عليه: \n\nحديث أبي هريرة - رضي الله عنه - أَنَّ رسول اللّه - صلَّى الله عليه وسلَّم - قال: لاَ يَزَالُ أَحَدكُمْ فِي صَلاَةٍ مَا دَامَتِ الصَّلاَةُ تَحْبِسُهُ، لاَ يَمْنَعُهُ أَنْ يَنْقَلِبَ إِلَى أَهْلِهِ إِلاَّ الصَّلاَةُ \n\nرواه البخاري برقم 659، رواه مسلم برقم 649 \n\nوعن أبي هريرة - رضي الله عنه - أَن رسول الله - صلَّى الله عليه وسلَّم - قال: الْمَلَائِكَةُ تُصَلِّي عَلَى أَحَدِكُمْ مَا دَامَ فِي مُصَلَّاهُ، مَا لَمْ يُحْدِثْ، اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ارْحَمْهُ، لَا يَزَالُ أَحَدُكُمْ فِي صَلَاةٍ مَا دَامَتْ الصَّلَاةُ تَحْبِسُهُ، لَا يَمْنَعُهُ أَنْ يَنْقَلِبَ إِلَى أَهْلِهِ إِلَّا الصَّلَاةُ \n\nرواه البخاري برقم 659، رواه مسلم برقم 649 \n\nوقوله: ما لم يُحدِثْ أي ما لم يأتِ بشيء ينقض الوضوء، وجاء عند مسلم: \n\nمَا لَمْ يُؤْذِ فِيهِ، مَا لَمْ يُحْدِثْ فِيهِ \n\nرواه مسلم برقم 649 \n\nففي هذا الحديث فوائد عظيمة: \n\n1. أن المُنتظر للصلاة في المسجد في صلاة ما دام ينتظرها \n\n2. أن الملائكة تستغفر له وتدعو له بالرحمة والمغفرة \n\n3. اشتراط بقاء الأجر بعدم الحدث والأذى \n\n4. فضل المكث في المسجد وانتظار الصلوات \n\nوينبغي للمسلم أن: \n\n- يحافظ على وضوئه \n\n- يجتنب إيذاء الآخرين \n\n- يشتغل بالذكر وقراءة القرآن \n\n- يستحضر نية الاعتكاف إن أطال الجلوس \n\n"},
        {"text": "السِّواك . \n\n والسِّواك من السُّنَن المطلقة التي تُفعل في كل وقت ، وكان النَّبيّ - صلَّى الله عليه وسلَّم - يحث عليه كثيراً حتى قال :  أَكْثَرْتُ عَلَيْكُمْ فِي السِّوَاكِ  رواه البخاري برقم (888) من حديث أنس - رضي الله عنه -  ، وقال النَّبيُّ - صلَّى الله عليه وسلَّم - فيه : السِّوَاكُ مَطْهَرَةٌ لِلْفَمِ مَرْضَاةٌ لِلرَّبِّ رواه أحمد برقم (7) ، رواه النَّسَائي برقم (5) من حديث عائشة - رضي الله عنها – وصححه الألباني (الإرواء 1/105) .وتتأكد سنيَّة السواك في مواضع تقدَّم ذكر بعضها لاسيما التي تتكرر في اليوم والليلة ، كالقيام من الليل ، وعند الوضوء ، وعند كل صلاة ، وعند دخول المنزل - والله أعلم - ."},
        {"text": "تجديد الوضوء لكل صلاة \n\n يُسَنُّ للمسلم أن يُجَدد الوضوء لكل صلاة ، فلو أنه توضأ لصلاة المغرب مثلاً ثم صلَّى المغرب ، فإذا جاءت صلاة العشاء يُسنُّ له أن يتوضأ ، ولو كان على طهارة ، فالسُّنَّة أن يتوضأ لكل صلاة وضوءً جديداً .ويدلّ عليه :حديث عند البخاري قال:  كَانَ النَّبِيُّ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - يَتَوَضَّأُ عِنْدَ كُلِّ صَلَاةٍ  رواه البخاري (214) .وأيضاً من السُّنَّة أن يكون الإنسان على طهارة خلال يومه ؛ لحديث ثوبان - رضي الله عنه - أنَّ النَّبيُّ - صلَّى الله عليه وسلَّم- قال :  وَلاَ يُحَافِظُ عَلَى الْوُضُوءِ إِلاَّ مُؤْمِنٌ  رواه أحمد برقم (22434) ، رواه ابن ماجه برقم (277) ، رواه الدارمي برقم (655)، وصححه الألباني (صحيح الجامع 1/225) ."},

    ],

    "duaa": [
        {"text": "أن يدعو وهو على طهارة . \n\n لحديث أبي موسى - رضي الله عنه - في الصحيحين ، وقصته مع عَمِّه أبي عامر - رضي الله عنه - ، حين بعثه النَّبيُّ - صلَّى الله عليه وسلَّم - على جيش أوطاس ، وفي الحديث : قُتل أبو عامر - رضي الله عنه - ، وأوصى أبا موسى - رضي الله عنه - أن يُقرئ النَّبيَّ - صلَّى الله عليه وسلَّم - السلام ، ويدعو له ، قال أبو موسى :  فَأَخْبَرْتُهُ بِخَبَرنا وَخَبَر أَبِي عَامِرٍ، وَقُلْتُ لَهُ: قَالَ: قُلْ لَهُ: يَسْتَغْفِرْ لِي ، فَدَعَا رَسُولُ اللّهِ بِمَاءٍ ، فَتَوَضَّأ مِنْهُ ، ثُمَّ رَفَعَ يَدَيْهِ ، ثُمَّ قَالَ:  الّلهُمَّ اغْفِرْ لِعُبَيْدٍ، أَبِي عَامِرٍ ، حَتَّى رَأَيْتُ بَيَاضَ إِبْطَيْهِ ، ثُمَّ قَالَ:  اللّهُمَّ اجْعَلْهُ يَوْمَ الْقِيَامَةِ فَوْقَ كَثِيرٍ مِنْ خَلْقِكَ ، أَوْ مِنَ النَّاسِ رواه البخاري برقم (4323) ، رواه مسلم برقم (2498) ."},
        {"text": "استقبال القِبلة. \n\n وعن عبد اللّه بن عَبَّاس - رضي الله عنهما - قال:  حَدَّثنِي عُمَرُ بْنُ الْخَطَّابِ - رضي الله عنه - قَالَ: لَمَّا كَانَ يَوْمُ بَدْرٍ، نَظَرَ رَسُولُ اللّهِ - صلَّى الله عليه وسلَّم - إلَى الْمُشْرِكِينَ وَهُمْ أَلْفٌ ، وَأَصْحَابُهُ ثَلاَثُمِائَةٍ وَتِسْعَةَ عَشَرَ رَجُلاً ، فَاسْتَقْبَلَ نَبِيُّ اللّهِ الْقِبْلَةَ ، ثُمَّ مَدَّ يَدَيْهِ فَجَعَلَ يَهْتِفُ بِرَبِّهِ: اللَّهُمَّ أَنْجِزْ لِي مَا وَعَدْتَنِي، اللَّهُمَّ آتِ مَا وَعَدْتَنِي، اللَّهُمَّ إنْ تَهْلِكْ هَـذِهِ الْعِصَابَةُ مِنْ أَهْلِ الإِسْلاَمِ لاَ تُعْبَدْ فِي الأَرْضِ فَمَا زَالَ يَهْتِفُ بِرَبِّهِ، مَادّاً يَدَيْهِ ، مُسْتَقْبِلَ الْقِبْلَةِ ، حَتَّى سَقَطَ رِدَاؤُهُ عَنْ مَنْكِبَيْهِ ، فَأَتَاهُ أَبُو بَكْرٍ، فَأَخَذَ رِدَاءَهُ فَأَلْقَاهُ عَلَى مَنْكِبَيْهِ. ثُمَّ الْتَزَمَهُ مِنْ وَرَائِهِ. وَقَالَ: يَا نَبِيَّ اللّهِ كَفَاكَ مُنَاشَدَتَكَ رَبَّكَ ، فَإنَّهُ سَيُنْجِزُ لَكَ مَا وَعَدَكَ... رواه مسلم برقم (1763)."},
        {"text": "رفع اليدين. \n\n ويدلّ عليه حديث ابن عباس - رضي الله عنهما - قال:  حَدَّثنِي عُمَرُ بْنُ الْخَطَّابِ - رضي الله عنه - قَالَ: لَمَّا كَانَ يَوْمُ بَدْرٍ، نَظَرَ رَسُولُ اللّهِ - صلَّى الله عليه وسلَّم - إلَى الْمُشْرِكِينَ وَهُمْ أَلْفٌ ، وَأَصْحَابُهُ ثَلاَثُمِائَةٍ وَتِسْعَةَ عَشَرَ رَجُلاً ، فَاسْتَقْبَلَ نَبِيُّ اللّهِ الْقِبْلَةَ ، ثُمَّ مَدَّ يَدَيْهِ فَجَعَلَ يَهْتِفُ بِرَبِّهِ:  اللَّهُمَّ أَنْجِزْ لِي مَا وَعَدْتَنِي، اللَّهُمَّ آتِ مَا وَعَدْتَنِي، اللَّهُمَّ إنْ تَهْلِكْ هَـذِهِ الْعِصَابَةُ مِنْ أَهْلِ الإِسْلاَمِ لاَ تُعْبَدْ فِي الأَرْضِ فَمَا زَالَ يَهْتِفُ بِرَبِّهِ، مَادّاً يَدَيْهِ ، مُسْتَقْبِلَ الْقِبْلَةِ ، حَتَّى سَقَطَ رِدَاؤُهُ عَنْ مَنْكِبَيْهِ ، فَأَتَاهُ أَبُو بَكْرٍ، فَأَخَذَ رِدَاءَهُ فَأَلْقَاهُ عَلَى مَنْكِبَيْهِ. ثُمَّ الْتَزَمَهُ مِنْ وَرَائِهِ. وَقَالَ: يَا نَبِيَّ اللّهِ كَفَاكَ مُنَاشَدَتَكَ رَبَّكَ ، فَإنَّهُ سَيُنْجِزُ لَكَ مَا وَعَدَكَ... رواه مسلم برقم (1763).والأحاديث لهذه السُّنَّة كثيرة ."},
        {"text": "البدء بالثناء على الله - عز وجل -، والصلاة على رسوله - صلَّى الله عليه وسلَّم -. \n\n لِمَا رواه الترمذي ، عن فَضَالَةَ بن عُبَيْد  - رضي الله عنه - قال : بَيْنَا رَسُولُ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ -  قَاعِدٌ إِذْ دَخَلَ رَجُلٌ فَصَلَّى فَقَالَ :  اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي ، فَقَالَ رَسُولُ اللَّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ -: عَجِلْتَ أَيُّهَا الْمُصَلِّي ، إِذَا صَلَّيْتَ فَقَعَدْتَ فَاحْمَدْ اللَّهَ بِمَا هُوَ أَهْلُهُ ، وَصَلِّ عَلَيَّ ، ثُمَّ ادْعُهُ  رواه الترمذي برقم (3476)، وصححه الألباني (صحيح الجامع 1/172)."},
        {"text": "دعاء الله - تعالى - بأسمائه الحسنى. \n\n فيختار من أسماء الله الحسنى ما يلائم دعوته ويوافقها ؛ فإذا سأل الله - سبحانه -  الرزق ، قال: يا رزاق  ، وإذا سأل الله - تعالى -  الرحمة ، قال: يا رحمان يا رحيم، وإذا سأل الله - عز وجلّ  - العِزَّة ، قال: يا عزيز ، وإذا سأل الله - عز وجلّ - المغفرة ، قال   يا غفور  ، وإذا سأله شفاء قال : يا شافي .وهكذا يدعو بما يناسب دعوته ؛ لقوله تعالى :{وَلِلّهِ الأَسْمَاء الْحُسْنَى فَادْعُوهُ بِهَا}[الأعراف:180]."},
        {"text": "تكرار الدعاء، والإلحاح فيه. \n\nويدلّ عليه حديث ابن عباس - رضي الله عنهما - الذي تقدَّم حيث قال النَّبيُّ - صلَّى الله عليه وسلَّم -: اللَّهُمَّ أَنْجِزْ لِي مَا وَعَدْتَنِي، اللَّهُمَّ آتِ مَا وَعَدْتَنِي \n\n  وما زال يهتف بربه - تعالى - حتى سقط رداؤه عن منكبيه، وأبو بكر يلتزمه ويقول له: يَا نَبِيَّ اللّهِ كَفَاكَ مُنَاشَدَتَكَ رَبَّكَ \n\n  رواه مسلم برقم 1763 \n\n  وكذلك ما جاء في الصحيحين، من حديث أبي هريرة - رضي الله عنه - حينما دعا النَّبيُّ - صلَّى الله عليه وسلَّم - لدَوْس، فقال: اللهم اهْدِ دَوْساً وائْتِ بهم، اللهم اهْدِ دَوْساً وائت بهم \n\n  رواه البخاري برقم 2937، رواه مسلم برقم 2524 \n\n  وكذلك ما جاء في صحيح مسلم، في: الرَّجُلُ يُطِيلُ السَّفَرَ، أَشْعَثَ أَغْبَرَ، يَمُدُّ يَدَيْهِ إِلَى السَّمَاءِ. يَا رَبِّ يَا رَبِّ \n\n  رواه مسلم برقم 1015 وهذا تكرار فيه إلحاح \n\n  والسُّنَّة أن يدعو ثلاثاً \n\n  لحديث ابن مسعود - رضي الله عنه - في الصحيحين، وفيه: وَكَانَ إِذَا دَعَا، دَعَا ثَلاثًا، وَإِذَا سأَلَ، سَأَلَ ثَلاثًا، ثُمَّ قَالَ: اللَّهُمَّ عَلَيْكَ بِقُرَيْشٍ ثَلاثَ مَرَّاتٍ \n\n  رواه البخاري برقم 240، رواه مسلم برقم 1794 \n\n  ففي هذه الأحاديث فوائد عظيمة: \n\n  1. مشروعية الإلحاح في الدعاء \n\n  2. تكرار الدعاء ثلاث مرات \n\n  3. رفع اليدين حال الدعاء \n\n  4. الاجتهاد في الدعاء حتى يظهر أثر ذلك على الداعي \n\n  5. الدعاء للأمم بالهداية \n\n  وينبغي للمسلم أن: \n\n  - يلح في دعائه \n\n  - يكرر دعاءه ثلاثاً \n\n  - يرفع يديه حال الدعاء \n\n  - يظهر الخشوع والتضرع \n\n  - لا يستبطئ الإجابة \n\n "},
        {"text": "إخفاء الدعاء. \n\n لقوله تعالى :{ادْعُواْ رَبَّكُمْ تَضَرُّعاً وَخُفْيَةً}[الأعراف:55]، وإخفاء الدعاء أقرب للإخلاص ، ولذا امتدح الله – عز وجلّ -  زكريا - عليه السلام - فقال :{إِذْ نَادَى رَبَّهُ نِدَاء خَفِيّاً }[ مريم:3 ] ؛ طلباً للإخلاص على أحد أقوال أئمة التفسير ."},
        {"text": "ماذا أقول في دعائي ؟ \n\n فائدة : ربما يسأل البعض : ماذا أقول في دعائي ؟  \n\n فالجواب : ادع بما تريده من أمور الدنيا والآخرة ، واحرص في دعائك على جوامع الكَلِم ، وهي الأدعية الواردة في الكتاب والسُّنَّة ، ففيها سؤال خيري الدنيا والآخرة ، وتأمل هذا السؤال حين عُرض على النَّبيِّ - صلَّى الله عليه وسلَّم - فأجاب بكلمات عظيمات ، تجمع للمسلم الدنيا والآخرة ، فما أعظمها من بشارة ، وما أجزلها من عطيَّة ، فتمسك بهن وتدبرهن .عن أبي مالك الأشجعي عن أبيه - رضي الله عنهما- :  أَنَّهُ سَمِـعَ النَّبِي - صلَّى الله عليه وسلَّم - وَأَتَاهُ رَجُلٌ فَقَالَ: يَا رَسُولَ اللّهِ كَيْفَ أَقُولُ حِينَ أَسْأَلُ رَبِّي؟ قَالَ : قُلِ: اللَّهُمَّ اغْفِرْ لِي ، وَارْحَمْنِي ، وَعَافِنِي ، وَارْزُقْنِي ، وَيَجْمَعُ أَصَابِعَهُ إِلاَّ الإِبْهَامَ  فَإِنَّ هؤُلاَءِ تَجْمَعُ لَكَ دُنْيَاكَ وَآخِرَتَكَ رواه مسلم برقم (2697) .وفي رواية له : كَانَ الرَّجُلُ إِذَا أَسْلَمَ عَلَّمَهُ النَّبِيُّ - صلَّى الله عليه وسلَّم -  الصَّلاَةَ ، ثُمَّ أَمَرَهُ أَنْ يَدْعُوَ بِهؤُلاَءِ الْكَلِمَاتِ:  اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي ، وَاهْدِنِي ، وَعَافِنِي ، وَارْزُقْنِي رواه مسلم برقم (2697) ."},
        {"text": "يُسَنُّ للإنسان أن يدعو لأخيه بظهر الغيب \n\n فائدة أخرى : يُسَنُّ للإنسان أن يدعو لأخيه بظهر الغيب ، فهي دعوة مستجابة بإذن الله - تعالى -  ، وللداعي فضل عظيم ، وهو ما رواه مسلم في صحيحه ، عن أبي الدرداء - رضي الله عنه - قال : قال رسول الله - صلَّى الله عليه وسلَّم -: دَعْوَةُ الْمَرْءِ الْمُسْلِمِ لأَخِيهِ بِظَهْرِ الْغَيْبِ ، مُسْتَجَابَةٌ ، عِنْدَ رَأْسِهِ مَلَكٌ مُوَكَّلٌ ، كُلَّمَا دَعَا لأَخِيهِ بِخَيْرٍ، قَالَ الْمَلَكُ الْمُوَكَّلُ بِهِ: آمِينَ، وَلَكَ بِمِثْلٍ رواه مسلم برقم (2733)."},


    ],

    "ziekr_allh": [
        {"text": "أعظمه : تلاوة كتاب الله - تعالى- \n\nمن السنن اليومية ذكر الله تعالى.وأعظمه : تلاوة كتاب الله - تعالى-  ، فالتعبد بتلاوته أسهر عيون السلف ، وأقض مضاجعهم {كَانُوا قَلِيلاً مِّنَ اللَّيْلِ مَا يَهْجَعُونَ * وَبِالْأَسْحَارِ هُمْ يَسْتَغْفِرُونَ}[ الذاريات: 18 ]  ، فجمعوا في ليلهم تلاوة كتاب الله - تعالى - ،  وسائر الأذكار المأثورة عن رسول الله - صلَّى الله عليه و سلَّم -  ، فللّه درُّه من ليل طاب بإحياء أهله له ، ويالخسارتنا وتهاوننا ، وتفريطنا ، بليالينا ، وأسحارنا ! وعسى أن تسلَم من عصيان إلهنا ، إلَّا ما رحم ربنا - تعالى -  .وعن حماد بن زيد : عن عطاء بن السائب ، أنَّ أبا عبد الرحمن قال :  أخذنا القرآن عن قوم أخبرونا أنهم كانوا إذا تعلموا عشر آيات ،لم يجاوزوهن إلى العشر الأخر حتى يعلموا ما فيهن ، فكنا نتعلم القرآن ، والعمل به ، وسيرث القرآن بعدنا قوم يشربونه شرب الماء لا يجاوز تراقيهم  انظر : سير أعلام النبلاء (4/ 269 ) . "},
        {"text": "الذِّكر فيه حياة للقلوب . \n\n كثير منَّا لاسيما في هذه الأزمان ، وكثرة الانشغال يشكو صدأ قلبه وغفلته ، وحياة القلب تكون بالذِّكر ، ففي صحيح البخاري من حديث أبي موسى - رضي الله عنه - قال: قال النبيُّ - صلَّى الله عليه وسلَّم - :  مَثَلُ الَّذِي يَذْكُرُ رَبَّهُ وَالَّذِي لَا يَذْكُرُ رَبَّهُ مَثَلُ الْحَيِّ وَالْمَيِّتِ ، وفي لفظ مسلم قال النَّبيُّ - صلَّى الله عليه وسلَّم - : مَثَلُ الْبَيْتِ الَّذِي يُذْكَرُ اللّهُ فِيهِ، وَالْبَيْتِ الَّذِي لاَ يُذْكَرُ اللّهُ فِيهِ، مَثَلُ الْحَيِّ وَالْمَيِّتِ  رواه البخاري برقم (6407)، رواه مسلم برقم (779) ."},
        {"text": "حث الله - عز وجلَّ - على ذِكْره في مواضع عديدة، منها: \n\n 1/ حث اللهُ - عز وجلّ- عباده على الإكثار من الذِّكر، فقال تعالى: {يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللَّهَ ذِكْرًا كَثِيرًا * وَسَبِّحُوهُ بُكْرَةً وَأَصِيلًا} \n\n [الأحزاب:41-42] \n\n2/ ووعد الله - تعالى - الذاكرين والذاكرات بالمغفرة والأجر العظيم، فقال تعالى: {وَالذَّاكِرِينَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتِ أَعَدَّ اللَّهُ لَهُم مَّغْفِرَةً وَأَجْرًا عَظِيمًا} \n\n [الأحزاب:35] \n\n3/ وحذرنا الله - عز وجلَّ - من صفات المنافقين في قلة ذكرهم لله، فقال تعالى: {إِنَّ الْمُنَافِقِينَ يُخَادِعُونَ اللَّهَ وَهُوَ خَادِعُهُمْ وَإِذَا قَامُوا إِلَى الصَّلَاةِ قَامُوا كُسَالَى يُرَاءُونَ النَّاسَ وَلَا يَذْكُرُونَ اللَّهَ إِلَّا قَلِيلًا} \n\n [النساء:142] \n\n4/ وحذرنا الله - عز وجلَّ - من الانشغال عن ذكره بالأموال والأولاد، فقال تعالى: {يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تُلْهِكُمْ أَمْوَالُكُمْ وَلَا أَوْلَادُكُمْ عَن ذِكْرِ اللَّهِ وَمَن يَفْعَلْ ذَلِكَ فَأُولَئِكَ هُمُ الْخَاسِرُونَ} \n\n [المنافقون:9] \n\n5/ وبيّن الله - عز وجلَّ - فضل الذكر العظيم في قوله: {فَاذْكُرُونِي أَذْكُرْكُمْ} \n\n [البقرة:152] \n\nوفي الحديث القدسي: أَنَا عِنْدَ ظَنِّ عَبْدِي بِي، وَأَنَا مَعَهُ إِذَا ذَكَرَنِي، فَإِنْ ذَكَرَنِي فِي نَفْسِهِ، ذَكَرْتُهُ فِي نَفْسِي، وَإِنْ ذَكَرَنِي فِي مَلَإٍ، ذَكَرْتُهُ فِي مَلَإٍ خَيْرٍ مِنْهُمْ \n\nرواه البخاري برقم 7405، ومسلم برقم 2675 عن أبي هريرة - رضي الله عنه - \n\nففي هذه الآيات والأحاديث فوائد عظيمة:- فضل كثرة ذكر الله تعالى- وجوب الحذر من قلة الذكر كالمنافقين- التحذير من الانشغال عن الذكر بالدنيا- عظم جزاء الذاكرين عند الله- شرف مصاحبة الله للذاكرين \n\nوينبغي للمسلم أن:- يواظب على الأذكار الشرعية- يجتهد في كثرة الذكر في جميع الأحوال- يحذر من الغفلة عن ذكر الله- يستشعر معية الله عند الذكر- يربّي أولاده على حب الذكر"},
        {"text": "من كنوز الذكر اليومية (1) \n\n 1. عن أبي هريرة - رضي الله عنه - أن رسول الله - صلَّى الله عليه وسلَّم - قال: مَنْ قَالَ: لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، فِي يَوْمٍ مِائَةَ مَرَّةٍ، كَانَتْ لَهُ عِدْلَ عَشْرِ رِقَابٍ، وَكُتِبَتْ لَهُ مِائَةُ حَسَنَةٍ، وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ، وَكَانَتْ لَهُ حِرْزًا مِنَ الشَّيْطَانِ يَوْمَهُ ذَلِكَ حَتَّى يُمْسِيَ، وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ عَمِلَ أَكْثَرَ مِنْ ذَلِكَ. وَمَنْ قَالَ: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، فِي يَوْمٍ مِائَةَ مَرَّةٍ، حُطَّتْ خَطَايَاهُ، وَلَوْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ \n\nرواه البخاري برقم 3293، ومسلم برقم 2691 \n\n2. وعن أبي أيوب - رضي الله عنه - قال النبي - صلَّى الله عليه وسلَّم -: مَنْ قَالَ: لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، عَشْرَ مِرَارٍ، كَانَ كَمَنْ أَعْتَقَ أَرْبَعَةَ أَنْفُسٍ مِنْ وَلَدِ إِسْمَاعِيلَ \n\nرواه البخاري برقم 6404، ومسلم برقم 2693 \n\n3. وعن أبي موسى الأشعري - رضي الله عنه - قال النبي - صلَّى الله عليه وسلَّم -: أَلَا أَدُلُّكُمْ عَلَى كَنْزٍ مِنْ كُنُوزِ الْجَنَّةِ؟ فَقَالَ: لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ \n\nرواه البخاري برقم 6610، ومسلم برقم 2704 \n\n4. وعن أبي هريرة - رضي الله عنه - أن النبي - صلَّى الله عليه وسلَّم - قال: كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الْمِيزَانِ، حَبِيبَتَانِ إِلَى الرَّحْمَنِ: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحَانَ اللَّهِ الْعَظِيمِ \n\nرواه البخاري برقم 7563، ومسلم برقم 2694 \n\n5. وعن أبي هريرة - رضي الله عنه - أن النبي - صلَّى الله عليه وسلَّم - قال: مَنْ قَالَ حِينَ يُصْبِحُ وَحِينَ يُمْسِي: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ مِائَةَ مَرَّةٍ، لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ، إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ \n\nرواه مسلم برقم 2692 \n\nففي هذه الأحاديث فوائد عظيمة:- فضل الذكر عموماً والتسبيح والتهليل خصوصاً- عظم أجر الذاكرين عند الله تعالى- محو الخطايا والذنوب بالذكر- الحفظ من الشيطان وأذاه- مضاعفة الحسنات وتكفير السيئات \n\nوينبغي للمسلم أن:- يواظب على الأذكار الواردة- يحافظ على الأوقات المحددة للذكر- يستشعر معاني الأذكار- يحرص على تعليمها لأهله وأولاده- يجتهد في الإكثار من ذكر الله في جميع الأحوال"},
        {"text": "من كنوز الذكر اليومية (2) \n\n إليك النص بعد التعديلات المطلوبة:مما ورد في سُنَّة النَّبيّ - صلَّى الله عليه وسلَّم - من أنواع الذكر كثير، منها ما يلي:\n\n3. عن سعد بن أبي وقاص - رضي الله عنه - قال: كُنَّا عِنْدَ رَسُولِ اللّهِ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - فقال: أَيَعْجِزُ أَحَدُكُمْ أَنْ يَكْسِبَ، كُلَّ يَوْمٍ، أَلْفَ حَسَنَةٍ؟ فَسَأَلَهُ سَائِلٌ مِنْ جُلَسَائِهِ: كَيْفَ يَكْسِبُ أَحَدُنَا أَلْفَ حَسَنَةٍ؟ قَالَ: يُسَبِّحُ مِائَةَ تَسْبِيحَةٍ، فَيُكْتَبُ لَهُ أَلْفُ حَسَنَةٍ. أَوْ يُحَطُّ عَنْهُ أَلْفُ خَطِيئَةٍ رواه مسلم برقم (2698).\n\n4. عن أبي هريرة - رضي الله عنه - أنَّ رسول الله - صلَّى الله عليه وسلَّم - قال: مَنْ قَالَ سُبْحَانَ اللّهِ وَبِحَمْدِهِ فِي يَوْمٍ، مِائَةَ مَرَّةٍ، حُطَّتْ عنه خَطَايَاهُ وَإنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ رواه البخاري برقم (6405)، رواه مسلم برقم (2692).\n\nوفي رواية عند مسلم: مَنْ قَالَ حِينَ يُصْبِحُ وَحِينَ يُمْسِي: سُبْحَانَ اللّهِ وَبِحَمْدِهِ، مِائَةَ مَرَّةٍ، لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ، إِلاَّ أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ رواه مسلم برقم (2692).\n\nوالأحاديث في أنواع الذِّكر وفضلها كثيرة، والذي تقدَّم هو من أشهر وأصحّ ما ورد من الذِّكر له فضل، وورد غيره كثير، فعن أبي موسى الأَشْعَرِي - رضي الله عنه – قال: قَالَ لِي رَسُولُ اللّهِ - صلَّى الله عليه وسلَّم -: أَلاَ أَدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ الْجَنَّةِ؟ فَقُلْتُ: بَلَى. فَقَالَ: قُل لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللّهِ رواه البخاري برقم (4202)، رواه مسلم برقم (2704).\n\nوعن أبي هريرة - رضي الله عنه - قال: قَالَ رَسُولُ اللّهِ - صلَّى الله عليه وسلَّم -: لأَنْ أَقُولَ: سُبْحَانَ اللّهِ، وَالْحَمْدُ للّهِ، وَلاَ إِلَـهَ إِلاَّ اللّهُ، وَاللّهُ أَكْبَرُ، أَحَبُّ إِلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ رواه مسلم برقم (2695)."},
        {"text": "من كنوز الذكر اليومية (3) \n\n إليك النص المعدل وفق الطلب:  والاستغفار أيضاً هو من أنواع الذِّكر، عن الأغرِّ المُزني - رضي الله عنه - قال النَّبيّ - صلَّى الله عليه وسلَّم -: إِنَّهُ لَيُغَانُ عَلَى قَلْبِي، وَإِنِّي لأَسْتَغْفِرُ اللّهَ فِي الْيَوْمِ مِائَةَ مَرَّةٍ رواه مسلم برقم (2702).\n\nوهذا فعله - صلَّى الله عليه وسلَّم -، وقد حثَّ على الاستغفار من قوله، كما في صحيح مسلم عن الأغرِّ - رضي الله عنه - أيضاً قال: قَالَ رَسُولُ اللّهِ - صلَّى الله عليه وسلَّم -: يا أيُّهَا النَّاسُ تُوبُوا إِلَى اللّهِ، فَإِنِّي أَتُوبُ فِي الْيَوْمِ إِلَيْهِ مِائَةَ مَرَّةٍ رواه مسلم برقم (2702).\n\nوعند البخاري من حديث أبي هريرة - رضي الله عنه - قال: سمعتُ رسولَ اللّهِ - صلَّى الله عليه وسلَّم - يقول: وَاللَّهِ إِنِّي لَأَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فِي الْيَوْمِ أَكْثَرَ مِنْ سَبْعِينَ مَرَّةً رواه البخاري برقم (6307)، فينبغي للعبد ألَّا يغفل عن الاستغفار.\n\nوأختم سُنَّة الذِّكر - وكذا جميع السُّنَن اليوميَّة - بذكر عظيم جاء في الصحيحين، وهو حديث أبي هريرة - رضي الله عنه – قال: قَالَ رَسُولُ اللّهِ - صلَّى الله عليه وسلَّم -: كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الْمِيزَانِ، حَبِيبَتَانِ إِلَى الرَّحْمنِ: سُبْحَانَ اللّه وَبِحَمْدِهِ، سُبْحَانَ اللّهِ الْعَظِيمِ رواه البخاري برقم (6406)، رواه مسلم برقم (2694).\n\nوالحمد لله الذي بنعمته تتم الصالحات."},

    ],

}




# ============ بيانات الأذكار ============
azkar_sabah = [
    {"text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\n\nاللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ [ البقرة: 255]\n\nمن قالها حين يصبح أجبر من الجن حتى يمسي ومن قالها حين يمسي أجير من الجن حتى يصبح", "count": 1,"icon":"assets/icons/sabaah.png.png"},
        {"text": "بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيم\n\n قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ\n\nمن قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)", "count": 3},
        {"text": "بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيم\n\n قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ", "count": 3},
        {"text": "بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيم\n\n  قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ", "count": 3},
        {"text": "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ للَّه وَالحَمدُ للَّه ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر", "count": 1},
        {"text": "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ \n\nمن قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح", "count": 1},
        {"text": "رَضيـتُ بِاللَّهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى اللَّه عليه وسلم نَبِيّـاً\n\nمن قالها حين يصبح وحين يمسى كان حقا على اللَّهِ أن يرضيه يوم القيامة", "count": 3},
        {"text": "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك\n\nمن قالها أعتقه اللَّه من النار", "count": 4},
        {"text": "اللّهُـمَّ ما أَصْبَـحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر\n\nمن قالها حين يصبح أدى شكر يومه", "count": 1},
        {"text": "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم\n\nمن قالها كفاه اللَّه ما أهمه من أمر الدنيا والأخرة", "count": 7},
        {"text": "بِسـمِ اللَّهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم\n\nلم يضره من اللَّهِ شيء", "count": 3},
        {"text": "اللّهُـمَّ بِكَ أصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور", "count": 1},
        {"text": "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ", "count": 1},
        {"text": "سُبْحـانَ اللَّهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه", "count": 3},
        {"text": "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ", "count": 3},
        {"text": "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ", "count": 3},
        {"text": "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي", "count": 1},
        {"text": "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ", "count": 3},
        {"text": "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للَّهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه", "count": 1},
        {"text": "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم", "count": 1},
        {"text": "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق", "count": 3},
        {"text": "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد\n\nمن صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة", "count": 10},
        {"text": "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ", "count": 3},
        {"text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ", "count": 3},
        {"text": "أسْتَغْفِرُ اللَّهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ", "count": 3},
        {"text": "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ", "count": 3},
        {"text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا", "count": 1},
        {"text": "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ\n\nذكر طيب", "count": 1},
        {"text": "لَا إلَه إلّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ\n\nكانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان", "count": 100},
        {"text": "سُبْحـانَ اللَّهِ وَبِحَمْـدِهِ\n\nحُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ", "count": 100},
        {"text": "أسْتَغْفِرُ اللَّهَ وَأتُوبُ إلَيْهِ\n\nمائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى", "count": 100},
]

azkar_masaa = [
    {"text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\n\n اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ [ البقرة: 255]\n\nمن قالها حين يصبح أجبر من الجن حتى يمسي ومن قالها حين يمسي أجير من الجن حتى يصبح", "count": 1,"icon":"assets/icons/masaa.png.png"},
        {"text": "بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيم\n\n آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ [ البقرة 285 : 286]\n\nمن قرأ آيتين من آخر سورة البقرة في ليلة كفتاه", "count": 1},
        {"text": "بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيم\n\n قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ\n\nمن قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)", "count": 3},
        {"text": "بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيم\n\n قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ", "count": 3},
        {"text": "بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيم\n\n قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ", "count": 3},
        {"text": "أَمْسَيْـنا وَأَمْسـى المـلكُ للَّه وَالحَمدُ للَّه ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر", "count": 1},
        {"text": "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ \n\nمن قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح", "count": 1},
        {"text": "رَضيـتُ بِاللَّهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى اللَّه عليه وسلم نَبِيّـاً\n\nمن قالها حين يصبح وحين يمسى كان حقا على اللَّه أن يرضيه يوم القيامة", "count": 3},
        {"text": "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللَّهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك\n\nمن قالها أعتقه الله من النار", "count": 4},
        {"text": "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر\n\nمن قالها حين يمسى أدى شكر يومه", "count": 1},
        {"text": "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم\n\nمن قالها كفاه اللَّه ما أهمه من أمر الدنيا والأخرة", "count": 7},
        {"text": "بِسـمِ اللَّهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم\n\nلم يضره من الله شيء", "count": 3},
        {"text": "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ", "count": 1},
        {"text": "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِمًا وَمَا كَانَ مِنَ المُشْرِكِينَ", "count": 1},
        {"text": "سُبْحـانَ اللَّهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه", "count": 3},
        {"text": "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ", "count": 3},
        {"text": "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ", "count": 3},
        {"text": "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي", "count": 1},
        {"text": "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ", "count": 3},
        {"text": "أَمْسَيْنا وَأَمْسَى الْمُلْكُ للَّهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا", "count": 1},
        {"text": "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم", "count": 1},
        {"text": "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق", "count": 3},
        {"text": "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد\n\nمن صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة", "count": 10},
        {"text": "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ", "count": 3},
        {"text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ", "count": 3},
        {"text": "أسْتَغْفِرُ اللَّهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ", "count": 3},
        {"text": "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ", "count": 3},
        {"text": "لَا إلَه إلّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ\n\nكانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان", "count": 100},
        {"text": "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ\n\nذكر طيب", "count": 1},
        {"text": "سُبْحـانَ اللَّهِ وَبِحَمْـدِهِ\n\nحُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ", "count": 100},
]

azkar_baad_salah = [
    {"text": "أَسْـتَغْفِرُ اللَّه، أَسْـتَغْفِرُ اللَّه، أَسْـتَغْفِرُ اللَّه اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام", "count": 1,"icon":"assets/icons/salah.png.png"},
        {"text": "لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد", "count": 1},
        {"text": "لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون", "count": 1},
        {"text": "سُـبْحانَ اللَّهِ", "count": 33},
        {"text": "الحَمْـدُ لله", "count": 33},
        {"text": "اللَّهُ أكْـبَر", "count": 33},
        {"text": "لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير", "count": 1},
        {"text": "بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيم\n\n  قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ\n\nثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى", "count": 3},
        {"text": "بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيم\n\n  قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ\n\nثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى", "count": 3},
        {"text": "بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيم\n\n  قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ\n\nثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى", "count": 3},
        {"text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\n\n  اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ [ البقرة: 255]", "count": 1},
        {"text": "لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير\n\nعَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح", "count": 10},
        {"text": "اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً\n\nبَعْد السّلامِ من صَلاةِ الفَجْر", "count": 1},
        {"text": "اللَّهُمَّ أَجِرْنِي مِنْ النَّار\n\nبعد صلاة الصبح والمغرب", "count": 7},
        {"text": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ", "count": 1},
]

adeiat_wa_azkar_mutanawiea = [
    {"text": "دعاء لبس الثوب\n\nالحمدُ للهِ الّذي كَساني هذا (الثّوب) وَرَزَقَنيه مِنْ غَـيـْرِ حَولٍ مِنّي وَلا قـوّة", "count": 1},
        {"text": "دعاء لبس الثوب الجديد\n\nاللهم لك الحمد أنت كسوتنيه، أسألك من خيره", "count": 1},
        {"text": "دعاء الكرب\n\nلا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السماوات، ورب الأرض ورب العرش الكريم\n\nاللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين وأصلح لي شأني كله ، لا إله إلا أنت\n\nلا إله إلا أنت سبحانك إني كنت من الظالمين\n\nالله الله رب لا أشرك به شيئا", "count": 1},
        {"text": "دعاء الهم والحزن\n\nاللهم إني عبدك ابن عبدك ابن أمتك ناصيتي بيدك ماض في حكمك ، عدل في قضاؤك أسألك بكل اسم هو لك سميت به نفسك أو أنزلته في كتابك ، أو علمته أحداً من خلقك أو استأثرت به في علم الغيب عندك أن تجعل القرآن ربيع قلبي ، ونور صدري وجلاء حزني وذهاب همي\n\nاللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل والجبن ، وضلع الدين وغلبة الرجال", "count": 1},
        {"text": "دعاء قضاء الدين\n\nاللهم اكفنى بحلالك عن حرامك وأغننى بفضلك عمن سواك", "count": 1},
        {"text": "دعاء الريح\n\nاللهم إنى أسألك خيرها، وخير ما فيها، وخير ما أرسلت به، وأعوذ بك من شرها، وشر ما فيها وشر ما أرسلت به", "count": 1},
        {"text": "دعاء الرعد\n\nسبحان الله الذي يسبح الرعد بحمده والملائكة من خيفته", "count": 1},
        {"text": "دعاء زيارة القبور\n\nالسلام عليكم أهل الديار من المؤمنين والمسلمين، وإنا إن شاء الله بكم لاحقون ويرحم الله المستقدمين منا والمستأخرين، أسأل الله لنا ولكم العافية", "count": 1},
        {"text": "دعاء نزول االمطر\n\nاللهم صيباَ نافعاَ", "count": 1},
        {"text": "دعاء ركوب الدابة أو ما يقوم مقامها ( السيارة أو القطار أو الطائرة أو السفينة)\n\nبسم الله ، الحمد لله ، سبحان الذي سخر لنا هذا وماكنا له مقرنين وإنا إلى ربنا لمنقلبون، الحمد لله ، الحمد لله ، الحمد لله ، الله اكبر ، الله أكبر ، الله أكبر ، سبحانك اللهم إني ظلمت نفسي فاغفر لي ، فإنه لايغفر الذنوب إلا أنت", "count": 1},
        {"text": "دعاء السفر\n\nاللهم إنا نسألك في سفرنا هذا البر والتقوى، ومن العمل ماترضى ، اللهم هون علينا سفرنا هـذا واطوِ عنا بعده، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك من وعثاء السفر وكآبة المنظر وسوء المنقلب في المال والأهل\n\nوإذا رجع قالهن وزاد فيهن ،آيبون ،تآئبون، عابدون ، لربنا حامدون", "count": 1},
        {"text": "دعاء المسافر للمقيم\n\nاستودعكم الله الذي لا تضيع ودائعه", "count": 1},
        {"text": "دعاء المقيم للمسافر\n\nأستودع ُ الله دينك وأمانتك ، وخواتيم عملك زودك الله التقوى، وغفر ذنبك، ويسر لك الخير حيث ما كنت", "count": 1},
        {"text": "دعاء النزول في مكان\n\nأعوذ بكلمات الله التامات من شر ما خلق", "count": 1},
        {"text": "الدعاء بين السجدتين\n\nرب اغفر لي رب اغفر لي اللهم اغفر لي ، وارحمني واهدني واجبرني وعافني وارزقني وارفعني", "count": 1},
        {"text": "دعاء من استصعب عليه أمر\n\nاللهم لاسهل إلا ماجعلته سهلا وأنت تجعل الحزن إذا شئت سهلا", "count": 1},
        {"text": "دعاء الخوف من الشرك\n\nاللهم إني أ عوذ بك أن أشرك بك وأنا أعلم ، وأستغفرك لما لا أعلم", "count": 1},
        {"text": "ما يقال في المجلس\n\nرب اغفر لي وتب عليّ إنك أنت التواب الغفور (100 مرة قبل أن يقوم)", "count": 100},
        {"text": "كفارة المجلس\n\nسبحانك اللهم وبحمدك ، أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك", "count": 1},
        {"text": "دعاء من رأى مبتلى\n\nالحمد لله الذي عافاني مما ابتلا به وفضلني على كثير ممن خلق تفضيلاً", "count": 1},
        {"text": "دعاء الغضب\n\nأعوذ بالله من الشيطان الرجيـم", "count": 1},
        {"text": "الدعاء للمتزوج\n\nبارك الله لك ، وبارك عليك ، وجمع بينكما في خير", "count": 1},
        {"text": "دعاء المتزوج لنفسه\n\nاللهم إني أسألك خيرها وخير ماجبلتها عليه وأعوذ بك من شرها وشر ماجبلتها عليه ، وإذا اشترى بعيراً فليأخذ بذروة سنامه وليقل مثل ذلك", "count": 1},
        {"text": "الدعاء قبل الجماع\n\nبسم الله ـ اللهم جنبنا الشيطان، وجنب الشيطان مارزقتنا", "count": 1},
        {"text": "دعاء العطاس\n\nإذا عطـس أحـدكم فليقل : الحمـد لله ، وليقل له أخـوه ، أو صاحبه : يرحمـك الله فـإذا قال له : يرحمك الله ، فليقل : يهديكم الله ويصلح بالكم", "count": 1},
        {"text": "الدعاء عند افطار الصائم\n\nذهب الضمـأ ، وأبتلت العروق ، وثبت الأجر إن شاء الله ", "count": 1},
        {"text": "الدعاء إذا أفطر عند أهل بيت\n\nأفطر عندكم الصائمون ، وأكل طعامكم الأبرار ، وصلت عليكم الملائكة ", "count": 1},
        {"text": "دعاء رؤية الهلال\n\nالله أكبر ، اللهم أهله علينا بالأمن ، والإيمان والسلامة ، والإسلام ، والتوفيق لما تحب وترضى ربنا وربك الله", "count": 1},
        {"text": "دعاء من أصيب بمصيبة\n\nإنا للَّه وإنا إليه راجعون اللهم أجرني في مصيبتي واخلف لي خيرا منها", "count": 1},
        {"text": "الدعاء للمريض في عيادته\n\nلابأس طهور إن شاء الله مامن عبد مسلم يعود مريضاً لم يحضر أجله فيقول سبع مرات : أسأل الله العظيم رب العرش العظيم أن يشفيك إلا عوفي", "count": 1},
        {"text": "دعاء المريض الذي يئس من حياته\n\nاللهم اغفر لي وارحمني والحقني بالرفيق الأعلى", "count": 1},
        {"text": "ما يعوذ به الأولاد\n\nأعيذكما بكلمات الله التامة من كل شيطان وهامة ، ومن كل عين لامة", "count": 1},
        {"text": "دعاء لقاء العدو وذي السلطان\n\nحسـبنا الله ونعـم الـوكـيل، اللهم إنا نجعلك في نحورهم ونعوذ بك من شرورهم ،اللهم أنت عضدي ، وأنت نصيري ، بك أجول وبك أصول وبك أقاتل", "count": 1},
        {"text": "دعاء صلاة الاستخارة\n\nقال جابر بن عبدالله رضي الله عنهما : كان رسول الله صلى الله عليه وسلم يعلمنا الاستخارة في الامور كلها كما يعلمنا السورة من القرآن ، يقول : ( إذا هم أحدكم بالأمر فليركع ركعتين من غير الفريضة ثم ليقل : اللهم إني أستخيرك بعلمك ، وأستقدرك بقدرتك وأسألك من فضلك العظيم فإنك تقدر ولا أقدر وتعلم ولاأعلم وأنت علام الغيوب ، اللهم إن كنت تعلم أن هذا الأمر ـ ويسمي حاجته ـ خيرا لي في ديني ومعاشي وعاقبة أمري ـ أو قال عاجله وآجله ـ فأقدره لي ويسره لي ثم بارك لي فيه ، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري ـ أو قال عاجله وآجله ـ فاصرفه عني واصرفني عنه واقدر لي الخير حيث كان ثم ارضني به)", "count": 1},
        {"text": "دعاء سجود التلاوة\n\nسجد وجهي للذي خلقه ،وشق سمعه وبصره بحوله وقوته ( فتبارك اللَّه احسن الخالقين )", "count": 1},
        {"text": "دعاء الاستفتاح\n\nاللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والغرب ، اللهم نقني من خطاياي كما ينقى الثوب الأبيض من الدنس، اللهم اغسلني من خطاياي بالثلج والماء والبرد\n\nالله اكبر كبيرا ، الله اكبر كبيرا ، الله اكبر كبيرا ، والحمد لله كثيرا ، والحمد لله كثيرا ، والحمد لله كثيرا ، وسبحان الله بكرة وأصيلا(ثلاثـــا) ـ اعوذ بالله من الشيطان من نفحه ونفثه وهمزه سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدُّك ولاإله غيرك", "count": 1},
        {"text": "دعاء دخول السوق\n\nلا إله إلا الله وحده لا شريك له، له الملك وله الحمد يحيي ويميت وهو حي لا يموت بيده الخير وهو على كل شيء قدير (كتب الله له ألف ألف حسنة ومحا عنه ألف ألف سيئة ورفع له ألف الف درجة وفي رواية: وبنى له بيتا في الجنة)\n\nبسم الله، اللهم إني أسألك خير هذه السوق، وخير ما فيها، وأعوذ بك من شرها وشر ما فيها، اللهم إني أعوذ بك أن أصيب بها يميناً فاجرةً، أو صفقة خاسرة", "count": 1},
        {"text": "الدعاء عند سماع أصوات الحيوانات\n\nالدعاء عند صياح الديك : (( اللهم إني أسألك من فضلـــك )). ((إذا سمعتم صياح الديك[من الليل]،فاسألوا الله من فَضْلِهِ فإنها رأت ملكاً و إذا سمعتم نهيق الحمار،فتعوَّذوا بالله من الشيطان فإنها رأت شَيْطَاناً)). متفق عليه\n\nالدعاء عند صياح الديك و نهيق الحمار و نباح الكلاب: (( أعوذ بالله من الشيطان الرجيم ))\n\n((إذا سمعتم نُباحَ الكلاب و نهيق الحمير بالليل فتعوذوا بالله فإنهن يَرَيْنَ ما لا ترون)). صحيح(صحيح سنن أبي داود3/961)", "count": 1},
        {"text": "عند فعل الذنب أو ارتكاب المعصية\n\nكما أخبرنا رسول الله صلى الله عليه وسلم ((ما من عبد يذنب ذنباً فيتوضأ فيحسن الطهور،ثم يقوم فيصلي ركعتين ، ثم يستغفر الله لذلك الذنب إلاَّ غُفر له ))", "count": 1},
        {"text": "سيد الاستغفار\n\nاللهم أنت ربي لا إله إلا أنت ، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت، أبوئ لك بنعمتك على وأبوئ بذنبي ، فاغفر لي فانه لا يغفر الذنوب إلا أنت\n\nعن شداد بن أوس رضي الله عنه عن النبي صلى الله عليه وسلم قال ( سيد الاستغفار أن يقول العبد اللهم أنت ربي لا إله إلا أنت ، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت، أبوئ لك بنعمتك على وأبوئ بذنبي ، فاغفر لي فانه لا يغفر الذنوب إلا أنت ) من قالها في النهار موقناً بها فمات من يومه قبل أن يمسي فهو من أهل الجنة ومن قالها من الليل وهو موقناً بها فمات قبل أن يصبح فهو من أهل الجنة . أخرجه البخاري", "count": 1},
        {"text": "الدعاء إذا أحسست بوجع في جسدك\n\nضع يدك على الذي تألَّم من جسدك وقل: بسم اللَّه ،ثلاثاً ،وقل سبع مرات: أعوذُ باللَّهِ وقُدْرَتِهِ من شَرِّ مَا أَجِدُ واُحَاذِرُ", "count": 1},
        {"text": "مايقول ويفعل من أذنب ذنباً\n\nمامن عبد يذنب ذنباً فيحسـن الطهور ثم يقوم فيصلي ركعتين ، ثم يستغــفــر اللَّه إلا غفر له", "count": 1},
]

azkar_azima = [
    {"text": "سُبْحَانَ اللَّهِ\n\nيكتب له ألف حسنة أو يحط عنه ألف خطيئة", "count": 100},
        {"text": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ\n\nحُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ", "count": 100},
        {"text": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ\n\nتَمْلَآَنِ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ", "count": 100},
        {"text": "سُبْحَانَ اللَّهِ  العَظِيمِ وَبِحَمْدِهِ\n\nغرست له نخلة في الجنة (أى عدد)", "count": 100},
        {"text": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ\n\nثقيلتان في الميزان حبيبتان إلى الرحمن (أى عدد)", "count": 100},
        {"text": "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ\n\nكانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان", "count": 100},
        {"text": "لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ\n\nكنز من كنوز الجنة (أى عدد)", "count": 100},
        {"text": "الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ\n\nتملأ ميزان العبد بالحسنات", "count": 100},
        {"text": "الْلَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّد\n\nمن صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة", "count": 100},
        {"text": "أستغفر اللَّه\n\nلفعل الرسول صلى الله عليه وسلم", "count": 100},
        {"text": "سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَالْلَّهُ أَكْبَرُ\n\nأنهن أحب الكلام الى الله، ومكفرات للذنوب، وغرس الجنة، وجنة لقائلهن من النار، وأحب الى النبي عليه السلام مما طلعت عليه الشمس، والْبَاقِيَاتُ الْصَّالِحَات", "count": 100},
        {"text": "لَا إِلَهَ إِلَّا اللَّهُ\n\nأفضل الذكر لا إله إلاّ الله", "count": 100},
        {"text": "الْلَّهُ أَكْبَرُ \n\nمن قال الله أكبر كتبت له عشرون حسنة وحطت عنه عشرون سيئة. الله أكبر من كل شيء", "count": 100},
        {"text": "سُبْحَانَ اللَّهِ ، وَالْحَمْدُ لِلَّهِ ، وَلا إِلَهَ إِلا اللَّهُ ، وَاللَّهُ أَكْبَرُ ، اللَّهُمَّ اغْفِرْ لِي ، اللَّهُمَّ ارْحَمْنِي ، اللَّهُمَّ ارْزُقْنِي\n\nخير الدنيا والآخرة", "count": 100},
        {"text": "الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ\n\nقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ،لَقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا، أَيُّهُمْ يَرْفَعُهَا", "count": 100},
        {"text": "اللَّهُ أَكْبَرُ كَبِيرًا ، وَالْحَمْدُ لِلَّهِ كَثِيرًا ، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً\n\n قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ،عَجِبْتُ لَهَا ، فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ", "count": 100},
        {"text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ , اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ\n\nفي كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول صلى الله عليه وسلم (أى عدد)", "count": 100},
]

alsalat_ealaa_alnabii = [
    {
        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ", 
        "count": 100,
    },
]

ayat_alkursii = [
    {
        "text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\n\n                                                                                                اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ [ البقرة: 255]", 
        "count": 1,
    },
]

adeiat_llmtwffy = [
    {
        "text": "أدعية للمتوفى (ذكور)\n\nاللَّهُمَّ أبدله داراً خيراً من داره وأهلاً خيراً من أهله وأدخله الجنّة وأعذه من عذاب القبر ومن عذاب النّار\n\nاللَّهُمَّ عامله بما أنت أهله ولا تعامله بما هو أهله\n\nاللَّهُمَّ اجزه عن الإحسان إحساناً وعن الإساءة عفواً وغفراناً\n\nاللَّهُمَّ إن كان محسناً فزد من حسناته وإن كان مسيئاً فتجاوز عن سيّئاته\n\nاللَّهُمَّ أدخله الجنّة من غير مناقشة حساب ولا سابقة عذاب\n\nاللَّهُمَّ آنسه في وحدته وفي وحشته وفي غربته\n\nاللَّهُمَّ أنزله منزلاً مباركاً وأنت خير المنزلين\n\nاللَّهُمَّ أنزله منازل الصدّيقين والشّهداء والصّالحين وحسن أولئك رفيقاً\n\nاللَّهُمَّ اجعل قبره روضةً من رياض الجنّة ولا تجعله حفرةً من حفر النّار\n\nاللَّهُمَّ افسح له في قبره مدّ بصره وافرش قبره من فراش الجنّة\n\nاللَّهُمَّ أعذه من عذاب القبر وجفاف ِالأرض عن جنبيها\n\nاللَّهُمَّ املأ قبره بالرّضا والنّور والفسحة والسّرور\n\nاللَّهُمَّ إنّه في ذمّتك وحبل جوارك فقِهِِ فتنة القبر وعذاب النّار وأنت أهل الوفاء والحقّ فاغفر له وارحمه إنّك أنت الغفور الرّحيم\n\nاللَّهُمَّ إنّه عبدك وابن عبدك خرج من الدّنيا وسعتها ومحبوبها وأحبّائه فيها إلى ظلمة القبر وما هو لاقيه\n\nاللَّهُمَّ إنّه كان يشهد أنّك لا إله إلّا أنت وأنّ محمّداً عبدك ورسولك وأنت أعلم به\n\nاللَّهُمَّ إنّا نتوسّل بك إليك ونقسم بك عليك أن ترحمه ولا تعذّبه وأن تثبّته عند السؤال\n\nاللَّهُمَّ إنّه نَزَل بك وأنت خير منزولٍ به وأصبح فقيراً إلى رحمتك وأنت غنيٌّ عن عذابه\n\nاللَّهُمَّ آته برحمتك ورضاك وقهِ فتنة القبر وعذابه وآته برحمتك الأمن من عذابك حتّى تبعثه إلى جنّتك يا أرحم الرّاحمين\n\nاللَّهُمَّ انقله من مواطن الدّود وضيق اللحود إلى جنّات الخلود\n\nاللَّهُمَّ احمه تحت الأرض واستره يوم العرض ولا تخزه يوم يبعثون يوم لا ينفع مالٌ ولا بنون إلّا من أتى الله بقلبٍ سليم\n\nاللَّهُمَّ يمّن كتابه ويسّر حسابه وثقّل بالحسنات ميزانه وثبّت على الصّراط أقدامه وأسكنه في أعلى الجنّات بجوار حبيبك ومصطفاك صلّى الله عليه وسلّم\n\nاللَّهُمَّ أمّنه من فزع يوم القيامة ومن هول يوم القيامة واجعل نفسه آمنة مطمئنّة ولقّنه حجّته\n\nاللَّهُمَّ اجعله في بطن القبر مطمئنّاً وعند قيام الأشهاد آمن وبجود رضوانك واثق وإلى أعلى درجاتك سابق\n\nاللَّهُمَّ اجعل عن يمينه نوراً حتّى تبعثه آمناً مطمئنّاً في نورٍ من نورك\n\nاللَّهُمَّ انظر إليه نظرة رضا فإنّ من تنظر إليه نظرة رضا لا تعذّبه أبداً\n\nاللَّهُمَّ أسكنه فسيح الجنان واغفر له يا رحمن وارحمه يا رحيم وتجاوز عمّا تعلم يا عليم\n\nاللَّهُمَّ اعف عنه فإنّك القائل ويعفو عن كثير\n\nاللَّهُمَّ إنّه جاء ببابك وأناخ بجنابك فجد عليه بعفوك وإكرامك وجود إحسانك\n\nاللَّهُمَّ إنّ رحمتك وسعت كلّ شيء فارحمه رحمةً تطمئنّ بها نفسه وتقرّ بها عينه\n\nاللَّهُمَّ احشره مع المتّقين إلى الرّحمن وفداً\n\nاللَّهُمَّ احشره مع أصحاب اليمين واجعل تحيّته سلامٌ لك من أصحاب اليمين\n\nاللَّهُمَّ بشّره بقولك كلوا واشربوا هنيئاً بما أسلفتم في الأيّام الخالية\n\nاللَّهُمَّ اجعله من الّذين سعدوا في الجنّة خالدين فيها ما دامت السموات والأرض\n\nاللَّهُمَّ لا نزكّيه عليك ولكنّا نحسبه أنّه أمن وعمل صالحاً فاجعل له جنّتين ذواتي أفنان بحقّ قولك ولمن خاف مقام ربّه جنّتان\n\nاللَّهُمَّ شفع فيه نبيّنا ومصطفاك واحشره تحت لوائه واسقه من يده الشّريفة شربةً هنيئةً لا يظمأ بعدها أبداً\n\nاللَّهُمَّ اجعله في جنّة الخلد الَّتِي وُعِدَ الْمُتَّقُونَ كَانَتْ لَهُمْ جَزَاء وَمَصِيرًا لَهُمْ فِيهَا مَا يَشَاؤُونَ خَالِدِينَ كَانَ عَلَى رَبِّكَ وَعْدًا مَسْؤُولا\n\nاللَّهُمَّ إنّه صبر على البلاء فلم يجزع فامنحه درجة الصّابرين الّذين يوفون أجورهم بغير حساب فإنّك القائل إنّما يوفي الصّابرون أجرهم بغير حساب\n\nاللَّهُمَّ إنّه كان مصلّ لك فثبّته على الصّراط يوم تزل الأقدام\n\nاللَّهُمَّ إنّه كان صائماً لك فأدخله الجنّة من باب الريّان\n\nاللَّهُمَّ إنّه كان لكتابك تالٍ وسامع فشفّع فيه القرآن وارحمه من النّيران واجعله يا رحمن يرتقي في الجنّة إلى آخر آية قرأها أو سمعها وآخر حرفٍ تلاه\n\nاللَّهُمَّ ارزقه بكلّ حرفٍ في القرآن حلاوة وبكلّ كلمة كرامة وبكلّ اّية سعادة وبكلّ سورة سلامة وبكل جْزءٍ جزاء\n\nاللَّهُمَّ ارحمه فإنّه كان مسلماً واغفر له فإنّه كان مؤمناً وأدخله الجنّة فإنّه كان بنبيّك مصدّقاً وسامحه فإنّه كان لكتابك مرتّلاً\n\nاللَّهُمَّ اغفر لحيّنا وميّتنا وشاهدنا وغائبنا وصغيرنا وكبيرنا وذَكرنَا وأنثانا\n\nاللَّهُمَّ من أحييته منّا فأحيه على الإسلام ومن توفّيته منّا فتوفّه على الإيمان\n\nاللَّهُمَّ لا تحرمنا أجره ولا تضللنا بعده\n\nاللَّهُمَّ ارحمنا إذا أتانا اليقين وعرق منّا الجبين وكثر الأنين والحنين\n\nاللَّهُمَّ ارحمنا إذا يئس منّا الطبيب وبكى علينا الحبيب وتخلّى عنّا القريب والغريب وارتفع النّشيج والنّحيب\n\nاللَّهُمَّ ارحمنا إذا اشتدّت الكربات وتوالت الحسرات وأطبقت الرّوعات وفاضت العبرات وتكشّفت العورات وتعطّلت القوى والقدرات\n\nاللَّهُمَّ ارحمنا إذا حُمِلنا على الأعناقِ وبلغتِ التراقِ وقيل من راق وظنّ أنّه الفراق والتفَّتِ السَّاقُ بالسَّاقِ إليك يا ربَّنا يومئذٍ المساق\n\nاللَّهُمَّ ارحمنا إذا ورينا التّراب وغلقت القبور والأبواب وانفضّ الأهل والأحباب فإذا الوحشة والوحدة وهول الحساب\n\nاللَّهُمَّ ارحمنا إذا فارقنا النّعيم وانقطع النّسيم وقيل ما غرّك بربّك الكريم\n\nاللَّهُمَّ ارحمنا إذا أقمنا للسؤال وخاننا المقال ولم ينفع جاهٌ ولامال ولا عيال وقد حال الحال وليس إلّا فضل الكبير المتعال\n\nاللَّهُمَّ ارحمنا إذا نَسي اسمنا ودَرس رسمنا وأحاط بنا قسمنا ووسعنا\n\nاللَّهُمَّ ارحمنا إذا أهملنا فلم يزرنا زائر ولم يذكرنا ذاكر وما لنا من قوّة ولا ناصر فلا أمل إلّا في القاهر القادر الغافر يا من إذا وعد أوفى وإذا توعّد عفا وشفّع يا ربّ فينا حبيبنا المصطفى واجعلنا ممّن صفا ووفا وبالله اكتفى يا أرحم الرّاحمين يا حيّ يا قيّوم يا بديع السموات والأرض يا ذا الجلال والإكرام\n\nاللَّهُمَّ إنّه عبدك وابن عبدك وابن أمتك مات وهو يشهد لك بالوحدانيّة ولرسولك بالشّهادة فاغفر له إنّك أنت الغفّار\n\nاللَّهُمَّ لا تحرمنا أجره ولا تفتنّا بعده واغفر لنا وله واجمعنا معه في جنّات النّعيم يا ربّ العالمين\n\nاللَّهُمَّ أنزل على أهله الصّبر والسلوان وارضهم بقضائك\n\nاللَّهُمَّ ثبّتنا على القول الثّابت في الحياة الدّنيا وفي الآخرة ويوم يقوم الأشهاد\n\nاللَّهُمَّ صلّ وسلّم وبارك على سيّدنا محمّد وعلى اّله وصحبه وسلّم إلى يوم الدّين",
        "count": 1,

    },
    {
        "text": "أدعية للمتوفية (إناث)\n\nاللَّهُمَّ أبدلها داراً خيراً من دارها وأهلاً خيراً من أهلها وأدخلها الجنّة وأعذها من عذاب القبر ومن عذاب النّار\n\nاللَّهُمَّ عاملها بما أنت أهله ولا تعاملها بما هى أهله\n\nاللَّهُمَّ اجزها عن الإحسان إحساناً وعن الإساءة عفواً وغفراناً\n\nاللَّهُمَّ إن كانت محسنةً فزد من حسناتها وإن كان مسيئةً فتجاوز عن سيّئاتها\n\nاللَّهُمَّ أدخلها الجنّة من غير مناقشة حساب ولا سابقة عذاب\n\nاللَّهُمَّ اّنسها في وحدتها وفي وحشتها وفي غربتها\n\nاللَّهُمَّ أنزلها منزلاً مباركاً وأنت خير المنزلين\n\nاللَّهُمَّ أنزلها منازل الصدّيقين والشّهداء والصّالحين وحسن أولئك رفيقاً\n\nاللَّهُمَّ اجعل قبرها روضةً من رياض الجنّة ولا تجعله حفرةً من حفر النّار\n\nاللَّهُمَّ افسح لها في قبرها مدّ بصرها وافرش قبرها من فراش الجنّة\n\nاللَّهُمَّ أعذها من عذاب القبر وجفاف ِالأرض عن جنبيها\n\nاللَّهُمَّ املأ قبرها بالرّضا والنّور والفسحة والسّرور\n\nاللَّهُمَّ إنّها في ذمّتك وحبل جوارك فقِهِا فتنة القبر وعذاب النّار وأنت أهل الوفاء والحقّ فاغفر لهه وارحمها إنّك أنت الغفور الرّحيم\n\nاللَّهُمَّ إنها أمتك وبنت أمتك خرجت من الدّنيا وسعتها ومحبوبيها وأحبائها فيها إلى ظلمة القبر وما هى لاقته\n\nاللَّهُمَّ إنّها كانت تشهد أنّك لا إله إلّا أنت وأنّ محمّداً عبدك ورسولك وأنت أعلم به\n\nاللَّهُمَّ إنّا نتوسّل بك إليك ونقسم بك عليك أن ترحمها ولا تعذّبها وأن تثبّتها عند السؤال\n\nاللَّهُمَّ إنّها نَزَلت بك وأنت خير منزولٍ به وأصبحت فقيرةً إلى رحمتك وأنت غنيٌّ عن عذابها\n\nاللَّهُمَّ آتها برحمتك ورضاك وقهِا فتنة القبر وعذابه وآتها برحمتك الأمن من عذابك حتّى تبعثها إلى جنّتك يا أرحم الرّاحمين\n\nاللَّهُمَّ انقلها من مواطن الدّود وضيق اللحود إلى جنّات الخلود\n\nاللَّهُمَّ احمها تحت الأرض واسترها يوم العرض ولا تخزها يوم يبعثون يوم لا ينفع مالٌ ولا بنون إلّا من أتى الله بقلبٍ سليم\n\nاللَّهُمَّ يمّن كتابها ويسّر حسابها وثقّل بالحسنات ميزانها وثبّت على الصّراط أقدامها وأسكنها في أعلى الجنّات بجوار حبيبك ومصطفاك صلّى الله عليه وسلّم\n\nاللَّهُمَّ أمّنها من فزع يوم القيامة ومن هول يوم القيامة واجعل نفسها آمنة مطمئنّة ولقّنها حجّتها\n\nاللَّهُمَّ اجعلها في بطن القبر مطمئنّةً وعند قيام الإشهاد آمنةً وبجود رضوانك واثقةً وإلى أعلى درجاتك سابقةً\n\nاللَّهُمَّ اجعل عن يمينها نوراً حتّى تبعثها آمنةً مطمئنّةً في نورٍ من نورك\n\nاللَّهُمَّ انظر إليها نظرة رضا فإنّ من تنظر إليه نظرة رضا لا تعذّبه أبداً\n\nاللَّهُمَّ أسكنها فسيح الجنان واغفر لها يا رحمن وارحمها يا رحيم وتجاوز عمّا تعلم يا عليم\n\nاللَّهُمَّ اعف عنها فإنّك القائل ويعفو عن كثير\n\nاللَّهُمَّ إنّها جاءت ببابك وأناخت بجنابك فجد عليها بعفوك وإكرامك وجود إحسانك\n\nاللَّهُمَّ إنّ رحمتك وسعت كلّ شيء فارحمها رحمةً تطمئنّ بها نفسها وتقرّ بها عينها\n\nاللَّهُمَّ احشرها مع المتّقين إلى الرّحمن وفداً\n\nاللَّهُمَّ احشرها مع أصحاب اليمين واجعل تحيّتها سلامٌ لك من أصحاب اليمين\n\nاللَّهُمَّ بشّرها بقولك كلوا واشربوا هنيئاً بما أسلفتم في الأيّام الخالية\n\nاللَّهُمَّ اجعلها من الّذين سعدوا في الجنّة خالدين فيها ما دامت السموات والأرض\n\nاللَّهُمَّ لا نزكّيها عليك ولكنّا نحسبها أنّها أمنت وعملت صالحاً فاجعل لها جنّتين ذواتي أفنان بحقّ قولك ولمن خاف مقام ربّه جنّتان\n\nاللَّهُمَّ شفع فيها نبيّنا ومصطفاك واحشرها تحت لوائه واسقها من يده الشّريفة شربةً هنيئةً لا تظمأ بعدها أبداً\n\nاللَّهُمَّ اجعلها في جنّة الخلد الَّتِي وُعِدَ الْمُتَّقُونَ كَانَتْ لَهُمْ جَزَاء وَمَصِيرًا لَهُمْ فِيهَا مَا يَشَاؤُونَ خَالِدِينَ كَانَ عَلَى رَبِّكَ وَعْدًا مَسْؤُولا\n\nاللَّهُمَّ إنّها صبرت على البلاء فلم تجزع فامنحها درجة الصّابرين الّذين يوفون أجورهم بغير حساب فإنّك القائل إنّما يوفي الصّابرون أجرهم بغير حساب\n\nاللَّهُمَّ إنّها كانت تصلّى لك فثبّتها على الصّراط يوم تزل الأقدام\n\nاللَّهُمَّ إنّها كانت صائمةً لك فأدخلها الجنّة من باب الريّان\n\nاللَّهُمَّ إنّها كانت لكتابك تاليةً وسامعةً فشفّع فيها القرآن وارحمها من النّيران واجعلها يا رحمن ترتقي في الجنّة إلى آخر آية قرأتها أو سمعتها وآخر حرفٍ تلته\n\nاللَّهُمَّ ارزقها بكلّ حرفٍ في القرآن حلاوة وبكلّ كلمة كرامة وبكلّ اّية سعادة وبكلّ سورة سلامة وبكل جْزءٍ جزاء\n\nاللَّهُمَّ ارحمها فإنّها كان مسلمةً واغفر لها فإنّها كان مؤمنةً وأدخلها الجنّة فإنّها كانت بنبيّك مصدّقةً وسامحها فإنّها كانت لكتابك مرتّلةً\n\nاللَّهُمَّ اغفر لحيّنا وميّتنا وشاهدنا وغائبنا وصغيرنا وكبيرنا وذَكرنَا وأنثانا\n\nاللَّهُمَّ من أحييته منّا فأحيه على الإسلام ومن توفّيته منّا فتوفّه على الإيمان\n\nاللَّهُمَّ لا تحرمنا أجرها ولا تضللنا بعدها\n\nاللَّهُمَّ ارحمنا إذا أتانا اليقين وعرق منّا الجبين وكثر الأنين والحنين\n\nاللَّهُمَّ ارحمنا إذا يئس منّا الطبيب وبكى علينا الحبيب وتخلّى عنّا القريب والغريب وارتفع النّشيج والنّحيب\n\nاللَّهُمَّ ارحمنا إذا اشتدّت الكربات وتوالت الحسرات وأطبقت الرّوعات وفاضت العبرات وتكشّفت العورات وتعطّلت القوى والقدرات\n\nاللَّهُمَّ ارحمنا إذا حُمِلنا على الأعناقِ وبلغتِ التراقِ وقيل من راق وظنّ أنّه الفراق والتفَّتِ السَّاقُ بالسَّاقِ إليك يا ربَّنا يومئذٍ المساق\n\nاللَّهُمَّ ارحمنا إذا ورينا التّراب وغلقت القبور والأبواب وانفضّ الأهل والأحباب فإذا الوحشة والوحدة وهول الحساب\n\nاللَّهُمَّ ارحمنا إذا فارقنا النّعيم وانقطع النّسيم وقيل ما غرّك بربّك الكريم\n\nاللَّهُمَّ ارحمنا إذا أقمنا للسؤال وخاننا المقال ولم ينفع جاهٌ ولامال ولا عيال وقد حال الحال وليس إلّا فضل الكبير المتعال\n\nاللَّهُمَّ ارحمنا إذا نَسي اسمنا ودَرس رسمنا وأحاط بنا قسمنا ووسعنا\n\nاللَّهُمَّ ارحمنا إذا أهملنا فلم يزرنا زائر ولم يذكرنا ذاكر وما لنا من قوّة ولا ناصر فلا أمل إلّا في القاهر القادر الغافر يا من إذا وعد أوفى وإذا توعّد عفا وشفّع يا ربّ فينا حبيبنا المصطفى واجعلنا ممّن صفا ووفا وبالله اكتفى يا أرحم الرّاحمين يا حيّ يا قيّوم يا بديع السموات والأرض يا ذا الجلال والإكرام\n\nاللَّهُمَّ إنّها امتك بنت أمتك ماتت وهى تشهد لك بالوحدانيّة ولرسولك بالشّهادة فاغفر لها إنّك أنت الغفّار\n\nاللَّهُمَّ لا تحرمنا أجرها ولا تفتنّا بعدها واغفر لنا ولها واجمعنا معها في جنّات النّعيم يا ربّ العالمين\n\nاللَّهُمَّ أنزل على أهلها الصّبر والسلوان وارضهم بقضائك\n\nاللَّهُمَّ ثبّتنا على القول الثّابت في الحياة الدّنيا وفي الآخرة ويوم يقوم الأشهاد\n\nاللَّهُمَّ صلّ وسلّم وبارك على سيّدنا محمّد وعلى اّله وصحبه وسلّم إلى يوم الدّين",
        "count": 1
   , },
    {"text": "أدعية للميّت الطفل الصغير (ذكر أو أنثى)\n\nاللَّهُمَّ اجْعَلْهُ فَرَطَاً وَذُخْراً لِوَالِدَيْهِ، وشَفِيعاً مُجَاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِيْنَهُمَا، وأعْظِمْ بهِ أُجُورَهُمَا، وألْحِقْهُ بِصَالِحِ الـمُؤْمِنينَ، واجْعَلْهُ فِي كَفَالَةِ إِبْرَاهِيمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الجَحِيمِ، وأبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، اللَّهُمَّ اغْفِرْ لأسْلاَفِنَا، وَأَفْرَاطِنَا، وَمَنْ سَبَقَنا بالإيْمَانِ", "count": 1},
    {"text": "الدّعاء للميّت في صّلاة الجنازة\n\nاللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ ، وَأَكْرِمْ نُزُلَهُ ، وَوَسِّعْ مُدْخَلَهُ ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ ، وَنَقِّهِ مِنْ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنْ الدَّنَسِ ، وَأَبْدِلْهُ دَارًا خَيْرًا مِنْ دَارِهِ ، وَأَهْلًا خَيْرًا مِنْ أَهْلِهِ ، وَزَوْجًا خَيْرًا مِنْ زَوْجِهِ ، وَأَدْخِلْهُ الْجَنَّةَ ، وَقِهِ فِتْنَةَ الْقَبْرِ وَعَذَابَ النَّارِ", "count": 1},
]

sadaqa_gariya = [
    {
        "text": "أدعية للمتوفى (ذكور)\n\nاللَّهُمَّ أبدله داراً خيراً من داره وأهلاً خيراً من أهله وأدخله الجنّة وأعذه من عذاب القبر ومن عذاب النّار\n\nاللَّهُمَّ عامله بما أنت أهله ولا تعامله بما هو أهله\n\nاللَّهُمَّ اجزه عن الإحسان إحساناً وعن الإساءة عفواً وغفراناً\n\nاللَّهُمَّ إن كان محسناً فزد من حسناته وإن كان مسيئاً فتجاوز عن سيّئاته\n\nاللَّهُمَّ أدخله الجنّة من غير مناقشة حساب ولا سابقة عذاب\n\nاللَّهُمَّ آنسه في وحدته وفي وحشته وفي غربته\n\nاللَّهُمَّ أنزله منزلاً مباركاً وأنت خير المنزلين\n\nاللَّهُمَّ أنزله منازل الصدّيقين والشّهداء والصّالحين وحسن أولئك رفيقاً\n\nاللَّهُمَّ اجعل قبره روضةً من رياض الجنّة ولا تجعله حفرةً من حفر النّار\n\nاللَّهُمَّ افسح له في قبره مدّ بصره وافرش قبره من فراش الجنّة\n\nاللَّهُمَّ أعذه من عذاب القبر وجفاف ِالأرض عن جنبيها\n\nاللَّهُمَّ املأ قبره بالرّضا والنّور والفسحة والسّرور\n\nاللَّهُمَّ إنّه في ذمّتك وحبل جوارك فقِهِِ فتنة القبر وعذاب النّار وأنت أهل الوفاء والحقّ فاغفر له وارحمه إنّك أنت الغفور الرّحيم\n\nاللَّهُمَّ إنّه عبدك وابن عبدك خرج من الدّنيا وسعتها ومحبوبها وأحبّائه فيها إلى ظلمة القبر وما هو لاقيه\n\nاللَّهُمَّ إنّه كان يشهد أنّك لا إله إلّا أنت وأنّ محمّداً عبدك ورسولك وأنت أعلم به\n\nاللَّهُمَّ إنّا نتوسّل بك إليك ونقسم بك عليك أن ترحمه ولا تعذّبه وأن تثبّته عند السؤال\n\nاللَّهُمَّ إنّه نَزَل بك وأنت خير منزولٍ به وأصبح فقيراً إلى رحمتك وأنت غنيٌّ عن عذابه\n\nاللَّهُمَّ آته برحمتك ورضاك وقهِ فتنة القبر وعذابه وآته برحمتك الأمن من عذابك حتّى تبعثه إلى جنّتك يا أرحم الرّاحمين\n\nاللَّهُمَّ انقله من مواطن الدّود وضيق اللحود إلى جنّات الخلود\n\nاللَّهُمَّ احمه تحت الأرض واستره يوم العرض ولا تخزه يوم يبعثون يوم لا ينفع مالٌ ولا بنون إلّا من أتى الله بقلبٍ سليم\n\nاللَّهُمَّ يمّن كتابه ويسّر حسابه وثقّل بالحسنات ميزانه وثبّت على الصّراط أقدامه وأسكنه في أعلى الجنّات بجوار حبيبك ومصطفاك صلّى الله عليه وسلّم\n\nاللَّهُمَّ أمّنه من فزع يوم القيامة ومن هول يوم القيامة واجعل نفسه آمنة مطمئنّة ولقّنه حجّته\n\nاللَّهُمَّ اجعله في بطن القبر مطمئنّاً وعند قيام الأشهاد آمن وبجود رضوانك واثق وإلى أعلى درجاتك سابق\n\nاللَّهُمَّ اجعل عن يمينه نوراً حتّى تبعثه آمناً مطمئنّاً في نورٍ من نورك\n\nاللَّهُمَّ انظر إليه نظرة رضا فإنّ من تنظر إليه نظرة رضا لا تعذّبه أبداً\n\nاللَّهُمَّ أسكنه فسيح الجنان واغفر له يا رحمن وارحمه يا رحيم وتجاوز عمّا تعلم يا عليم\n\nاللَّهُمَّ اعف عنه فإنّك القائل ويعفو عن كثير\n\nاللَّهُمَّ إنّه جاء ببابك وأناخ بجنابك فجد عليه بعفوك وإكرامك وجود إحسانك\n\nاللَّهُمَّ إنّ رحمتك وسعت كلّ شيء فارحمه رحمةً تطمئنّ بها نفسه وتقرّ بها عينه\n\nاللَّهُمَّ احشره مع المتّقين إلى الرّحمن وفداً\n\nاللَّهُمَّ احشره مع أصحاب اليمين واجعل تحيّته سلامٌ لك من أصحاب اليمين\n\nاللَّهُمَّ بشّره بقولك كلوا واشربوا هنيئاً بما أسلفتم في الأيّام الخالية\n\nاللَّهُمَّ اجعله من الّذين سعدوا في الجنّة خالدين فيها ما دامت السموات والأرض\n\nاللَّهُمَّ لا نزكّيه عليك ولكنّا نحسبه أنّه أمن وعمل صالحاً فاجعل له جنّتين ذواتي أفنان بحقّ قولك ولمن خاف مقام ربّه جنّتان\n\nاللَّهُمَّ شفع فيه نبيّنا ومصطفاك واحشره تحت لوائه واسقه من يده الشّريفة شربةً هنيئةً لا يظمأ بعدها أبداً\n\nاللَّهُمَّ اجعله في جنّة الخلد الَّتِي وُعِدَ الْمُتَّقُونَ كَانَتْ لَهُمْ جَزَاء وَمَصِيرًا لَهُمْ فِيهَا مَا يَشَاؤُونَ خَالِدِينَ كَانَ عَلَى رَبِّكَ وَعْدًا مَسْؤُولا\n\nاللَّهُمَّ إنّه صبر على البلاء فلم يجزع فامنحه درجة الصّابرين الّذين يوفون أجورهم بغير حساب فإنّك القائل إنّما يوفي الصّابرون أجرهم بغير حساب\n\nاللَّهُمَّ إنّه كان مصلّ لك فثبّته على الصّراط يوم تزل الأقدام\n\nاللَّهُمَّ إنّه كان صائماً لك فأدخله الجنّة من باب الريّان\n\nاللَّهُمَّ إنّه كان لكتابك تالٍ وسامع فشفّع فيه القرآن وارحمه من النّيران واجعله يا رحمن يرتقي في الجنّة إلى آخر آية قرأها أو سمعها وآخر حرفٍ تلاه\n\nاللَّهُمَّ ارزقه بكلّ حرفٍ في القرآن حلاوة وبكلّ كلمة كرامة وبكلّ اّية سعادة وبكلّ سورة سلامة وبكل جْزءٍ جزاء\n\nاللَّهُمَّ ارحمه فإنّه كان مسلماً واغفر له فإنّه كان مؤمناً وأدخله الجنّة فإنّه كان بنبيّك مصدّقاً وسامحه فإنّه كان لكتابك مرتّلاً\n\nاللَّهُمَّ اغفر لحيّنا وميّتنا وشاهدنا وغائبنا وصغيرنا وكبيرنا وذَكرنَا وأنثانا\n\nاللَّهُمَّ من أحييته منّا فأحيه على الإسلام ومن توفّيته منّا فتوفّه على الإيمان\n\nاللَّهُمَّ لا تحرمنا أجره ولا تضللنا بعده\n\nاللَّهُمَّ ارحمنا إذا أتانا اليقين وعرق منّا الجبين وكثر الأنين والحنين\n\nاللَّهُمَّ ارحمنا إذا يئس منّا الطبيب وبكى علينا الحبيب وتخلّى عنّا القريب والغريب وارتفع النّشيج والنّحيب\n\nاللَّهُمَّ ارحمنا إذا اشتدّت الكربات وتوالت الحسرات وأطبقت الرّوعات وفاضت العبرات وتكشّفت العورات وتعطّلت القوى والقدرات\n\nاللَّهُمَّ ارحمنا إذا حُمِلنا على الأعناقِ وبلغتِ التراقِ وقيل من راق وظنّ أنّه الفراق والتفَّتِ السَّاقُ بالسَّاقِ إليك يا ربَّنا يومئذٍ المساق\n\nاللَّهُمَّ ارحمنا إذا ورينا التّراب وغلقت القبور والأبواب وانفضّ الأهل والأحباب فإذا الوحشة والوحدة وهول الحساب\n\nاللَّهُمَّ ارحمنا إذا فارقنا النّعيم وانقطع النّسيم وقيل ما غرّك بربّك الكريم\n\nاللَّهُمَّ ارحمنا إذا أقمنا للسؤال وخاننا المقال ولم ينفع جاهٌ ولامال ولا عيال وقد حال الحال وليس إلّا فضل الكبير المتعال\n\nاللَّهُمَّ ارحمنا إذا نَسي اسمنا ودَرس رسمنا وأحاط بنا قسمنا ووسعنا\n\nاللَّهُمَّ ارحمنا إذا أهملنا فلم يزرنا زائر ولم يذكرنا ذاكر وما لنا من قوّة ولا ناصر فلا أمل إلّا في القاهر القادر الغافر يا من إذا وعد أوفى وإذا توعّد عفا وشفّع يا ربّ فينا حبيبنا المصطفى واجعلنا ممّن صفا ووفا وبالله اكتفى يا أرحم الرّاحمين يا حيّ يا قيّوم يا بديع السموات والأرض يا ذا الجلال والإكرام\n\nاللَّهُمَّ إنّه عبدك وابن عبدك وابن أمتك مات وهو يشهد لك بالوحدانيّة ولرسولك بالشّهادة فاغفر له إنّك أنت الغفّار\n\nاللَّهُمَّ لا تحرمنا أجره ولا تفتنّا بعده واغفر لنا وله واجمعنا معه في جنّات النّعيم يا ربّ العالمين\n\nاللَّهُمَّ أنزل على أهله الصّبر والسلوان وارضهم بقضائك\n\nاللَّهُمَّ ثبّتنا على القول الثّابت في الحياة الدّنيا وفي الآخرة ويوم يقوم الأشهاد\n\nاللَّهُمَّ صلّ وسلّم وبارك على سيّدنا محمّد وعلى اّله وصحبه وسلّم إلى يوم الدّين",
        "count": 1,
        "icon": "assets/icons/yaser.png.png"
    },
    {
        "text": "أدعية للمتوفية (إناث)\n\nاللَّهُمَّ أبدلها داراً خيراً من دارها وأهلاً خيراً من أهلها وأدخلها الجنّة وأعذها من عذاب القبر ومن عذاب النّار\n\nاللَّهُمَّ عاملها بما أنت أهله ولا تعاملها بما هى أهله\n\nاللَّهُمَّ اجزها عن الإحسان إحساناً وعن الإساءة عفواً وغفراناً\n\nاللَّهُمَّ إن كانت محسنةً فزد من حسناتها وإن كان مسيئةً فتجاوز عن سيّئاتها\n\nاللَّهُمَّ أدخلها الجنّة من غير مناقشة حساب ولا سابقة عذاب\n\nاللَّهُمَّ اّنسها في وحدتها وفي وحشتها وفي غربتها\n\nاللَّهُمَّ أنزلها منزلاً مباركاً وأنت خير المنزلين\n\nاللَّهُمَّ أنزلها منازل الصدّيقين والشّهداء والصّالحين وحسن أولئك رفيقاً\n\nاللَّهُمَّ اجعل قبرها روضةً من رياض الجنّة ولا تجعله حفرةً من حفر النّار\n\nاللَّهُمَّ افسح لها في قبرها مدّ بصرها وافرش قبرها من فراش الجنّة\n\nاللَّهُمَّ أعذها من عذاب القبر وجفاف ِالأرض عن جنبيها\n\nاللَّهُمَّ املأ قبرها بالرّضا والنّور والفسحة والسّرور\n\nاللَّهُمَّ إنّها في ذمّتك وحبل جوارك فقِهِا فتنة القبر وعذاب النّار وأنت أهل الوفاء والحقّ فاغفر لهه وارحمها إنّك أنت الغفور الرّحيم\n\nاللَّهُمَّ إنها أمتك وبنت أمتك خرجت من الدّنيا وسعتها ومحبوبيها وأحبائها فيها إلى ظلمة القبر وما هى لاقته\n\nاللَّهُمَّ إنّها كانت تشهد أنّك لا إله إلّا أنت وأنّ محمّداً عبدك ورسولك وأنت أعلم به\n\nاللَّهُمَّ إنّا نتوسّل بك إليك ونقسم بك عليك أن ترحمها ولا تعذّبها وأن تثبّتها عند السؤال\n\nاللَّهُمَّ إنّها نَزَلت بك وأنت خير منزولٍ به وأصبحت فقيرةً إلى رحمتك وأنت غنيٌّ عن عذابها\n\nاللَّهُمَّ آتها برحمتك ورضاك وقهِا فتنة القبر وعذابه وآتها برحمتك الأمن من عذابك حتّى تبعثها إلى جنّتك يا أرحم الرّاحمين\n\nاللَّهُمَّ انقلها من مواطن الدّود وضيق اللحود إلى جنّات الخلود\n\nاللَّهُمَّ احمها تحت الأرض واسترها يوم العرض ولا تخزها يوم يبعثون يوم لا ينفع مالٌ ولا بنون إلّا من أتى الله بقلبٍ سليم\n\nاللَّهُمَّ يمّن كتابها ويسّر حسابها وثقّل بالحسنات ميزانها وثبّت على الصّراط أقدامها وأسكنها في أعلى الجنّات بجوار حبيبك ومصطفاك صلّى الله عليه وسلّم\n\nاللَّهُمَّ أمّنها من فزع يوم القيامة ومن هول يوم القيامة واجعل نفسها آمنة مطمئنّة ولقّنها حجّتها\n\nاللَّهُمَّ اجعلها في بطن القبر مطمئنّةً وعند قيام الإشهاد آمنةً وبجود رضوانك واثقةً وإلى أعلى درجاتك سابقةً\n\nاللَّهُمَّ اجعل عن يمينها نوراً حتّى تبعثها آمنةً مطمئنّةً في نورٍ من نورك\n\nاللَّهُمَّ انظر إليها نظرة رضا فإنّ من تنظر إليه نظرة رضا لا تعذّبه أبداً\n\nاللَّهُمَّ أسكنها فسيح الجنان واغفر لها يا رحمن وارحمها يا رحيم وتجاوز عمّا تعلم يا عليم\n\nاللَّهُمَّ اعف عنها فإنّك القائل ويعفو عن كثير\n\nاللَّهُمَّ إنّها جاءت ببابك وأناخت بجنابك فجد عليها بعفوك وإكرامك وجود إحسانك\n\nاللَّهُمَّ إنّ رحمتك وسعت كلّ شيء فارحمها رحمةً تطمئنّ بها نفسها وتقرّ بها عينها\n\nاللَّهُمَّ احشرها مع المتّقين إلى الرّحمن وفداً\n\nاللَّهُمَّ احشرها مع أصحاب اليمين واجعل تحيّتها سلامٌ لك من أصحاب اليمين\n\nاللَّهُمَّ بشّرها بقولك كلوا واشربوا هنيئاً بما أسلفتم في الأيّام الخالية\n\nاللَّهُمَّ اجعلها من الّذين سعدوا في الجنّة خالدين فيها ما دامت السموات والأرض\n\nاللَّهُمَّ لا نزكّيها عليك ولكنّا نحسبها أنّها أمنت وعملت صالحاً فاجعل لها جنّتين ذواتي أفنان بحقّ قولك ولمن خاف مقام ربّه جنّتان\n\nاللَّهُمَّ شفع فيها نبيّنا ومصطفاك واحشرها تحت لوائه واسقها من يده الشّريفة شربةً هنيئةً لا تظمأ بعدها أبداً\n\nاللَّهُمَّ اجعلها في جنّة الخلد الَّتِي وُعِدَ الْمُتَّقُونَ كَانَتْ لَهُمْ جَزَاء وَمَصِيرًا لَهُمْ فِيهَا مَا يَشَاؤُونَ خَالِدِينَ كَانَ عَلَى رَبِّكَ وَعْدًا مَسْؤُولا\n\nاللَّهُمَّ إنّها صبرت على البلاء فلم تجزع فامنحها درجة الصّابرين الّذين يوفون أجورهم بغير حساب فإنّك القائل إنّما يوفي الصّابرون أجرهم بغير حساب\n\nاللَّهُمَّ إنّها كانت تصلّى لك فثبّتها على الصّراط يوم تزل الأقدام\n\nاللَّهُمَّ إنّها كانت صائمةً لك فأدخلها الجنّة من باب الريّان\n\nاللَّهُمَّ إنّها كانت لكتابك تاليةً وسامعةً فشفّع فيها القرآن وارحمها من النّيران واجعلها يا رحمن ترتقي في الجنّة إلى آخر آية قرأتها أو سمعتها وآخر حرفٍ تلته\n\nاللَّهُمَّ ارزقها بكلّ حرفٍ في القرآن حلاوة وبكلّ كلمة كرامة وبكلّ اّية سعادة وبكلّ سورة سلامة وبكل جْزءٍ جزاء\n\nاللَّهُمَّ ارحمها فإنّها كان مسلمةً واغفر لها فإنّها كان مؤمنةً وأدخلها الجنّة فإنّها كانت بنبيّك مصدّقةً وسامحها فإنّها كانت لكتابك مرتّلةً\n\nاللَّهُمَّ اغفر لحيّنا وميّتنا وشاهدنا وغائبنا وصغيرنا وكبيرنا وذَكرنَا وأنثانا\n\nاللَّهُمَّ من أحييته منّا فأحيه على الإسلام ومن توفّيته منّا فتوفّه على الإيمان\n\nاللَّهُمَّ لا تحرمنا أجرها ولا تضللنا بعدها\n\nاللَّهُمَّ ارحمنا إذا أتانا اليقين وعرق منّا الجبين وكثر الأنين والحنين\n\nاللَّهُمَّ ارحمنا إذا يئس منّا الطبيب وبكى علينا الحبيب وتخلّى عنّا القريب والغريب وارتفع النّشيج والنّحيب\n\nاللَّهُمَّ ارحمنا إذا اشتدّت الكربات وتوالت الحسرات وأطبقت الرّوعات وفاضت العبرات وتكشّفت العورات وتعطّلت القوى والقدرات\n\nاللَّهُمَّ ارحمنا إذا حُمِلنا على الأعناقِ وبلغتِ التراقِ وقيل من راق وظنّ أنّه الفراق والتفَّتِ السَّاقُ بالسَّاقِ إليك يا ربَّنا يومئذٍ المساق\n\nاللَّهُمَّ ارحمنا إذا ورينا التّراب وغلقت القبور والأبواب وانفضّ الأهل والأحباب فإذا الوحشة والوحدة وهول الحساب\n\nاللَّهُمَّ ارحمنا إذا فارقنا النّعيم وانقطع النّسيم وقيل ما غرّك بربّك الكريم\n\nاللَّهُمَّ ارحمنا إذا أقمنا للسؤال وخاننا المقال ولم ينفع جاهٌ ولامال ولا عيال وقد حال الحال وليس إلّا فضل الكبير المتعال\n\nاللَّهُمَّ ارحمنا إذا نَسي اسمنا ودَرس رسمنا وأحاط بنا قسمنا ووسعنا\n\nاللَّهُمَّ ارحمنا إذا أهملنا فلم يزرنا زائر ولم يذكرنا ذاكر وما لنا من قوّة ولا ناصر فلا أمل إلّا في القاهر القادر الغافر يا من إذا وعد أوفى وإذا توعّد عفا وشفّع يا ربّ فينا حبيبنا المصطفى واجعلنا ممّن صفا ووفا وبالله اكتفى يا أرحم الرّاحمين يا حيّ يا قيّوم يا بديع السموات والأرض يا ذا الجلال والإكرام\n\nاللَّهُمَّ إنّها امتك بنت أمتك ماتت وهى تشهد لك بالوحدانيّة ولرسولك بالشّهادة فاغفر لها إنّك أنت الغفّار\n\nاللَّهُمَّ لا تحرمنا أجرها ولا تفتنّا بعدها واغفر لنا ولها واجمعنا معها في جنّات النّعيم يا ربّ العالمين\n\nاللَّهُمَّ أنزل على أهلها الصّبر والسلوان وارضهم بقضائك\n\nاللَّهُمَّ ثبّتنا على القول الثّابت في الحياة الدّنيا وفي الآخرة ويوم يقوم الأشهاد\n\nاللَّهُمَّ صلّ وسلّم وبارك على سيّدنا محمّد وعلى اّله وصحبه وسلّم إلى يوم الدّين",
        "count": 1
   ,"icon":"assets/icons/sanaa.png.png" }
]

sleep = [
    {
        "text": "بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ، وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ، وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين", 
        "count": 1,
        "icon": "assets/icons/sleeping.png.png"
    },
    {
        "text": "اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها . اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة", 
        "count": 1,
        
    },
    {
        "text": "اللّهُـمَّ قِنـي عَذابَـكَ يَـوْمَ تَبْـعَثُ عِبـادَك", 
        "count": 3,
        
    },
    {
        "text": "بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا", 
        "count": 1,
        
    },
    {
        "text": "الـحَمْدُ للهِ الَّذي أَطْـعَمَنا وَسَقـانا، وَكَفـانا، وَآوانا، فَكَـمْ مِمَّـنْ لا كـافِيَ لَـهُ وَلا مُـؤْوي", 
        "count": 1,

    }, 
    {
        "text": "اللّهُـمَّ عالِـمَ الغَـيبِ وَالشّـهادةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كُـلِّ شَـيءٍ وَمَليـكَه، أَشْهـدُ أَنْ لا إِلـهَ إِلاّ أَنْت، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي، وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم ", 
        "count": 1,
        
    },
    {
        "text": "اللّهُـمَّ أَسْـلَمْتُ نَفْـسي إِلَـيْكَ، وَفَوَّضْـتُ أَمْـري إِلَـيْكَ، وَوَجَّـهْتُ وَجْـهي إِلَـيْكَ، وَأَلْـجَـاْتُ ظَهـري إِلَـيْكَ، رَغْبَـةً وَرَهْـبَةً إِلَـيْكَ، لا مَلْجَـأَ وَلا مَنْـجـا مِنْـكَ إِلاّ إِلَـيْكَ، آمَنْـتُ بِكِتـابِكَ الّـذي أَنْزَلْـتَ وَبِنَبِـيِّـكَ الّـذي أَرْسَلْـت", 
        "count": 1,
        
    },
    {
        "text": "سُبْحَانَ اللَّهِ", 
        "count": 33,
        
    },
    
    {
        "text":"الْحَمْدُ لِلَّهِ", 
        "count": 33,
        
    },
    {
        "text":"اللَّهُ أَكْبَرُ", 
        "count": 34,
        
    },

    {"text": "بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيم\n\n قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ", "count": 3},
    {"text": "بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيم\n\n قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ", "count": 3},
    {"text": "بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيم\n\n قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ", "count": 3},
    {"text": "بِسْمِ اللَّهِ الرَّحْمنِ الرَّحِيم\n\n آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ [ البقرة 285 : 286]\n\nمن قرأ آيتين من آخر سورة البقرة في ليلة كفتاه", "count": 1},
    {"text": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\n\n اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ [ البقرة: 255]\n\nمن قالها حين يصبح أجبر من الجن حتى يمسي ومن قالها حين يمسي أجير من الجن حتى يصبح", "count": 1,},

]

Nabawi_Mosque = [
    {
        "text": "اللَّهُمَّ أنَْتَ رَبيِّ لَا إلِهََ إلَِّا أنَتَ، خَلَقْتنَيِ وَأنََا عَبدُْكَ، وَأنََا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ\n\nرواه البخاري (6306) عن شداد بن أوس وقد وصف النبي هذا الدعاء بأنه سيد الاستغفار", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّك أَنْتَ الْغَفُورُ الرَّحِيمُ\n\nرواه البخاري (834) ومسلم (6869) عن أبي بكر", 
        "count": 1,
        
    },

    {
        "text": "رَبِّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي كُلِّهِ وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللَّهُمَّ اغْفِرْ لِي خَطَايَايَ وَعَمْدِي وَجَهْلِي وَهَزْلِي، وَكُلُّ ذَلِكَ عِنْدِي، اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\n\nرواه البخاري (6398) ومسلم (6901) عن أبي موسى", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ، وَجِلَّهُ، وَأَوَّلَهُ، وَآخِرَهُ، وَعَلَانِيَتَهُ، وَسِرَّهُ\n\nرواه مسلم (1084) عن أبي هريرة", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ وَالْعَجْزِ وَالْكَسَلِ وَالْجُبْنِ وَالْبُخْلِ وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ\n\nرواه البخاري (6369) عن أنس", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ إنِِّي أَعُوذُ بكَِ مِنَ الْبُخْلِ، وَأَعُوذُ بكَِ مِنَ الْجُبْنِ، وَأَعُوذُ بكَِ أَنْ أُرَدَّ إلَِى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ\n\nرواه البخاري (6365) عن سعد بن أبي وقاص", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ وَالْمَأْثَمِ وَالْمَغْرَمِ، وَمِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ، وَمِنْ شَرِّ فِتْنَةِ الْغِنَى، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْفَقْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، اللَّهُمَّ اغْسِلْ عَنِّي خَطَايَايَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ، وَنَقِّ قَلْبِي مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنَ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ\n\nرواه البخاري (6368) ومسلم (6871) عن عائشة", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ رَبَّ السَّمَوَاتِ وَرَبَّ الْأَرْضِ وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتهِِ، اللَّهُمَّ أَنْتَ الْأوََّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ\n\nرواه مسلم (6889) عن أبي هريرة", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ\n\nرواه مسلم (6895) عن عائشة", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ\n\nرواه مسلم (6903) عن أبي هريرة", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى\n\nرواه مسلم (6904) عن ابن مسعود", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَالْجُبْنِ وَالْبُخْلِ، وَالْهَرَمِ وَعَذَابِ الْقَبْرِ، اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلَاهَا، اللَّهُمَّ إنِِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، وَمِنْ قَلْبٍ لَا يَخْشَعُ، وَمِنْ نَفْسٍ لَا تَشْبَعُ، وَمِنْ دَعْوَةٍ لَا يُسْتَجَابُ لَهَا\n\nرواه مسلم (6906) عن زيد بن أرقم", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ، وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ، اللَّهُمَّ إِنِّي أَعُوذُ بِعِزَّتِكَ لَا إِلَهَ إِلَّا أَنْتَ أَنْ تُضِلَّنيِ، أَنْتَ الْحَيُّ الَّذِي لَا يَمُوتُ وَالْجِنُّ وَالْإِنْسُ يَمُوتُونَ\n\nرواه البخاري (7383) ومسلم (6899) عن ابن عباس", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ\n\nرواه مسلم (6943) عن ابن عمر", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ\n\nرواه مسلم (6750) عن عبد الله بن عمرو", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ رَبَّ جَبْرَائِيلَ وَمِيكَائِيلَ وَإِسْرَافِيلَ، فَاطِرَ السَّمَوَاتِ وَالأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ، اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ، إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ\n\nرواه مسلم (1811) عن عائشة", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ، لَا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ\n\nرواه مسلم (1090) عن عائشة", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ وَدَرَكِ الشَّقَاءِ وَسُوءِ الْقَضَاءِ وَشَمَاتَةِ الْأَعْدَاءِ\n\nرواه البخاري (6347) ومسلم (6877) عن أبي هريرة", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ اجْعَلْ لِي فِي قَلْبِي نُورًا، وَفِي لِسَانِي نُورًا، وَفِي سَمْعِي نُورًا، وَفِي بَصَرِي نُورًا، وَمِنْ فَوْقِي نُورًا، وَمِنْ تَحْتِي نُورًا، وَعَنْ يَمِينِي نُورًا، وَعَنْ شِمَالِي نُورًا، وَمِنْ بَيْنِ يَدَيَّ نُورًا، وَمِنْ خَلْفِي نُورًا، وَاجْعَلْ فِي نَفْسِي نُورًا، وَأَعْظِمْ لِي نُورًا\n\nرواه البخاري (6316) ومسلم (1797) عن ابن عباس", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَم،ْ وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِهِ عَبْدُكَ وَنَبِيُّكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْرًا\n\nرواه ابن ماجه (3846) بإسناد صحيح عن عائشة", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِي، اللَّهُمَّ وَأَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْفَقْرِ وَالْغِنَى، وَأَسْأَلُكَ نَعِيمًا لَا يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ، وَأَسْأَلُكَ الرِّضَاءَ بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الْإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ\n\nرواه النَّسائي (1305) بإسناد حسن عن عمار بن ياسر", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ العَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي، وَاحْفَظنْيِ مِنْ بيَنِْ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينيِ وَعَنْ شِمَاليِ وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي\n\nرواه أبو داود (5074) وغيره بإسناد صحيح عن ابن عمر", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ\n\nرواه الترمذي (3392) وغيره بإسناد صحيح عن أبي هريرة", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الثَّبَاتَ فِي الأَمْرِ، وَالْعَزِيمَةَ عَلَى الرُّشْدِ، وَأَسْأَلُكَ مُوجِبَاتِ رَحْمَتكَِ، وَعَزَائمَِ مَغْفِرَتكَِ، وَأسَْألَكَُ شُكْرَ نعِْمَتكَِ، وَحُسْنَ عِباَدَتكَِ، وَأسَْألَكَُ قَلْبًا سَلِيمًا، وَلِسَانًا صَادِقًا، وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا تَعْلَمُ، إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ\n\nرواه الطبراني في الكبير (7135) عن شداد بن أوس", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ\n\nرواه الترمذي (3563) بإسناد حسن عن علي", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إلَِهَ إلَِّا أَنْتَ، اللَّهُمَّ إنِِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إنِِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ\n\nرواه أبو داود (5090) بإسناد حسن عن أبي بكرة", 
        "count": 1,
        
    },

    {
        "text": "رَبِّ أَعِنِّي وَلَا تُعِنْ عَلَيَّ، وَانْصُرْنِي وَلَا تَنْصُرْ عَلَيَّ، وَامْكُرْ لِي وَل َاتَمْكُرْ عَلَيَّ، وَاهْدِنِي وَيَسِّرِ الْهُدَى لِي، وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ، رَبِّ اجْعَلْنِي لَكَ شَكَّارًا، لَكَ ذَكَّارًا، لَكَ رَهَّابًا، لَكَ مِطْوَاعًا، لَكَ مُخْبِتًا إِلَيْكَ أَوَّاهًا مُنِيبًا، رَبِّ تَقَبَّلْ تَوْبَتِي وَاغْسِلْ حَوْبَتِي وَأَجِبْ دَعْوَتِي وَثَبِّتْ حُجَّتِي وَسَدِّدْ لِسَانِي وَاهْدِ قَلْبِي وَاسْلُلْ سَخِيمَةَ صَدْرِي\n\nرواه الترمذي (3551) وغيره بإسناد صحيح عن ابن عباس", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ لَكَ الْحَمْدُ كُلُّهُ، اللَّهُمَّ لَا قَابِضَ لِمَا بَسَطْتَ، وَلَا بَاسِطَ لِمَا قَبَضْتَ، وَلَا هَادِيَ لِمَا أَضْلَلْت، وَلَا مُضِلَّ لِمَنْ هَدَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُقَرِّبَ لِمَا بَاعَدْتَ، وَلَا مُبَاعِدَ لِمَا قَرَّبْتَ، اللَّهُمَّ ابْسُطْ عَلَيْنَا مِنْ بَرَكَاتِكَ وَرَحْمَتِكَ وَفَضْلِكَ وَرِزْقِكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ الْمُقِيمَ الَّذِي لَا يَحُولُ وَلَا يَزُولُ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ يَوْمَ الْعَيْلَةِ، وَالْأَمْنَ يَوْمَ الْخَوْفِ، اللَّهُمَّ إنِِّي عَائذٌِ بكَِ مِنْ شَرِّ مَا أَعْطَيْتَنَا وَشَرِّ مَا مَنَعْتَ، اللَّهُمَّ حَبِّبْ إلَِيْنَا الْإِيمَانَ وَزَيِّنْهُ فيِ قُلُوبِنَا، وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ، اللَّهُمَّ تَوَفَّنَا مُسْلِمِينَ، وَأَحْيِنَا مُسْلِمِينَ، وَأَلْحِقْنَا بِالصَّالِحِينَ غَيْرَ خَزَايَا وَلَا مَفْتُونِينَ، اللَّهُمَّ قَاتِلْ الْكَفَرَةَ الَّذِينَ يُكَذِّبُونَ رُسُلَكَ، وَيَصُدُّونَ عَنْ سَبِيلِكَ، وَاجْعَلْ عَلَيْهِمْ رِجْزَكَ وَعَذَابَكَ، اللَّهُمَّ قَاتِلْ الْكَفَرَةَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَهَ الْحَقِّ\n\nرواه الإمام أحمد (15492) عن رفاعة الزرقي بإسناد صحيح", 
        "count": 1,
        
    },

    {
        "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللّٰهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ\n\nرواه البخاري (3370) ومسلم (908) عن كعب بن عُجرة", 
        "count": 1,
        
    },

]

# ========= فئات المساعدة ============
class AzkarHelper:
    @staticmethod
    def check_completion(azkar_list, azkar_type, page):
        if all(azkar["count"] == 0 for azkar in azkar_list):
            AzkarHelper.show_completion_message(azkar_type, page)

    @staticmethod
    def show_completion_message(azkar_type, page):
        page.views[-1].controls.clear()
    
        centered_content = Column(
            [
                Container(
                    content=Column(
                        [
                            Icon(name=Icons.CHECK_CIRCLE, size=50, color="green"),
                            Text("الحمد للَّه", size=22, color="white", weight="bold", text_align=TextAlign.CENTER),
                            Text(
                                f"لقد أتممت {azkar_type}\nتقبل الله طاعتكم إن شاء اللَّه",
                                size=18,
                                color="white",
                                text_align=TextAlign.CENTER
                            ),
                            ElevatedButton(
                                text="أظهر الشاشة الرئيسية",
                                bgcolor="ORANGE",
                                color="black",
                                on_click=lambda _: page.go("/")
                            ),
                            ElevatedButton(
                                text="شارك التطبيق لتعم الفائدة واكسب الأجر والثواب",
                                bgcolor="ORANGE",
                                color="black",
                                on_click=lambda _: print("تمت مشاركة التطبيق!")
                            )
                        ],
                        horizontal_alignment=CrossAxisAlignment.CENTER,
                        alignment=MainAxisAlignment.CENTER,
                        spacing=15
                    ),
                    padding=30,
                    width=400,
                    bgcolor="#342897",
                    border_radius=20,
                    alignment=alignment.center
                )
            ],
            alignment=MainAxisAlignment.CENTER,
            expand=True
        )
    
        page.views[-1].controls.append(centered_content)
        page.update()

    @staticmethod
    def decrement_count(e, azkar_list, azkar_type, page):
        if e.control.data["count"] > 0:
            e.control.data["count"] -= 1
            e.control.text = str(e.control.data["count"])

            if e.control.data["count"] == 0:
                e.control.bgcolor = "#3f8e9e"
            else:
                e.control.bgcolor = "blue"

            e.control.update()
            AzkarHelper.check_completion(azkar_list, azkar_type, page)
           
    @staticmethod
    def format_azkar_text(text):
        lines = text.split("\n\n")
        text_spans = []
        
        colors_rules = [
            {"keyword": "بِسْمِ اللَّهِ", "color": "#fc8bbc"},
            {"keyword": "اللَّهُ لَا إِلَهَ إِلَّا هُوَ", "color": "white"},
            {"keyword": "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ","color": "white"},
            {"keyword": "قُلْ أَعُوذُ", "color": "white"},
            {"keyword": "من قالها", "color": "#55d9d5"},
            {"keyword": "رَضيـتُ بِاللهِ", "color": "white"},
            {"keyword": "اللَّهُمَّ", "color": "white"},
            {"keyword": "لا إلهَ", "color": "white"},
            {"keyword": "اللّهُـمَّ ما أَصْبَـحَ", "color": "white"},
            {"keyword": "اللّهُـمَّ بِكَ", "color": "white"},
            {"keyword": "رَضيـتُ بِاللَّهِ رَبَّـاً", "color": "white"},
            {"keyword":"أسْتَغْفِرُ اللَّهَ وَأتُوبُ إلَيْهِ","color": "white"},
            {"keyword":"حُطَّتْ خَطَايَاهُ وَإِنْ", "color": "#55d9d5"},
            {"keyword":"سُبْحـانَ", "color": "white"},
            {"keyword":"بِسـمِ اللَّهِ الذي لا يَضُـرُّ مَعَ", "color": "white"},
            {"keyword":"أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ", "color": "white"},
            {"keyword":"من قالها", "color": "#55d9d5"},
            {"keyword":"لم يضره من اللَّهِ شيء","color": "#55d9d5"},
            {"keyword":"اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ", "color": "white"},
            {"keyword":"يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ", "color": "white"},
            {"keyword":"أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للَّهِ", "color": "white"},
            {"keyword":"اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ", "color": "white"},
            {"keyword":"اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد", "color": "white"},
            {"keyword":"أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للَّهِ", "color": "white"},
            {"keyword":"أسْتَغْفِرُ اللَّهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ", "color": "white"},
            {"keyword":"يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ", "color": "white"},
            {"keyword":"َا إلَه إلّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ", "color": "white"},
            {"keyword":"أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق", "color": "white"},
            {"keyword":"مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى", "color": "#55d9d5"},
            {"keyword":"كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان", "color": "#55d9d5"},
            {"keyword":"ذكر طيب", "color": "#55d9d5"},
            {"keyword":"من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة", "color": "#55d9d5"},
            {"keyword":"آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ", "color": "white"},
            {"keyword":"اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك", "color": "white"},
            {"keyword":"أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ", "color": "white"},
            {"keyword":"لم يضره من الله شيء", "color": "#55d9d5"},
            {"keyword":"من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه", "color": "#55d9d5"},
            {"keyword":"أَسْـتَغْفِرُ اللَّه، أَسْـتَغْفِرُ اللَّه، أَسْـتَغْفِرُ اللَّه", "color": "white"},
            {"keyword":"اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ، وَعَمَـلاً مُتَقَـبَّلاً", "color": "white"},
            {"keyword":"اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ", "color": "white"},
            {"keyword":"سُـبْحانَ اللَّهِ", "color": "white"},
            {"keyword":"الحَمْـدُ للَّه", "color": "white"},
            {"keyword":"اللَّهُ أكْـبَر", "color": "white"},
            {"keyword":"دعاء", "color": "#55d9d5"},
            {"keyword":"ثلاث", "color": "#55d9d5"},
            {"keyword":"عَشْر مَرّات بَعْدَ", "color": "#55d9d5"},
            {"keyword":"بَعْد السّلامِ", "color": "#55d9d5"},
            {"keyword":"بعد صلاة الصبح والمغرب", "color": "#55d9d5"},
            {"keyword":"اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ", "color": "white"},
            {"keyword":"سُبْحَانَ اللَّهِ", "color": "white"},
            {"keyword":"سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ", "color": "white"},
            {"keyword":"سُبْحَانَ اللَّهِ  العَظِيمِ وَبِحَمْدِهِ", "color": "white"},
            {"keyword":"سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ", "color": "white"},
            {"keyword":"لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ", "color": "white"},
            {"keyword":"لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ", "color": "white"},
            {"keyword":"الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ", "color": "white"},
            {"keyword":"الْلَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّد", "color": "white"},
            {"keyword":"أستغفر اللَّه", "color": "white"},
            {"keyword":"سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَالْلَّهُ أَكْبَرُ", "color": "white"},
            {"keyword":"لَا إِلَهَ إِلَّا اللَّهُ", "color": "white"},
            {"keyword":"الْلَّهُ أَكْبَرُ ", "color": "white"},
            {"keyword":"الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ", "color": "white"},
            {"keyword":"يكتب له ألف حسنة أو يحط عنه ألف خطيئة", "color": "#55d9d5"},
            {"keyword":"تَمْلَآَنِ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ", "color": "#55d9d5"},
            {"keyword":"غرست له نخلة في الجنة (أى عدد)", "color": "#55d9d5"},
            {"keyword":"ثقيلتان في الميزان حبيبتان إلى الرحمن (أى عدد)", "color": "#55d9d5"},
            {"keyword":"كنز من كنوز الجنة (أى عدد)", "color": "#55d9d5"},
            {"keyword":"تملأ ميزان العبد بالحسنات", "color": "#55d9d5"},
            {"keyword":"لفعل الرسول صلى الله عليه وسلم", "color": "#55d9d5"},
            {"keyword":"أنهن أحب الكلام الى الله، ومكفرات للذنوب، وغرس الجنة، وجنة لقائلهن من النار، وأحب الى النبي عليه السلام مما طلعت عليه الشمس، والْبَاقِيَاتُ الْصَّالِحَات", "color": "#55d9d5"},
            {"keyword":"أفضل الذكر لا إله إلاّ الله", "color": "#55d9d5"},
            {"keyword":"من قال الله أكبر كتبت له عشرون حسنة وحطت عنه عشرون سيئة. الله أكبر من كل شيء", "color": "#55d9d5"},
            {"keyword":"خير الدنيا والآخرة", "color": "#55d9d5"},
            {"keyword":"قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ،لَقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا، أَيُّهُمْ يَرْفَعُهَا", "color": "#55d9d5"},
            {"keyword":"قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ،عَجِبْتُ لَهَا ، فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ", "color": "#55d9d5"},
            {"keyword":"في كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول صلى الله عليه وسلم (أى عدد)", "color": "#55d9d5"},
            {"keyword":"دعـــاء النـــزول في مكــان", "color": "#55d9d5"},
            {"keyword":"دعـاء من استصعب عليه أمر", "color": "#55d9d5"},
            {"keyword":"دعـاء الخوف من الشــرك", "color": "#55d9d5"},
            {"keyword":"ما يقال في المجلس", "color": "#55d9d5"},
            {"keyword":"كفارة المجلس", "color": "#55d9d5"},
            {"keyword":"دعـاء الغـضـب", "color": "#55d9d5"},
            {"keyword":"ما يعوذ به الأولاد", "color": "#55d9d5"},
            {"keyword":"دعـاء صـلاة الاستخـارة", "color": "#55d9d5"},
            {"keyword":"دعـاء سجود التلاوة", "color": "#55d9d5"},
            {"keyword":"دعـــــاء الاستفــتــــاح", "color": "#55d9d5"},
            {"keyword":"عنــــد فعــــل الذنب أو ارتكاب المعصية", "color": "#55d9d5"},
            {"keyword":"سيد الاستغفار", "color": "#55d9d5"},
            {"keyword":"مايقول ويفعل من أذنب ذنباً", "color": "#55d9d5"},
            {"keyword":"ضع يدك على الذي تألَّم من جسدك وقل: بسم اللَّه ،ثلاثاً ،وقل سبع مرات: أعوذُ باللَّهِ وقُدْرَتِهِ من شَرِّ مَا أَجِدُ واُحَاذِرُ", "color": "white"},
            {"keyword":"أدعية للمتوفى (ذكور)", "color": "#55d9d5"},
            {"keyword":"أدعية للمتوفية (إناث)", "color": "#55d9d5"},
            {"keyword":"أدعية للميّت الطفل الصغير (ذكر أو أنثى)", "color": "#55d9d5"},
            {"keyword":"الدّعاء للميّت في صّلاة الجنازة", "color": "#55d9d5"},
            {"keyword":"رواه البخاري (834) ومسلم (6869) عن أبي بكر", "color": "#55d9d5"},
            {"keyword":"رواه البخاري", "color": "#55d9d5"},
            {"keyword":"رواه مسلم", "color": "#55d9d5"},
            {"keyword":"رواه ", "color": "#55d9d5"},
            {"keyword":"الدعاء", "color": "white"},
            {"keyword":"يشوص فاه بالسواك، اي  يدلكه بالسواك", "color": "#55d9d5"},
            {"keyword":"عَنْ وَجْهِهِ بِيَدِهِ", "color": "#55d9d5"},
            {"keyword":"لحديث", "color": "#55d9d5"},

        ]
        
        fallback_colors = ["white", "white", "white", "white", "white"]
        
        for line in lines:
            if not line.strip():
                continue
                
            line_color = None
            for rule in colors_rules:
                if rule["keyword"] in line:
                    line_color = rule["color"]
                    break
                    
            if not line_color:
                line_index = len(text_spans) % len(fallback_colors)
                line_color = fallback_colors[line_index]
            
            text_spans.append(
                TextSpan(
                    line + "\n\n",
                    style=TextStyle(
                        color=line_color,
                        size=current_font_size,
                        font_family=FONT_NAME,
                        weight=FontWeight.NORMAL
                    )
                )
            )
        
        return text_spans
    from typing import Callable

class SearchResultsPage:
    @staticmethod
    def create(page: Page, search_query: str):
        # البحث في جميع قوائم الأذكار
        all_azkar = [
            *azkar_sabah,
            *azkar_masaa,
            *azkar_baad_salah,
            *adeiat_wa_azkar_mutanawiea,
            *azkar_azima,
            *alsalat_ealaa_alnabii,
            *ayat_alkursii,
            *adeiat_llmtwffy
        ]
        
        # تصفية النتائج
        results = [
            azkar for azkar in all_azkar 
            if search_query.lower() in azkar["text"].lower()
        ]
        
        # إنشاء واجهة النتائج
        result_widgets = []
        for result in results:
            content = Column(
                [

                    
                    Container(
                        content=Text(
                            spans=AzkarHelper.format_azkar_text(result["text"]),
                            text_align="center"
                        ),
                        alignment=alignment.center,
                        width=400
                    ),
                    
                    ElevatedButton(
                        text=str(result["count"]),
                        bgcolor="blue",
                        color="white",
                        width=500,
                        height=95,
                        style=ButtonStyle(
                            shape=RoundedRectangleBorder(radius=15),
                            padding=20,
                        ),
                        on_click=lambda e, a=[result], t="نتائج البحث": AzkarHelper.decrement_count(e, a, t, page),
                        data=result,
                    )
                ],
                spacing=2,
                horizontal_alignment=CrossAxisAlignment.CENTER
            )
            
            result_widgets.append(
                Container(
                    content=content,
                    padding=15,
                    border_radius=10,
                    bgcolor="#122536",
                    alignment=alignment.center,
                    width=400,
                    margin=margin.only(top=10)
                )
            )

        return View(
            f"/search/{search_query}",
            [
                AppBar(
                    title=Text(f"نتائج البحث عن: {search_query}", size=17, color=Colors.WHITE, text_align=TextAlign.CENTER),
                    bgcolor=APP_BGCOLOR,
                    center_title=True,
                    leading=IconButton(
                        icon=Icons.ARROW_BACK_IOS if page.rtl else Icons.ARROW_FORWARD,
                            on_click=lambda _: page.go("/"),
                        ),
                    
                ),
                Column(
                    [
                        Text(f"تم العثور على {len(results)} نتيجة", color=Colors.WHITE),
                        *result_widgets
                    ],
                    scroll=ScrollMode.AUTO,
                    expand=True,
                    alignment=alignment.center,
                ),
            ],
            horizontal_alignment=CrossAxisAlignment.CENTER,
            bgcolor="#041a29"
        )

# ============ فئات الصفحات ============
class HomePage:
    @staticmethod
    def create(page):
        # قائمة بمسارات صور النصائح فقط
        tips_images = [
            "assets/aktibass/3.png.png",
            "assets/aktibass/2.png.png",
            "assets/aktibass/1.png.png",
            "assets/aktibass/5.png.png",
            "assets/aktibass/6.png.png",
            "assets/aktibass/7.png.png",
            "assets/aktibass/8.png.png",
            "assets/aktibass/10.png.png",
            "assets/aktibass/11.png.png",
            "assets/aktibass/12.png.png",
            # يمكنك إضافة المزيد من الصور هنا
        ]
        
        # اختيار صورة عشوائية عند كل فتح للتطبيق
        random_tip_image = random.choice(tips_images)
        # إنشاء متغير لحفظ قيمة البحث
        search_field = TextField(
            height=45,
            hint_text="ابحث في الأذكار...",
            filled=True,
            fill_color=Colors.with_opacity(0.2, Colors.WHITE),
            border_color=Colors.TRANSPARENT,
            text_style=TextStyle(color=Colors.WHITE, font_family=FONT_NAME, size=14),
            cursor_color=Colors.WHITE,
            border_radius=20,
            content_padding=padding.only(left=15, right=15, top=5, bottom=5),
            prefix_icon=Icons.SEARCH,
            on_submit=lambda e: page.go(f"/search/{e.control.value}")  # عند الضغط على Enter
        )
        
        # إنشاء شريط التطبيق العلوي المعدل
        app_bar = Container(
            height=230,  # زيادة الارتفاع لاستيعاب الصورة
            gradient=LinearGradient(
                begin=alignment.top_left,
                end=alignment.bottom_right,
                colors=["#0e416e", "#177bc2"]
            ),
            border_radius=border_radius.only(bottom_left=40, bottom_right=40),
            padding=padding.only(top=30, left=20, right=20, bottom=20),
            content=Column(
                controls=[
                    # صورة النصيحة العشوائية في المنتصف
                    Container(
                        Image(
                            src=random_tip_image,
                            width=350,  # عرض الصورة
                            height=130,  # ارتفاع الصورة
                            fit=ImageFit.CONTAIN,
                            border_radius=10,
                        ),
                        alignment=alignment.center,
                        margin=margin.only(bottom=10)
                    ),
                    
                    Container(
                        margin=margin.only(top=10),
                        content=search_field
                    )
                ],
                spacing=0
            )
        )  
        
        # إنشاء أزرار الخدمات الرئيسية
        buttons = [
            {"icon": CUSTOM_ICONS["morning"], "text": "أذكار الصباح", "route": "/azkar_sabah", "border_color": "#346D8A"},
            {"icon": CUSTOM_ICONS["night"], "text": "أذكار المساء", "route": "/azkar_masaa", "border_color": "#F52C7DFF"},
            {"icon": CUSTOM_ICONS["mosque"], "text": "أذكار بعد الصلاة", "route": "/azkar_baad_salah", "border_color": "#5656C5"},
            {"icon": CUSTOM_ICONS["sleep"], "text": "أذكار قبل النوم", "route": "/sleep", "border_color": "#0B353B"},
            {"icon": CUSTOM_ICONS["star"], "text": "أذكار عظيمة", "route": "/azkar_azima", "border_color": "#563943"},
            {"icon": CUSTOM_ICONS["book"], "text": "آية الكرسي", "route": "/ayat_alkursii", "border_color": "#1F3E25"},
            {"icon": CUSTOM_ICONS["prayer"], "text": "الصلاة على النبي", "route": "/alsalat_ealaa_alnabii", "border_color": "#3F8E4E"},
            {"icon": CUSTOM_ICONS["prayer_time"], "text": "مواقيت الصلاة", "route": "/prayer_times","border_color": "#5D35A7"},
            {"icon": CUSTOM_ICONS["qibla"], "text": "اتجاه القبلة", "route": "/qibla","border_color": "#1B4876"},
            {"icon": CUSTOM_ICONS["sunan"], "text": "سنن موقوتة", "route": "/timed_sunan","border_color": "#2E6051"},
            {"icon": CUSTOM_ICONS["untimed_sunan"], "text": "سنن غير موقوتة", "route": "/untimed_sunan","border_color": "#283C50"},
            {"icon": CUSTOM_ICONS["tasbih"], "text": "السبحة الإلكترونية", "route": "/electronic_tasbih","border_color":"#6E7E26"},
            {"icon": CUSTOM_ICONS["wudu"], "text": "تعليم الوضوء", "route": "/wudu_learning","border_color": "#2F8FAC"},
            {"icon": CUSTOM_ICONS["learn_prayer"], "text": "كيفية الصلاة", "route": "/learn_prayer", "border_color": "#297569"},
            {"icon": CUSTOM_ICONS["library"], "text": "المكتبة الإسلامية", "route": "/islamic_library", "border_color": "#484323"},
            {"icon": CUSTOM_ICONS["Nabawi"], "text": "أدعية نبوية", "route": "/Nabawi_Mosque", "border_color": "#206B31"},
            {"icon": CUSTOM_ICONS["moon"], "text": "أدعية للمتوفي", "route": "/adeiat_llmtwffy", "border_color": "#173A4D"},
            {"icon": CUSTOM_ICONS["dua"], "text": "أدعية متنوعة", "route": "/adeiat_wa_azkar_mutanawiea", "border_color": "#682E17"},
        ]

        services_grid = GridView(
            runs_count=3,
            max_extent=110,
            child_aspect_ratio=1,
            spacing=10,
            run_spacing=20,
            controls=[
                Container(
                    width=110,
                    height=110,
                    border_radius=15,
                    bgcolor=Colors.with_opacity(0.2, btn["border_color"]),  # خلفية شفافة بنسبة 20%
                    border=border.all(2, btn["border_color"]),  # إطار ملون
                    alignment=alignment.center,
                    content=Column(
                        horizontal_alignment=CrossAxisAlignment.CENTER,
                        controls=[
                            Image(
                                src=btn["icon"],
                                width=40,
                                height=70,
                                fit=ImageFit.CONTAIN,
                                
                            ),
                            Text(
                                btn["text"],
                                size=13,
                                weight=FontWeight.BOLD,
                                font_family=BUTTON_FONT,
                                color=btn["border_color"],  # لون النص كالإطار
                                text_align=TextAlign.CENTER
                            )
                        ],
                        spacing=-10
                    ),
                    on_click=lambda e, route=btn["route"]: page.go(route),
                    ink=True
                ) for btn in buttons
            ],
            expand=True,
        )
        # شريط التنقل السفلي المعدل
        bottom_nav = Container(
            height=60,
            bgcolor="#2066a3",
            border_radius=border_radius.only(top_left=20, top_right=20),
            content=Row(
                alignment=MainAxisAlignment.SPACE_AROUND,
                controls=[
                    # زر من نحن (الزر الأول)
                    IconButton(
                        content=Image(
                            src=CUSTOM_ICONS["info"],
                             width=30,
                             height=30,
                        ),
                        on_click=lambda e: page.go("/about"),
                        tooltip="من نحن",
                    ),
            
                        # زر المفضلة المعدل إلى زر القلب
                    IconButton(
                        content=Image(
                            src=CUSTOM_ICONS["kok"],
                             width=30,
                             height=30,
                        ),
                        on_click=lambda e: page.go("/sadaqa_gariya"),
                        tooltip="صدقة جارية",
                    ),
                    IconButton(
                        content=Image(
                            src=CUSTOM_ICONS["settings"],
                             width=30,
                             height=30,
                        ),
                        on_click=lambda e: page.go("/settings"),
                        tooltip="الإعدادات",
                    ),
            
                    # زر المشاركة الجديد بدلاً من الرئيسية
                    IconButton(
                        content=Image(
                            src=CUSTOM_ICONS["share"],
                             width=30,
                             height=30,
                        ),
                        on_click=lambda e: page.launch_url("https://example.com/share-app"),  # استبدل بالرابط الفعلي للتطبيق
                        tooltip="مشاركة التطبيق",
                    ),
                ]
            )
        )

        return View(
            "/",
            [
                Column(
                    controls=[
                        app_bar,
                        Container(
                            content=services_grid,
                            padding=padding.only(left=20, right=20, top=20),
                            expand=True,
                        ),
                        Container(height=35),  # مسافة بين المحتوى والشريط السفلي
                        bottom_nav
                    ],
                    spacing=-15,
                    expand=True,
                )
            ],
            padding=0,
            spacing=0,
            bgcolor="#f5f9ff"
        )

class AzkarPage:
    @staticmethod
    def create(azkar_list, title, route_name, page):
        # حاوية رئيسية مع تأثيرات انتقال سلسة
        main_container = Container(
            opacity=0,
            animate_opacity=300,
            expand=True,
            content=Column(
                scroll=ScrollMode.AUTO,
                expand=True,
                horizontal_alignment=CrossAxisAlignment.CENTER,
            ),
            alignment=alignment.center,
        )

        # دالة لتحميل المحتوى بعد ظهور الصفحة
        def load_content():
            azkar_widgets = []
            for azkar in azkar_list:
                content = Column(
                    [
                        Image(
                            src=azkar["icon"],
                            width=390,
                            height=230,
                            fit=ImageFit.CONTAIN,
                            gapless_playback=True,
                        ) if "icon" in azkar else Container(),
                    
                        Container(
                            content=Text(
                                spans=AzkarHelper.format_azkar_text(azkar["text"]),
                                text_align="center"
                            ),
                            alignment=alignment.center,
                            width=400
                        ),
                    
                        ElevatedButton(
                            text=str(azkar["count"]),
                            bgcolor="blue",
                            color="white",
                            width=500,
                            height=95,
                            style=ButtonStyle(
                                shape=RoundedRectangleBorder(radius=15),
                                padding=20,
                            ),
                            on_click=lambda e, a=azkar_list, t=title: AzkarHelper.decrement_count(e, a, t, page),
                            data=azkar,
                        )
                    ],
                    spacing=2,
                    horizontal_alignment=CrossAxisAlignment.CENTER
                )
                
                azkar_widgets.append(
                    Container(
                        content=content,
                        padding=15,
                        border_radius=10,
                        bgcolor="#122536",
                        alignment=alignment.center,
                        width=400,
                        margin=margin.only(top=10)
                    )
                )

            main_container.content.controls = azkar_widgets
            main_container.opacity = 1
            page.update()

        # دالة للعودة مع تأثير إخفاء
        def navigate_back(_):
            main_container.opacity = 0
            page.update()
            time.sleep(0.3)
            page.go("/")

        def handle_back(e):
            if Page.route == route_name:
                navigate_back()
                return True
            return False

        # الطريقة المضمونة (بدون تعارض مع أحداث الأزرار)
        Page.on_back = handle_back

        app_bar = AppBar(
            title=Text(title, size=17, color=Colors.WHITE, text_align=TextAlign.CENTER),
                    bgcolor=APP_BGCOLOR,
                    center_title=True,
                    leading=IconButton(
                        icon=Icons.ARROW_BACK_IOS if page.rtl else Icons.ARROW_FORWARD,
                    on_click=navigate_back,
                ),
            
        )

        view = View(
            route_name,
            [app_bar, main_container],
            horizontal_alignment=CrossAxisAlignment.CENTER,
            bgcolor="#041a29"
        )

        def delayed_load():
            time.sleep(0.1)
            load_content()

        threading.Thread(target=delayed_load, daemon=True).start()

        return view

class LearnPrayerPage:
    @staticmethod
    def create(page: Page):
        youtube_url = "https://youtu.be/QIi6YSJfPTw?si=tgHI7JBKPijVjzQW"
        youtube_thumbnail = "assets/icons/kayfyytelsalah.png"
        
        return View(
            "/learn_prayer",
            [
                AppBar(
                    title=Text("كيفية الصلاة", size=17, color=Colors.WHITE, text_align=TextAlign.CENTER),
                    bgcolor=APP_BGCOLOR,
                    center_title=True,
                    leading=IconButton(
                        icon=Icons.ARROW_BACK_IOS if page.rtl else Icons.ARROW_FORWARD,
                            on_click=lambda _: page.go("/"),
                        ),
                    
                ),
                Column(
                    controls=[
                        GestureDetector(
                            content=Container(
                                content=Stack(
                                    controls=[
                                        Image(
                                            src=youtube_thumbnail,
                                            width=380,
                                            height=220,
                                            fit=ImageFit.COVER,
                                            border_radius=15,
                                        ),
                                        Container(
                                            Icon(
                                                Icons.PLAY_CIRCLE_FILLED,
                                                color=Colors.WHITE,
                                                size=60,
                                            ),
                                            border_radius=50,
                                            padding=5,
                                            alignment=alignment.center,
                                        )
                                    ],
                                    width=380,
                                    height=220,
                                ),
                                alignment=alignment.center,
                            ),
                            on_tap=lambda _: page.launch_url(youtube_url),
                        ),
                        
                        Container(
                            content=Column(
                                controls=[
                                    Text("خطوات الصلاة الصحيحة :", size=20, color=Colors.GREEN_900, weight="bold", text_align=TextAlign.CENTER),
                                    Divider(height=10, color=Colors.TRANSPARENT),
                                    Text(
                                        "١. استقبال القبلة مع النية\n"
                                        "٢. تكبيرة الإحرام (الله أكبر)\n"
                                        "٣. قراءة الفاتحة وسورة قصيرة\n"
                                        "٤. الركوع مع التسبيح\n"
                                        "٥. السجود مع التسبيح\n"
                                        "٦. التشهد الأخير\n"
                                        "٧. التسليم يميناً ويساراً\n\n"
                                        " عن أبي هريرة ـ رضي الله عنه ـ قال: قال رسول الله صلى الله عليه وسلم: إذا فرغ أحدكم من التشهد الأخير فليتعوذ بالله من أربع: من عذاب جهنم، ومن عذاب القبر، ومن فتنة المحيا والممات ومن فتنة المسيح الدجال. والحديث صححه الألباني",
                                        size=18,
                                        color=Colors.BLACK,
                                        text_align=TextAlign.RIGHT,  # محاذاة النص لليمين

                                    ),
                                ],
                                spacing=5,
                                horizontal_alignment=CrossAxisAlignment.CENTER,
                            ),
                            padding=20,
                            bgcolor=Colors.with_opacity(0.3, Colors.BLUE_GREY),
                            border_radius=15,
                            margin=margin.symmetric(horizontal=20, vertical=10),
                        ),
                        
                        Container(
                            ElevatedButton(
                                "مشاهدة الشرح الكامل على YouTube",
                                icon=Icons.VIDEO_LIBRARY,
                                on_click=lambda _: page.launch_url(youtube_url),
                                style=ButtonStyle(
                                    bgcolor=Colors.RED,
                                    color=Colors.WHITE,
                                    padding={"left": 30, "right": 30, "top": 15, "bottom": 15},
                                ),
                                width=350,
                            ),
                            margin=margin.only(bottom=20),
                        )
                    ],
                    scroll=ScrollMode.AUTO,
                    expand=True,
                    horizontal_alignment=CrossAxisAlignment.CENTER,
                    spacing=0,
                )
            ],
            padding=padding.symmetric(horizontal=10),
            bgcolor="#d7d9db"
        )

class AboutPage:
    @staticmethod
    def create(page: Page):
        return View(
            "/about",
            [
                AppBar(
                    title=Text("من نحن", size=17, color=Colors.WHITE, text_align=TextAlign.CENTER),
                    bgcolor=APP_BGCOLOR,
                    center_title=True,
                    leading=IconButton(
                        icon=Icons.ARROW_BACK_IOS if page.rtl else Icons.ARROW_FORWARD,
                            on_click=lambda _: page.go("/"),
                        ),
                    
                ),
                Container(
                    content=Column(
                        [
                            Image(
                                src="assets/icons/icon.png.png",
                                width=150,
                                height=150,
                                fit=ImageFit.CONTAIN,
                                border_radius=75,
                            ),
                            Text(
                                "تطبيق القريب - أذكار المسلم",
                                size=22,
                                weight=FontWeight.BOLD,
                                color=Colors.BLACK,
                            ),
                            Divider(height=20, color=Colors.BLACK),
                            Container(
                                content=Text(
                                    "تطبيق القريب هو تطبيق مجاني يهدف إلى تسهيل الوصول إلى الأذكار والأدعية الإسلامية الصحيحة\n\n"
                                    "نسعى لتقديم محتوى إسلامي موثوق وسهل الاستخدام",
                                    size=16,
                                    color=Colors.BLACK,
                                    text_align=TextAlign.RIGHT,
                                ),
                                padding=20,
                                bgcolor=Colors.with_opacity(0.2, Colors.BLUE),
                                border_radius=15,
                                width=350,
                            ),
                            ElevatedButton(
                                "تواصل معنا",
                                color=Colors.WHITE,
                                icon=Icons.EMAIL,
                                on_click=lambda _: page.launch_url("mailto:mohammedahead.7000@gmail.com"),
                                style=ButtonStyle(
                                    bgcolor="#0D5F13",
                                    padding={"left": 30, "right": 30},
                                ),
                                width=200,
                            ),
                        ],
                        horizontal_alignment=CrossAxisAlignment.CENTER,
                        scroll=ScrollMode.AUTO,
                        expand=True,
                    ),
                    padding=20,
                    expand=True,
                ),
            ],
            bgcolor="#e7e9eb",
        )


class IslamicLibraryPage:
    @staticmethod
    def create(page: Page):
        # قائمة الكتب الإسلامية مع روابط مباشرة لملفات PDF
        islamic_books = [
            {
                "title": "رياض الصالحين",
                "author": "الإمام النووي",
                "cover": "assets/books/riyad.png.png",
                "pdf_url": "https://drive.google.com/file/d/1vfI14XUROUcgnpONPeNNNt2fEWcOSqtm/view?usp=sharing"
            },
            {
                "title": "الأربعون النووية",
                "author": "الإمام النووي",
                "cover": "assets/books/arbawoon.png.png",
                "pdf_url": "https://drive.google.com/file/d/1gJ8B9UJHqCdTrlTIYA1B2nyMqIpUoiAs/view?usp=sharing"
            },
            {
                "title": "فتح المجيد",
                "author": "عبد الرحمن بن حسن",
                "cover": "assets/books/tawhied.png.png",
                "pdf_url": "https://drive.google.com/file/d/1gnDU7Thv8zAjvEWNJPjufFKqsmtrNJwD/view?usp=sharing"
            },
            {
                "title": "زاد المعاد",
                "author": "ابن قيم الجوزية",
                "cover": "assets/books/zad elmaad.png.png",
                "pdf_url": "https://drive.google.com/file/d/1_Mm4Xxv1zoyNgCpliDuQSaz--NQpKwuo/view?usp=sharing"
            },
            {
                "title": "صحيح البخاري",
                "author": "الإمام البخاري",
                "cover": "assets/books/albukhari.png.png",
                "pdf_url": "https://drive.google.com/file/d/1hiktq2YoP3d2Ti2x8InaiIalnxIwgXUf/view?usp=sharing"
            },
            {
                "title": "صحيح مسلم",
                "author": "الإمام مسلم",
                "cover": "assets/books/elmuslim.png.png",
                "pdf_url": "https://drive.google.com/file/d/11YvKapBURDOIu2QGUd7m3dJyVHSVfCwI/view?usp=sharing"
            },
            {
                "title": "جدد حياتك",
                "author": "الشيخ الغزالي",
                "cover": "assets/books/gadidhayatk.png.png",
                "pdf_url": "https://drive.google.com/file/d/1n6wv7WobCI16OMv7sNVrH79dLV8H5ipA/view?usp=sharing"
            },
            {
                "title": "الصلاة في الإسلام",
                "author": "عبدالله سراج الدين",
                "cover": "assets/books/alsalahfyalislam.png.png",
                "pdf_url": "https://drive.google.com/file/d/1n5RJaW1w-r3mnVOC-G1ijSZ4SDKDWLTO/view?usp=sharing"
            },  
        ]

        # إنشاء واجهة المكتبة
        books_grid = GridView(
            runs_count=2,
            max_extent=180,
            child_aspect_ratio=0.7,
            spacing=15,
            run_spacing=15,
            controls=[
                Container(
                    content=Column(
                        [
                            Image(
                                src=book["cover"],
                                width=155,
                                height=125,
                                fit=ImageFit.COVER,
                                border_radius=10,
                            ),
                            Text(
                                book["title"],
                                size=14,
                                weight=FontWeight.BOLD,
                                text_align=TextAlign.CENTER,
                                color=Colors.BLACK,
                            ),
                            Text(
                                book["author"],
                                size=12,
                                text_align=TextAlign.CENTER,
                                color=Colors.BLACK,
                            ),
                            ElevatedButton(
                                "فتح الكتاب",
                                color=Colors.WHITE,
                                on_click=lambda e, url=book["pdf_url"]: page.launch_url(url),
                                width=100,
                                height=30,
                                style=ButtonStyle(
                                    padding={"left": 10, "right": 10},
                                    bgcolor="#458732",
                                ),
                            ),
                        ],
                        spacing=2,
                        horizontal_alignment=CrossAxisAlignment.CENTER,
                    ),
                    padding=10,
                    bgcolor="#AFC8D8",
                    border_radius=15,
                )
                for book in islamic_books
            ],
            expand=True,
        )

        return View(
            "/islamic_library",
            [
                AppBar(
                    title=Text("المكتبة الإسلامية", size=17, color=Colors.WHITE, text_align=TextAlign.CENTER),
                    bgcolor=APP_BGCOLOR,
                    center_title=True,
                    leading=IconButton(
                        icon=Icons.ARROW_BACK_IOS if page.rtl else Icons.ARROW_FORWARD,
                            on_click=lambda _: page.go("/"),
                        ),
                    
                ),
                Container(
                    content=Column(
                        [
                            Text(
                                "مكتبة الكتب الإسلامية",
                                size=20,
                                weight=FontWeight.BOLD,
                                color=Colors.BLACK,
                                text_align=TextAlign.CENTER
                            ),
                            Divider(height=10),
                            books_grid,
                        ],
                        scroll=ScrollMode.AUTO,
                    ),
                    padding=20,
                    expand=True,
                ),
            ],
            bgcolor="#d7dadd",
            horizontal_alignment=CrossAxisAlignment.CENTER,
        ) 

class ElectronicTasbihPage:
    def __init__(self, page: Page):
        self.page = page
        self.count = 0
        self.goal = 33  # الهدف الافتراضي
        self.create_view()

    def create_view(self):
        # عناصر الواجهة
        self.counter_text = Text(
            value="0",
            size=80,
            weight=FontWeight.BOLD,
            color=Colors.BLACK,
            text_align=TextAlign.CENTER
        )
        
        self.progress_text = Text(
            value="0%",
            size=24,
            color=Colors.GREEN,
            text_align=TextAlign.CENTER
        )
        
        # زر التسبيح الكبير في المنتصف
        increment_button = Container(
            content=ElevatedButton(
                content=Column(
                    [
                        Text("تسبيح", size=20,color=Colors.WHITE,)
                    ],
                    alignment=MainAxisAlignment.CENTER,
                    spacing=5
                ),
                on_click=self.increment_counter,
                width=150,
                height=150,
                style=ButtonStyle(
                    shape=CircleBorder(),
                    bgcolor={"": "#4CAF50", "hovered": "#388E3C"},
                    padding=20,
                    animation_duration=300
                )
            ),
            margin=margin.only(bottom=20)
        )
        
        # زر التصفير الصغير تحته
        reset_button = ElevatedButton(
            content=Row(
                [Icon(Icons.REFRESH, size=20,color=Colors.WHITE,), Text("تصفير",color=Colors.WHITE, size=14)],
                alignment=MainAxisAlignment.CENTER,
                spacing=5
            ),
            on_click=self.reset_counter,
            width=100,
            height=40,
            style=ButtonStyle(
                shape=RoundedRectangleBorder(radius=20),
                bgcolor={"": "#F44336", "hovered": "#D32F2F"},
                padding=10,
                animation_duration=300
            )
        )
        
        # إنشاء الواجهة الجديدة مع تعديل شريط التطبيق ليكون متسقًا مع باقي الصفحات
        self.view = View(
            route="/electronic_tasbih",
            controls=[
                AppBar(
                    title=Text("السبحة الإلكترونية", size=17, color=Colors.WHITE, text_align=TextAlign.CENTER),
                    bgcolor=APP_BGCOLOR,
                    center_title=True,
                    leading=IconButton(
                        icon=Icons.ARROW_BACK_IOS if Page.rtl else Icons.ARROW_FORWARD,
                            icon_color=Colors.WHITE,
                            on_click=lambda _: self.page.go("/"),
                        ),
                   
                ),
                Container(
                    content=Column(
                        controls=[
                            Container(height=30),
                            
                            # العداد
                            Container(
                                content=self.counter_text,
                                padding=20,
                                bgcolor=Colors.with_opacity(0.2, Colors.BLACK),
                                border_radius=50,
                                width=200,
                                height=200,
                                alignment=alignment.center,
                                border=border.all(2, Colors.BLACK),
                                margin=margin.only(bottom=30)
                            ),
                            
                            # زر التسبيح الكبير
                            increment_button,
                            
                            # زر التصفير الصغير
                            reset_button,
                            
                            Container(height=20),
                            
                            # نسبة الإنجاز
                            self.progress_text,
                            
                            # توجيهات للمستخدم
                            Container(
                                content=Column(
                                    [
                                        Text("اضغط على زر التسبيح الكبير", size=16, color=Colors.BLACK),
                                        Text("اضغط تصفير لبدء من جديد", size=14, color=Colors.BLACK)
                                    ],
                                    spacing=5,
                                    horizontal_alignment=CrossAxisAlignment.CENTER
                                ),
                                padding=10,
                                margin=margin.only(top=20)
                            )
                        ],
                        horizontal_alignment=CrossAxisAlignment.CENTER,
                        scroll=ScrollMode.AUTO,
                        expand=True
                    ),
                    padding=padding.only(bottom=30),
                    expand=True
                )
            ],
            bgcolor="#c4c9cc",
            horizontal_alignment=CrossAxisAlignment.CENTER
        )
    
    def increment_counter(self, e):
        self.count += 1
        self.update_display()
        
        # إشعار عند الوصول للهدف
        if self.count == self.goal:
            self.page.snack_bar = SnackBar(
                content=Text(f"تهانينا! لقد أكملت {self.goal} تسبيحة", text_align=TextAlign.CENTER),
                bgcolor=Colors.GREEN,
                duration=2000
            )
            self.page.snack_bar.open = True
    
    def reset_counter(self, e):
        self.count = 0
        self.update_display()
    
    def update_display(self):
        self.counter_text.value = str(self.count)
        
        # حساب النسبة المئوية للإنجاز
        if self.goal > 0:
            progress = min(self.count / self.goal, 1.0)
            self.progress_text.value = f"{int(progress * 100)}%"
        
        self.page.update()

class QiblaWebViewPage:
    def __init__(self, page: Page):
        self.page = page

    def open_qibla_finder(self, e=None):
        # استخدم page.launch_url بدلاً من webbrowser.open
        self.page.launch_url("https://qiblafind.net/ar/qibla-finder")

    def create_view(self):
        return View(
            "/qibla",
            [
                AppBar(
                    title=Text("اتجاه القبلة", size=17, color=Colors.WHITE, text_align=TextAlign.CENTER),
                    bgcolor=APP_BGCOLOR,
                    center_title=True,
                    leading=IconButton(
                        icon=Icons.ARROW_BACK_IOS if Page.rtl else Icons.ARROW_FORWARD,
                            icon_color=Colors.WHITE,
                            on_click=lambda _: self.page.go("/"),
                        ),
                    
                ),
                Container(
                    content=Column(
                        [
                            Container(height=20),
                            Image(
                                src="assets/icons/qibla.png.png",
                                width=250,
                                height=250,
                                fit=ImageFit.CONTAIN,
                            ),
                            Container(height=20),
                            ElevatedButton(
                                " qiblafind.net فتح أداة القبلة من موقع ",
                                icon=Icons.EXPLORE,
                                on_click=self.open_qibla_finder,
                                style=ButtonStyle(
                                    padding={"left": 30, "right": 30, "top": 15, "bottom": 15},
                                    bgcolor="#4CAF50",
                                    color=Colors.WHITE,
                                ),
                                width=300,
                                height=70,
                            ),
                            Container(
                                Text(
                                    "سيتم فتح أداة القبلة في متصفح الإنترنت",
                                    size=14,
                                    color=Colors.BLACK,
                                    text_align=TextAlign.CENTER
                                ),
                                padding=20,
                            )
                        ],
                        horizontal_alignment=CrossAxisAlignment.CENTER,
                        scroll=ScrollMode.AUTO,
                        expand=True,
                    ),
                    padding=20,
                    expand=True,
                )
            ],
            bgcolor="#d6d9db"
        )

class PrayerTimesPage:
    def __init__(self, page: Page):
        self.page = page
        self.timer = None
        self.countdown_text = Text("", size=16, color=Colors.BLACK, weight=FontWeight.BOLD)

    def create_view(self):
        loading_content = Column(
            [
                ProgressRing(width=50, height=50, color="white"),
                Text("جاري تحميل مواقيت الصلاة...", color="white", size=16)
            ],
            horizontal_alignment=CrossAxisAlignment.CENTER,
            alignment=MainAxisAlignment.CENTER
        )

        view = View(
            "/prayer_times",
            [
                AppBar(
                    title=Text("مواقيت الصلاة", size=17, color=Colors.WHITE, text_align=TextAlign.CENTER),
                    bgcolor="#242a57",
                    center_title=True,
                    leading=IconButton(
                        icon=Icons.ARROW_BACK_IOS if Page.rtl else Icons.ARROW_FORWARD,
                            icon_color=Colors.WHITE,
                            on_click=lambda _: self.page.go("/"),
                        ),
                    
                ),
                Container(
                    content=loading_content,
                    padding=10,
                    expand=True,
                    bgcolor="#e3e7eb"
                )
            ],
            padding=0,
            spacing=0
        )

        self.get_prayer_times(view)
        return view

    def is_online(self):
        try:
            socket.create_connection(("8.8.8.8", 53), timeout=3)
            return True
        except OSError:
            return False

    def load_cached_data(self):
        try:
            if os.path.exists("prayer_times_cache.json"):
                with open("prayer_times_cache.json", 'r', encoding='utf-8') as f:
                    return json.load(f)
        except Exception as e:
            print(f"خطأ في تحميل البيانات المحفوظة: {str(e)}")
        return None

    def save_cached_data(self, data):
        try:
            with open("prayer_times_cache.json", 'w', encoding='utf-8') as f:
                json.dump(data, f, ensure_ascii=False, indent=4)
        except Exception as e:
            print(f"خطأ في حفظ البيانات: {str(e)}")

    def format_prayer_time(self, time_str):
        try:
            time_obj = datetime.strptime(time_str, "%H:%M")
            return time_obj.strftime("%I:%M %p").replace("AM", "ص").replace("PM", "م")
        except:
            return time_str

    def get_precise_location(self):
        try:
            g = geocoder.ip('me')
            if g.ok:
                return {
                    'latitude': g.latlng[0],
                    'longitude': g.latlng[1],
                    'address': f"{g.city}, {g.country}" if g.city else g.country,
                    'method': 'GPS'
                }
            response = requests.get('https://ipinfo.io/json')
            if response.status_code == 200:
                data = response.json()
                loc = data.get('loc', '').split(',')
                if len(loc) == 2:
                    return {
                        'latitude': float(loc[0]),
                        'longitude': float(loc[1]),
                        'address': f"{data.get('city', '')}, {data.get('country', '')}",
                        'method': 'IP'
                    }
            return {
                'latitude': 24.7136,
                'longitude': 46.6753,
                'address': "الرياض, المملكة العربية السعودية",
                'method': 'افتراضي'
            }
        except Exception as e:
            print(f"خطأ في تحديد الموقع: {str(e)}")
            return {
                'latitude': 24.7136,
                'longitude': 46.6753,
                'address': "الرياض, المملكة العربية السعودية",
                'method': 'افتراضي'
            }

    def calculate_time_remaining(self, prayer_time_str, current_time):
        try:
            prayer_time = datetime.strptime(prayer_time_str, "%H:%M")
            current_time = datetime.strptime(current_time.strftime("%H:%M:%S"), "%H:%M:%S")
            today = datetime.now().date()
            prayer_datetime = datetime.combine(today, prayer_time.time())
            current_datetime = datetime.combine(today, current_time.time())
            if prayer_datetime < current_datetime:
                prayer_datetime += timedelta(days=1)
            time_diff = prayer_datetime - current_datetime
            hours, remainder = divmod(time_diff.seconds, 3600)
            minutes, seconds = divmod(remainder, 60)
            return hours, minutes, seconds
        except Exception as e:
            print(f"خطأ في حساب الوقت المتبقي: {str(e)}")
            return 0, 0, 0

    def get_next_prayer(self, timings, current_time):
        prayer_times = [
            ('الفجر', timings['Fajr']),
            ('الشروق', timings['Sunrise']),
            ('الظهر', timings['Dhuhr']),
            ('العصر', timings['Asr']),
            ('المغرب', timings['Maghrib']),
            ('العشاء', timings['Isha'])
        ]
        current_time_str = current_time.strftime("%H:%M")
        for i, (prayer_name, prayer_time) in enumerate(prayer_times):
            if current_time_str < prayer_time:
                return prayer_name, prayer_time, i
        return prayer_times[0][0], prayer_times[0][1], 0  # العودة إلى الفجر لليوم التالي

    def update_countdown(self, view, timings, location, date_info, hijri_day, hijri_month, hijri_year, is_cached, next_prayer_name, next_prayer_time, prayer_index):
        current_time = datetime.now()
        hours, minutes, seconds = self.calculate_time_remaining(next_prayer_time, current_time)
        
        if hours == 0 and minutes == 0 and seconds == 0:
            prayer_times_list = [
                ('الفجر', timings['Fajr']),
                ('الشروق', timings['Sunrise']),
                ('الظهر', timings['Dhuhr']),
                ('العصر', timings['Asr']),
                ('المغرب', timings['Maghrib']),
                ('العشاء', timings['Isha'])
            ]
            next_index = (prayer_index + 1) % len(prayer_times_list)
            next_prayer_name, next_prayer_time = prayer_times_list[next_index]
            prayer_index = next_index
            hours, minutes, seconds = self.calculate_time_remaining(next_prayer_time, current_time)

        # إضافة تأثير بصري: تغيير لون النص بالتناوب لإبراز تحرك الثواني
        color = Colors.BLUE_400 if seconds % 2 == 0 else Colors.BLACK 
        self.countdown_text.value = f"🕒 الوقت المتبقي لصلاة {next_prayer_name}: {hours:02d}:{minutes:02d}:{seconds:02d}"
        self.countdown_text.color = color

        prayer_times_widgets = [
            ListTile(
                leading=Text(self.format_prayer_time(timings['Fajr']), color=Colors.BLACK, size=18, weight=FontWeight.BOLD),
                title=Text("الفجر", color=Colors.BLACK, size=18,weight=FontWeight.BOLD, text_align=TextAlign.LEFT)
            ),
            ListTile(
                leading=Text(self.format_prayer_time(timings['Sunrise']), color=Colors.BLACK, size=18, weight=FontWeight.BOLD),
                title=Text("الشروق", color=Colors.BLACK, size=18,weight=FontWeight.BOLD, text_align=TextAlign.LEFT)
            ),
            ListTile(
                leading=Text(self.format_prayer_time(timings['Dhuhr']), color=Colors.BLACK, size=18, weight=FontWeight.BOLD),
                title=Text("الظهر", color=Colors.BLACK, size=18,weight=FontWeight.BOLD, text_align=TextAlign.LEFT)
            ),
            ListTile(
                leading=Text(self.format_prayer_time(timings['Asr']), color=Colors.BLACK, size=18, weight=FontWeight.BOLD),
                title=Text("العصر", color=Colors.BLACK, size=18,weight=FontWeight.BOLD, text_align=TextAlign.LEFT)
            ),
            ListTile(
                leading=Text(self.format_prayer_time(timings['Maghrib']), color=Colors.BLACK, size=18, weight=FontWeight.BOLD),
                title=Text("المغرب", color=Colors.BLACK, size=18,weight=FontWeight.BOLD, text_align=TextAlign.LEFT)
            ),
            ListTile(
                leading=Text(self.format_prayer_time(timings['Isha']), color=Colors.BLACK, size=18, weight=FontWeight.BOLD),
                title=Text("العشاء", color=Colors.BLACK, size=18,weight=FontWeight.BOLD, text_align=TextAlign.LEFT)
            )
        ]

        current_date = datetime.now().strftime("%d/%m/%Y")
        info_column = Column(
            [
                Text("مواقيت الصلاة اليومية", size=22, weight=FontWeight.BOLD, color=Colors.BLACK, text_align=TextAlign.CENTER),
                Divider(height=10, color=Colors.TRANSPARENT),
                Text(f"📍 الموقع: {location.get('address', 'غير معروف')}", size=16, color=Colors.BLACK),
                self.countdown_text,
                Text(f"📅 التاريخ الميلادي: {current_date}", size=16, color=Colors.BLACK),
                Text(f"🌙 التاريخ الهجري: {hijri_day} {hijri_month} {hijri_year}", size=16, color=Colors.BLACK),
                Text("البيانات من الذاكرة المحلية" if is_cached else "البيانات محدثة", size=14, 
                     color=Colors.YELLOW if is_cached else Colors.GREEN, text_align=TextAlign.CENTER),
                Divider(height=10, color=Colors.TRANSPARENT)
            ],
            spacing=8,
            horizontal_alignment=CrossAxisAlignment.CENTER
        )

        refresh_button = ElevatedButton(
            "تحديث المواقيت",
            icon=Icons.REFRESH,
            on_click=lambda e: self.refresh_data(view),
            color=Colors.WHITE,
            bgcolor=Colors.BLUE_700,
            width=200
        )

        content = Container(
            content=Column(
                [
                    info_column,
                    *prayer_times_widgets,
                    refresh_button
                ],
                spacing=15,
                scroll=ScrollMode.AUTO,
                expand=True
            ),
            padding=20,
            alignment=alignment.center,
            expand=True
        )

        view.controls[1].content = content
        self.page.update()

        # إعادة جدولة التحديث بعد ثانية
        if self.timer:
            self.timer.cancel()
        self.timer = Timer(1.0, lambda: self.update_countdown(view, timings, location, date_info, hijri_day, hijri_month, hijri_year, is_cached, next_prayer_name, next_prayer_time, prayer_index))
        self.timer.start()

    def get_prayer_times(self, view):
        try:
            cached_data = self.load_cached_data()
            is_cached = False

            if not self.is_online():
                if cached_data:
                    is_cached = True
                else:
                    view.controls[1].content = Column(
                        controls=[
                            Icon(Icons.WARNING, size=50, color=Colors.YELLOW),
                            Text("لا يوجد اتصال بالإنترنت ولا توجد بيانات محفوظة", 
                                 color=Colors.RED, size=18, text_align=TextAlign.CENTER),
                            Text("تأكد من اتصالك بالإنترنت لتحديث مواقيت الصلاة", 
                                 color=Colors.WHITE, size=14, text_align=TextAlign.CENTER),
                            ElevatedButton(
                                "إعادة المحاولة",
                                on_click=lambda e: self.refresh_data(view),
                                bgcolor=Colors.ORANGE,
                                width=150,
                                color=Colors.WHITE
                            )
                        ],
                        horizontal_alignment=CrossAxisAlignment.CENTER,
                        alignment=MainAxisAlignment.CENTER,
                        spacing=20
                    )
                    self.page.update()
                    return

            location = self.get_precise_location() if self.is_online() else cached_data.get('location', {
                'latitude': 24.7136,
                'longitude': 46.6753,
                'address': "الرياض, المملكة العربية السعودية",
                'method': 'افتراضي'
            })

            if self.is_online():
                date = datetime.now().strftime("%d-%m-%Y")
                params = {
                    "latitude": location['latitude'],
                    "longitude": location['longitude'],
                    "method": 5,
                    "tune": "0,0,0,0,0,0,0,0,0"
                }
                response = httpx.get(f"http://api.aladhan.com/v1/timings/{date}", params=params)
                data = response.json()
                
                if 'data' not in data:
                    raise Exception("لا توجد بيانات متاحة من الخادم")
                
                timings = data['data']['timings']
                date_info = data['data']['date']['readable']
                hijri_date = data['data']['date']['hijri']['date']
                hijri_day = data['data']['date']['hijri']['day']
                hijri_month = data['data']['date']['hijri']['month']['ar']
                hijri_year = data['data']['date']['hijri']['year']
                timezone_info = data['data']['meta'].get('timezone', 'غير معروف')
                calculation_method = data['data']['meta'].get('method', {}).get('name', 'غير معروف')
                qibla_direction = data['data']['meta'].get('qibla_direction', 'غير متاح')

                cache_data = {
                    'location': location,
                    'timings': timings,
                    'date_info': date_info,
                    'hijri_date': hijri_date,
                    'hijri_day': hijri_day,
                    'hijri_month': hijri_month,
                    'hijri_year': hijri_year,
                    'timezone': timezone_info,
                    'calculation_method': calculation_method,
                    'qibla_direction': qibla_direction
                }
                self.save_cached_data(cache_data)
            else:
                timings = cached_data['timings']
                date_info = cached_data['date_info']
                hijri_date = cached_data['hijri_date']
                hijri_day = cached_data['hijri_day']
                hijri_month = cached_data['hijri_month']
                hijri_year = cached_data['hijri_year']
                timezone_info = cached_data['timezone']
                calculation_method = cached_data['calculation_method']
                qibla_direction = cached_data['qibla_direction']

            next_prayer_name, next_prayer_time, prayer_index = self.get_next_prayer(timings, datetime.now())
            self.update_countdown(view, timings, location, date_info, hijri_day, hijri_month, hijri_year, is_cached, next_prayer_name, next_prayer_time, prayer_index)

        except Exception as e:
            print(f"Error: {str(e)}")
            cached_data = self.load_cached_data()
            if cached_data:
                timings = cached_data['timings']
                date_info = cached_data['date_info']
                hijri_date = cached_data['hijri_date']
                hijri_day = cached_data['hijri_day']
                hijri_month = cached_data['hijri_month']
                hijri_year = cached_data['hijri_year']
                location = cached_data['location']
                timezone_info = cached_data['timezone']
                calculation_method = cached_data['calculation_method']
                qibla_direction = cached_data['qibla_direction']

                next_prayer_name, next_prayer_time, prayer_index = self.get_next_prayer(timings, datetime.now())
                self.update_countdown(view, timings, location, date_info, hijri_day, hijri_month, hijri_year, True, next_prayer_name, next_prayer_time, prayer_index)
            else:
                view.controls[1].content = Column(
                    controls=[
                        Icon(Icons.ERROR_OUTLINE, size=50, color=Colors.RED),
                        Text("حدث خطأ في جلب مواقيت الصلاة", color=Colors.RED, size=18, text_align=TextAlign.CENTER),
                        Text("تأكد من اتصالك بالإنترنت وحاول مرة أخرى", color=Colors.WHITE, size=14, text_align=TextAlign.CENTER),
                        ElevatedButton(
                            "إعادة المحاولة",
                            on_click=lambda e: self.refresh_data(view),
                            bgcolor=Colors.ORANGE,
                            width=150,
                            color=Colors.WHITE
                        )
                    ],
                    horizontal_alignment=CrossAxisAlignment.CENTER,
                    alignment=MainAxisAlignment.CENTER,
                    spacing=20
                )
                self.page.update()

    def refresh_data(self, view):
        if self.timer:
            self.timer.cancel()
        view.controls[1].content = Column(
            [
                ProgressRing(width=50, height=50, color="black"),
                Text("جاري تحديث البيانات...", color="black", size=16)
            ],
            horizontal_alignment=CrossAxisAlignment.CENTER,
            alignment=MainAxisAlignment.CENTER
        )
        self.page.update()
        self.get_prayer_times(view)

    @staticmethod
    def create(page: Page):
        prayer_times_page = PrayerTimesPage(page)
        return prayer_times_page.create_view()

class SettingsPage:
    def __init__(self, page: Page):
        self.page = page
        self.sample_text = Text(
            value="بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ\nاللَّهُ لَا إِلَهَ إِلَّا هُوَ",
            size=current_font_size,
            font_family=FONT_NAME,
            color=Colors.BLACK
        )
        self.current_font_size_text = Text(
            value=f"حجم الخط الحالي: {current_font_size}",
            size=16,
            color=Colors.BLACK
        )

    def increase_font(self, e):
        global current_font_size
        if current_font_size < MAX_FONT_SIZE:
            current_font_size += 2
            self.sample_text.size = current_font_size
            self.current_font_size_text.value = f"حجم الخط الحالي: {current_font_size}"
            self.page.snack_bar = SnackBar(Text(f"تم زيادة حجم الخط إلى {current_font_size}"))
            self.page.snack_bar.open = True
            self.page.update()

    def decrease_font(self, e):
        global current_font_size
        if current_font_size > MIN_FONT_SIZE:
            current_font_size -= 2
            self.sample_text.size = current_font_size
            self.current_font_size_text.value = f"حجم الخط الحالي: {current_font_size}"
            self.page.snack_bar = SnackBar(Text(f"تم تصغير حجم الخط إلى {current_font_size}"))
            self.page.snack_bar.open = True
            self.page.update()

    def reset_font(self, e):
        global current_font_size
        current_font_size = DEFAULT_FONT_SIZE
        self.sample_text.size = current_font_size
        self.current_font_size_text.value = f"حجم الخط الحالي: {current_font_size}"
        self.page.snack_bar = SnackBar(Text(f"تم إعادة تعيين حجم الخط إلى الافتراضي"))
        self.page.snack_bar.open = True
        self.page.update()

    def create_view(self):
        return View(
            "/settings",
            [
                AppBar(
                    title=Text("الإعدادات", size=17, color=Colors.WHITE, text_align=TextAlign.CENTER),
                    bgcolor=APP_BGCOLOR,
                    center_title=True,
                    leading=IconButton(
                        icon=Icons.ARROW_BACK_IOS if Page.rtl else Icons.ARROW_FORWARD,
                            icon_color=Colors.WHITE,
                            on_click=lambda _: self.page.go("/"),
                        ),
                    
                ),
                Column(
                    [
                        Container(height=20),
                        Text("إعدادات الخط", size=20, weight=FontWeight.BOLD, color=Colors.BLACK),
                        Divider(height=20),
                        
                        Row(
                            [
                                ElevatedButton(
                                    "تكبير الخط",
                                    icon=Icons.ZOOM_IN,
                                    on_click=self.increase_font,
                                    bgcolor="#4CAF50",
                                    color="white"
                                ),
                                ElevatedButton(
                                    "تصغير الخط",
                                    icon=Icons.ZOOM_OUT,
                                    on_click=self.decrease_font,
                                    bgcolor="#FF9800",
                                    color="white"
                                ),
                                ElevatedButton(
                                    "إعادة تعيين",
                                    icon=Icons.RESTORE,
                                    on_click=self.reset_font,
                                    bgcolor="#265D7C",
                                    color="white"
                                )
                            ],
                            alignment=MainAxisAlignment.SPACE_EVENLY,
                            width=self.page.width
                        ),
                        
                        Container(height=30),
                        self.current_font_size_text,
                        
                        Container(height=40),
                        Text("عينة من الخط:", size=18, color=Colors.BLACK),
                        Container(
                            content=self.sample_text,
                            padding=20,
                            bgcolor="#a4b3c0",
                            border_radius=10,
                            width=400
                        )
                    ],
                    scroll=ScrollMode.AUTO,
                    expand=True,
                    horizontal_alignment=CrossAxisAlignment.CENTER,
                    spacing=10
                )
            ],
            bgcolor="#d2d5d8"
        )

    @staticmethod
    def create(page: Page):
        settings_page = SettingsPage(page)
        return settings_page.create_view()

class WuduLearningPage:
    @staticmethod
    def create(page: Page):
        # خطوات الوضوء مع الصور التوضيحية
        wudu_steps = [
            {
                "title": " النية والبسملة وغسل الكفين",
                "description": "غسل الكفين ثلاث مرات مع تخليل الأصابع",
                "image": "assets/icons/wodu.1.png"
            },
            {
                "title": "المضمضة والاستنشاق",
                "description": "المضمضة (إدخال الماء في الفم) والاستنشاق (جذب الماء بالأنف) ثلاث مرات",
                "image": "assets/icons/wodu.2.png"
            },
            {
                "title": "غسل الوجه",
                "description": "غسل الوجه ثلاث مرات من منابت شعر الرأس إلى الذقن",
                "image": "assets/icons/wodu.3.png"
            },
            {
                "title": "غسل اليدين",
                "description": "غسل اليدين إلى المرفقين ثلاث مرات (اليمنى ثم اليسرى)",
                "image": "assets/icons/wodu.4.png"
            },
            {
                "title": "مسح الرأس",
                "description": "مسح الرأس مرة واحدة  ",
                "image": "assets/icons/wodu.5.png"
            },
            {
                "title": "مسح الأذنين",
                "description": "مسح الأذنين مرة واحدة ",
                "image": "assets/icons/wodu.6.png"
            },        
            {
                "title": "غسل الرجلين",
                "description": "غسل الرجلين إلى الكعبين ثلاث مرات (اليمنى ثم اليسرى)",
                "image": "assets/icons/wodu.7.png"
            }
        ]

        # إنشاء قائمة بالخطوات مع الصور
        step_widgets = []
        for step in wudu_steps:
            step_widgets.append(
                Container(
                    content=Column(
                        [
                            # صورة الخطوة
                            Container(
                                Image(
                                    src=step["image"],
                                    width=450,
                                    height=240,
                                    fit=ImageFit.CONTAIN,
                                    border_radius=10,
                                ),
                                alignment=alignment.center,
                                padding=5,
                            ),
                            
                            # عنوان الخطوة
                            Text(
                                step["title"],
                                size=18,
                                color=Colors.GREEN_900,
                                weight=FontWeight.BOLD,
                                text_align=TextAlign.CENTER,
                            ),
                            
                            # وصف الخطوة
                            Text(
                                step["description"],
                                size=16,
                                color=Colors.BLACK,
                                text_align=TextAlign.CENTER,
                            ),
                            
                            Divider(color=Colors.BLUE, height=10),
                        ],
                        spacing=5,
                        horizontal_alignment=CrossAxisAlignment.CENTER,
                    ),
                    padding=10,
                    bgcolor=Colors.with_opacity(0.2, Colors.WHITE),
                    border_radius=15,
                    width=300,
                )
            )

        return View(
            "/wudu_learning",
            [
                AppBar(
                    title=Text("تعليم الوضوء", size=17, color=Colors.WHITE, text_align=TextAlign.CENTER),
                    bgcolor=APP_BGCOLOR,
                    center_title=True,
                    leading=IconButton(
                        icon=Icons.ARROW_BACK_IOS if page.rtl else Icons.ARROW_FORWARD,
                            icon_color=Colors.WHITE,
                            on_click=lambda _: page.go("/"),
                        ),
                    
                ),
                Column(
                    controls=[
                        # مقدمة عن الوضوء
                        Container(
                            content=Text(
                                "الوضوء شرط من شروط صحة الصلاة، وقد بينه النبي صلى الله عليه وسلم بأفعاله وأقواله",
                                size=18,
                                color=Colors.BLACK,
                                text_align=TextAlign.CENTER,
                            ),
                            padding=15,
                            bgcolor=Colors.with_opacity(0.3, Colors.WHITE),
                            border_radius=10,
                            margin=margin.only(bottom=10),
                        ),
                        
                        # خطوات الوضوء مع الصور
                        *step_widgets,
                        
                        # حديث عن فضل الوضوء
                        Container(
                            content=Column(
                                [
                                    Text(
                                        "عن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال:",
                                        size=16,
                                        color=Colors.BLACK,
                                        text_align=TextAlign.CENTER,
                                    ),
                                    Text(
                                        " إذا توضأ العبد المسلم فغسل وجهه خرج من وجهه كل خطيئة نظر إليها بعينيه مع الماء، فإذا غسل يديه خرج من يديه كل خطيئة بطشتها يداه مع الماء، فإذا غسل رجليه خرجت كل خطيئة مشتها رجلاه مع الماء، حتى يخرج نقياً من الذنوب",
                                        size=16,
                                        color=Colors.GREEN_900,
                                        text_align=TextAlign.CENTER,
                                        weight=FontWeight.BOLD,
                                    ),
                                    Text(
                                        "رواه مسلم",
                                        size=14,
                                        color=Colors.BLACK,
                                        text_align=TextAlign.CENTER,
                                    ),
                                ],
                                spacing=5,
                            ),
                            padding=15,
                            bgcolor=Colors.with_opacity(0.3, Colors.WHITE),
                            border_radius=10,
                            margin=margin.only(top=10),
                        ),
                        
                        # زر مشاهدة الفيديو التوضيحي
                        Container(
                            ElevatedButton(
                                "مشاهدة الشرح الكامل على YouTube",
                                icon=Icons.VIDEO_LIBRARY,
                                on_click=lambda _: page.launch_url("https://youtu.be/HMERx-0_Koo?si=m5sMHe9hfToz1znv"),
                                style=ButtonStyle(
                                    bgcolor=Colors.RED,
                                    color=Colors.WHITE,
                                    padding={"left": 30, "right": 30, "top": 15, "bottom": 15},
                                ),
                                width=350,
                            ),
                            margin=margin.only(top=30, bottom=30),
                        )
                    ],
                    scroll=ScrollMode.AUTO,
                    expand=True,
                    horizontal_alignment=CrossAxisAlignment.CENTER,
                    spacing=10,
                )
            ],
            padding=padding.symmetric(horizontal=10),
            bgcolor="#cfd2d4"
        )


class TimedSunanPage:
    @staticmethod
    def create(page):
        # تعريف الأزرار للسنن الموقوتة مع إضافة data لتخزين محتوى كل سنة
        sunan_buttons = [
            {"icon": CUSTOM_ICONS["1a"], "text": "قبل الفجر", "data": timed_sunan["before_fajr"], "border_color": BUTTON_GRADIENTS["1a"][0]},
            {"icon": CUSTOM_ICONS["2a"], "text": "سنة الفجر", "data": timed_sunan["fajr"], "border_color": BUTTON_GRADIENTS["2a"][0]},
            {"icon": CUSTOM_ICONS["3a"], "text": "الضحى", "data": timed_sunan["duha"], "border_color": BUTTON_GRADIENTS["3a"][0]},
            {"icon": CUSTOM_ICONS["4a"], "text": "الظهر", "data": timed_sunan["dhuhr"], "border_color": BUTTON_GRADIENTS["4a"][0]},
            {"icon": CUSTOM_ICONS["5a"], "text": "العصر", "data": timed_sunan["asr"], "border_color": BUTTON_GRADIENTS["5a"][0]},
            {"icon": CUSTOM_ICONS["6a"], "text": "المغرب", "data": timed_sunan["maghrib"], "border_color": BUTTON_GRADIENTS["6a"][0]},
            {"icon": CUSTOM_ICONS["7a"], "text": "العشاء", "data": timed_sunan["isha"], "border_color": BUTTON_GRADIENTS["7a"][0]},
            {"icon": CUSTOM_ICONS["8a"], "text": "يوم الجمعة", "data": timed_sunan["yawm_aljumuea"], "border_color": BUTTON_GRADIENTS["8a"][0]},
        ]

        # دالة لإنشاء صفحة السنة الموقوتة
        def create_sunan_view(sunan_data, title):
            controls = []
            for item in sunan_data:
                controls.append(
                    Container(
                        content=Column(
                            [
                                Text(
                                    item["text"],
                                    size=current_font_size,
                                    color=Colors.WHITE,
                                    text_align=TextAlign.CENTER,
                                    font_family=FONT_NAME,
                                ),
                            ],
                            spacing=5,
                            horizontal_alignment=CrossAxisAlignment.CENTER,
                        ),
                        padding=15,
                        border_radius=10,
                        bgcolor="#122536",
                        margin=margin.only(top=10),
                        width=400,
                        alignment=alignment.center,
                    )
                )
            
            # إصلاح زر العودة هنا
            def handle_back(_):
                # إزالة الصفحة الحالية من المكدس
                if len(page.views) > 1:
                    page.views.pop()
                page.update()
            
            return View(
                f"/{title.lower().replace(' ', '_')}",
                [
                    AppBar(
                        title=Text(title, size=20, color=Colors.WHITE),
                        bgcolor=APP_BGCOLOR,
                        center_title=True,
                        leading=IconButton(
                            icon=Icons.ARROW_BACK_IOS if page.rtl else Icons.ARROW_FORWARD_IOS,
                            icon_color=Colors.WHITE,
                            on_click=handle_back,  # استخدام الدالة المعدلة
                        ),
                    ),
                    Column(
                        controls,
                        scroll=ScrollMode.AUTO,
                        expand=True,
                        alignment=MainAxisAlignment.START,
                        horizontal_alignment=CrossAxisAlignment.CENTER,
                    )
                ],
                bgcolor="#041a29",
                horizontal_alignment=CrossAxisAlignment.CENTER,
            )

        # دالة للتعامل مع الضغط على الأزرار
        def handle_sunan_click(e, sunan_data, title):
            view = create_sunan_view(sunan_data, title)
            page.views.append(view)
            page.update()

        # إنشاء شبكة الأزرار
        sunan_grid = GridView(
            runs_count=3,
            max_extent=110,
            child_aspect_ratio=1,
            spacing=10,
            run_spacing=20,
            controls=[
                Container(
                    width=110,
                    height=110,
                    border_radius=15,
                    bgcolor=Colors.with_opacity(0.2, btn["border_color"]),
                    border=border.all(2, btn["border_color"]),
                    alignment=alignment.center,
                    content=Column(
                        horizontal_alignment=CrossAxisAlignment.CENTER,
                        controls=[
                            Image(
                                src=btn["icon"],
                                width=40,
                                height=70,
                                fit=ImageFit.CONTAIN,
                            ),
                            Text(
                                btn["text"],
                                size=13,
                                weight=FontWeight.BOLD,
                                font_family=BUTTON_FONT,
                                color=btn["border_color"],
                                text_align=TextAlign.CENTER
                            )
                        ],
                        spacing=-10
                    ),
                    on_click=lambda e, data=btn["data"], title=btn["text"]: handle_sunan_click(e, data, title),
                    ink=True
                ) for btn in sunan_buttons
            ],
            expand=True,
        )

        # إنشاء واجهة الصفحة الرئيسية للسنن
        return View(
            "/timed_sunan",
            [
                AppBar(
                    title=Text("السنن الموقوتة", size=20, color=Colors.WHITE),
                    bgcolor=APP_BGCOLOR,
                    center_title=True,
                    leading=IconButton(
                        icon=Icons.ARROW_BACK_IOS if page.rtl else Icons.ARROW_FORWARD,
                            on_click=lambda _: page.go("/"),
                        ),
                    
                ),
                Container(
                    content=Column(
                        [
                            Text("السنن الموقوتة هي التي تُؤدى في أوقات محددة", 
                                 size=18, 
                                 color="#4a6baf",
                                 weight=FontWeight.BOLD,
                                 text_align=TextAlign.CENTER),
                            sunan_grid
                        ],
                        spacing=20,
                        expand=True,
                        horizontal_alignment=CrossAxisAlignment.CENTER,
                    ),
                    padding=20,
                    expand=True,
                    bgcolor="#E9ECF0",
                    alignment=alignment.center,
                )
            ],
            bgcolor="#E9ECF0",
            horizontal_alignment=CrossAxisAlignment.CENTER,
        )

    @staticmethod
    def create_category_page(page, category_name, category_data):
        azkar_widgets = []
    
        for item in category_data:
            content = Column(
                [
                    Image(
                        src=item["icon"],
                        width=390,
                        height=230,
                       fit=ImageFit.CONTAIN,
                    ) if "icon" in item else Container(),
                
                    Container(
                        content=Text(
                            spans=AzkarHelper.format_azkar_text(item["text"]),
                            text_align="center"
                        ),
                        alignment=alignment.center,
                        width=400,
                        padding=15,
                    ),
                
                    # إزالة زر العد وإضافة التكرار كنص إذا كان موجوداً
                    Text(
                        f"عدد المرات: {item['count']}" if item["count"] > 1 else "",
                        size=16,
                        color="#55d9d5",
                        weight=FontWeight.BOLD,
                        text_align=TextAlign.CENTER
                    ) if "count" in item else Container()
                ],
                spacing=5,
                horizontal_alignment=CrossAxisAlignment.CENTER
            )
        
            azkar_widgets.append(
                Container(
                    content=content,
                    padding=15,
                    border_radius=10,
                    bgcolor="#122536",
                    alignment=alignment.center,
                    width=400,
                    margin=margin.only(top=10)
                )
            )

        return View(
            f"/sunan_{category_name}",
            [
                AppBar(
                    title=Text(f"سنن {category_name.replace('_', ' ')}", size=20, color=Colors.WHITE),
                    bgcolor=APP_BGCOLOR,
                    center_title=True,
                    leading=IconButton(
                        icon=Icons.ARROW_BACK if page.rtl else Icons.ARROW_FORWARD,
                        on_click=lambda _: page.go("/timed_sunan"),
                    ),
                ),
                Column(
                    azkar_widgets,
                    scroll=ScrollMode.AUTO,
                    expand=True,
                    alignment=MainAxisAlignment.CENTER,
                    horizontal_alignment=CrossAxisAlignment.CENTER
                ),
            ],
            bgcolor="#041a29"
        )
    








class UntimedSunanPage:
    @staticmethod
    def create(page):
        # تعريف الأزرار للسنن الموقوتة مع إضافة data لتخزين محتوى كل سنة
        sunan_buttons = [
            {"icon": CUSTOM_ICONS["1aa"], "text": "سنن الوضوء", "data": untimed_sunan["wodu"], "border_color": BUTTON_GRADIENTS["1aa"][0]},
            {"icon": CUSTOM_ICONS["2aa"], "text": "سنن الأذان", "data": untimed_sunan["azaan"], "border_color": BUTTON_GRADIENTS["2aa"][0]},
            {"icon": CUSTOM_ICONS["3aa"], "text": "سنن المسجد", "data": untimed_sunan["mazjed"], "border_color": BUTTON_GRADIENTS["3aa"][0]},
            {"icon": CUSTOM_ICONS["4aa"], "text": "سنن في الصلاة", "data": untimed_sunan["salah"], "border_color": BUTTON_GRADIENTS["4aa"][0]},
            {"icon": CUSTOM_ICONS["5aa"], "text": "سنن الطعام", "data": untimed_sunan["taam"], "border_color": BUTTON_GRADIENTS["5aa"][0]},
            {"icon": CUSTOM_ICONS["6aa"], "text": "سنن السلام ", "data": untimed_sunan["salam"], "border_color": BUTTON_GRADIENTS["6aa"][0]},
            {"icon": CUSTOM_ICONS["7aa"], "text": "سنن اللباس والزينة", "data": untimed_sunan["zeina"], "border_color": BUTTON_GRADIENTS["7aa"][0]},
            {"icon": CUSTOM_ICONS["8aa"], "text": "سنن العطاس", "data": untimed_sunan["alaetas"], "border_color": BUTTON_GRADIENTS["8aa"][0]},
            {"icon": CUSTOM_ICONS["9aa"], "text": "سنن التثاوب", "data": untimed_sunan["tsawob"], "border_color": BUTTON_GRADIENTS["9aa"][0]},
            {"icon": CUSTOM_ICONS["10aa"], "text": "سنن أخرى يومية", "data": untimed_sunan["yawmieya"], "border_color": BUTTON_GRADIENTS["10aa"][0]},
            {"icon": CUSTOM_ICONS["11aa"], "text": "سنن الدعاء", "data": untimed_sunan["duaa"], "border_color": BUTTON_GRADIENTS["11aa"][0]},
            {"icon": CUSTOM_ICONS["12aa"], "text": " سنن ذكر الله", "data": untimed_sunan["ziekr_allh"], "border_color": BUTTON_GRADIENTS["12aa"][0]},
        ]

        # دالة لإنشاء صفحة السنة الموقوتة
        def create_sunan_view(sunan_data, title):
            controls = []
            for item in sunan_data:
                controls.append(
                    Container(
                        content=Column(
                            [
                                Text(
                                    item["text"],
                                    size=current_font_size,
                                    color=Colors.WHITE,
                                    text_align=TextAlign.CENTER,
                                    font_family=FONT_NAME,
                                ),
                            ],
                            spacing=5,
                            horizontal_alignment=CrossAxisAlignment.CENTER,
                        ),
                        padding=15,
                        border_radius=10,
                        bgcolor="#122536",
                        margin=margin.only(top=10),
                        width=400,
                        alignment=alignment.center,
                    )
                )
            
            # إصلاح زر العودة هنا
            def handle_back(_):
                # إزالة الصفحة الحالية من المكدس
                if len(page.views) > 1:
                    page.views.pop()
                page.update()
            
            return View(
                f"/{title.lower().replace(' ', '_')}",
                [
                    AppBar(
                        title=Text(title, size=20, color=Colors.WHITE),
                        bgcolor=APP_BGCOLOR,
                        center_title=True,
                        leading=IconButton(
                            icon=Icons.ARROW_BACK_IOS if page.rtl else Icons.ARROW_FORWARD_IOS,
                            icon_color=Colors.WHITE,
                            on_click=handle_back,  # استخدام الدالة المعدلة
                        ),
                    ),
                    Column(
                        controls,
                        scroll=ScrollMode.AUTO,
                        expand=True,
                        alignment=MainAxisAlignment.START,
                        horizontal_alignment=CrossAxisAlignment.CENTER,
                    )
                ],
                bgcolor="#041a29",
                horizontal_alignment=CrossAxisAlignment.CENTER,
            )

        # دالة للتعامل مع الضغط على الأزرار
        def handle_sunan_click(e, sunan_data, title):
            view = create_sunan_view(sunan_data, title)
            page.views.append(view)
            page.update()

        # إنشاء شبكة الأزرار
        sunan_grid = GridView(
            runs_count=3,
            max_extent=110,
            child_aspect_ratio=1,
            spacing=10,
            run_spacing=20,
            controls=[
                Container(
                    width=110,
                    height=110,
                    border_radius=15,
                    bgcolor=Colors.with_opacity(0.2, btn["border_color"]),
                    border=border.all(2, btn["border_color"]),
                    alignment=alignment.center,
                    content=Column(
                        horizontal_alignment=CrossAxisAlignment.CENTER,
                        controls=[
                            Image(
                                src=btn["icon"],
                                width=40,
                                height=70,
                                fit=ImageFit.CONTAIN,
                            ),
                            Text(
                                btn["text"],
                                size=13,
                                weight=FontWeight.BOLD,
                                font_family=BUTTON_FONT,
                                color=btn["border_color"],
                                text_align=TextAlign.CENTER
                            )
                        ],
                        spacing=-10
                    ),
                    on_click=lambda e, data=btn["data"], title=btn["text"]: handle_sunan_click(e, data, title),
                    ink=True
                ) for btn in sunan_buttons
            ],
            expand=True,
        )

        # إنشاء واجهة الصفحة الرئيسية للسنن
        return View(
            "/untimed_sunan",
            [
                AppBar(
                    title=Text("السنن الغير موقوتة", size=20, color=Colors.WHITE),
                    bgcolor=APP_BGCOLOR,
                    center_title=True,
                    leading=IconButton(
                        icon=Icons.ARROW_BACK_IOS if page.rtl else Icons.ARROW_FORWARD,
                            on_click=lambda _: page.go("/"),
                        ),
                    
                ),
                Container(
                    content=Column(
                        [
                            Text("السنن الغير موقوتة هي النوافل التي لا يرتبط وقتها بوقت محدد", 
                                 size=18, 
                                 color="#4a6baf",
                                 weight=FontWeight.BOLD,
                                 text_align=TextAlign.CENTER),
                            sunan_grid
                        ],
                        spacing=20,
                        expand=True,
                        horizontal_alignment=CrossAxisAlignment.CENTER,
                    ),
                    padding=20,
                    expand=True,
                    bgcolor="#E9ECF0",
                    alignment=alignment.center,
                )
            ],
            bgcolor="#E9ECF0",
            horizontal_alignment=CrossAxisAlignment.CENTER,
        )

    @staticmethod
    def create_category_page(page, category_name, category_data):
        azkar_widgets = []
    
        for item in category_data:
            content = Column(
                [
                    Image(
                        src=item["icon"],
                        width=390,
                        height=230,
                       fit=ImageFit.CONTAIN,
                    ) if "icon" in item else Container(),
                
                    Container(
                        content=Text(
                            spans=AzkarHelper.format_azkar_text(item["text"]),
                            text_align="center"
                        ),
                        alignment=alignment.center,
                        width=400,
                        padding=15,
                    ),
                
                    # إزالة زر العد وإضافة التكرار كنص إذا كان موجوداً
                    Text(
                        f"عدد المرات: {item['count']}" if item["count"] > 1 else "",
                        size=16,
                        color="#55d9d5",
                        weight=FontWeight.BOLD,
                        text_align=TextAlign.CENTER
                    ) if "count" in item else Container()
                ],
                spacing=5,
                horizontal_alignment=CrossAxisAlignment.CENTER
            )
        
            azkar_widgets.append(
                Container(
                    content=content,
                    padding=15,
                    border_radius=10,
                    bgcolor="#122536",
                    alignment=alignment.center,
                    width=400,
                    margin=margin.only(top=10)
                )
            )

        return View(
            f"/sunan_{category_name}",
            [
                AppBar(
                    title=Text(f"سنن {category_name.replace('_', ' ')}", size=20, color=Colors.WHITE),
                    bgcolor=APP_BGCOLOR,
                    center_title=True,
                    leading=IconButton(
                        icon=Icons.ARROW_BACK if page.rtl else Icons.ARROW_FORWARD,
                        on_click=lambda _: page.go("/untimed_sunan"),
                    ),
                ),
                Column(
                    azkar_widgets,
                    scroll=ScrollMode.AUTO,
                    expand=True,
                    alignment=MainAxisAlignment.CENTER,
                    horizontal_alignment=CrossAxisAlignment.CENTER
                ),
            ],
            bgcolor="#041a29"
        )

def create(page):
    view = View(...)  # إنشاء العرض
    page.views.append(view)  # إضافة العرض إلى المكدس
    return view
# ============ الدالة الرئيسية ============


# تعريف قائمة لتتبع سجل التنقل
navigation_stack = []
def main(page: Page):
    # إعدادات الصفحة الأساسية
    page.title = APP_TITLE
    page.window_icon = APP_ICON
    page.window.width = APP_SIZE[0]
    page.window.height = APP_SIZE[1]
    page.window.top = APP_POSITION[1]
    page.window.left = APP_POSITION[0]
    page.bgcolor = "transparent"  # تغيير هذا السطر لجعل الخلفية شفافة
    page.window.resizable = False
    page.horizontal_alignment = "center"
    page.vertical_alignment = "center"
    page.scroll = 'auto'
    page.platform = "android"
    page.padding = padding.only(top=0)
    page.rtl = True  # للغة العربية (اتجاه من اليمين لليسار)
    page.on_keyboard_event = lambda e: handle_back_button(page) if e.key == "Escape" else None


    # إضافة الخطوط
    page.fonts = {
        FONT_NAME: FONT_FILE,
        BUTTON_FONT: FONT_FILE,
    }

    def route_change(e):
        print(f"الانتقال إلى: {e.route}, السجل قبل التحديث: {navigation_stack}")
        # تعطيل تأثير الانتقال
        page.transition = None
        
        # إضافة المسار الحالي إلى سجل التنقل (إذا لم يكن موجودًا بالفعل)
        if not navigation_stack or navigation_stack[-1] != e.route:
            navigation_stack.append(e.route)

        # تجنب تكرار تحميل نفس الصفحة
        if len(page.views) > 0 and page.views[-1].route == e.route:
            print("الصفحة موجودة بالفعل، لن يتم التحميل مرة أخرى")
            return

        # تحميل الصفحات بناءً على المسار
        if e.route == "/":
            page.views.clear()  # تنظيف كل الصفحات
            navigation_stack.clear()  # تنظيف السجل
            navigation_stack.append(e.route)
            page.views.append(HomePage.create(page))
        elif e.route == "/qibla":
            qibla_webview = QiblaWebViewPage(page)
            page.views.append(qibla_webview.create_view())
        elif e.route == "/about":
            page.views.append(AboutPage.create(page))
        elif e.route.startswith("/search/"):
            search_query = e.route.split("/search/")[1]
            page.views.append(SearchResultsPage.create(page, search_query))
        elif e.route == "/azkar_sabah":
            page.views.append(AzkarPage.create(azkar_sabah, "أذكار الصباح", "/azkar_sabah", page))
        elif e.route == "/azkar_masaa":
            page.views.append(AzkarPage.create(azkar_masaa, "أذكار المساء", "/azkar_masaa", page))
        elif e.route == "/azkar_baad_salah":
            page.views.append(AzkarPage.create(azkar_baad_salah, "أذكار بعد الصلاة", "/azkar_baad_salah", page))
        elif e.route == "/adeiat_wa_azkar_mutanawiea":
            page.views.append(AzkarPage.create(adeiat_wa_azkar_mutanawiea, "أدعية وأذكار متنوعة", "/adeiat_wa_azkar_mutanawiea", page))
        elif e.route == "/azkar_azima":
            page.views.append(AzkarPage.create(azkar_azima, "أذكار عظيمة", "/azkar_azima", page))
        elif e.route == "/alsalat_ealaa_alnabii":
            page.views.append(AzkarPage.create(alsalat_ealaa_alnabii, "الصلاة على النبي", "/alsalat_ealaa_alnabii", page))
        elif e.route == "/ayat_alkursii":
            page.views.append(AzkarPage.create(ayat_alkursii, "آية الكرسي", "/ayat_alkursii", page))
        elif e.route == "/adeiat_llmtwffy":
            page.views.append(AzkarPage.create(adeiat_llmtwffy, "أدعية للمتوفي", "/adeiat_llmtwffy", page))
        elif e.route == "/islamic_library":
            page.views.append(IslamicLibraryPage.create(page))
        elif e.route == "/learn_prayer":
            page.views.append(LearnPrayerPage.create(page))
        elif e.route == "/electronic_tasbih":
            page.views.append(ElectronicTasbihPage(page).view)
        elif e.route == "/sadaqa_gariya":
            page.views.append(AzkarPage.create(sadaqa_gariya, "صدقة جارية", "/sadaqa_gariya", page))
        elif e.route == "/sleep":
            page.views.append(AzkarPage.create(sleep, "أذكار قبل النوم", "/sleep", page))
        elif e.route == "/Nabawi_Mosque":
            page.views.append(AzkarPage.create(Nabawi_Mosque, "أدعية النبي صلى الله عليه وسلم", "/Nabawi_Mosque", page))
        elif e.route == "/prayer_times":
            page.views.append(PrayerTimesPage.create(page))
        elif e.route == "/settings":
            page.views.append(SettingsPage.create(page))
        elif e.route == "/wudu_learning":
            page.views.append(WuduLearningPage.create(page))
        elif page.route == "/timed_sunan":
            page.views.append(TimedSunanPage.create(page))
        elif page.route == "/untimed_sunan":
            page.views.append(UntimedSunanPage.create(page))

        print(f"تم تحميل الصفحة: {e.route}, السجل بعد التحديث: {navigation_stack}")
        page.update()

    page.on_route_change = route_change
    page.go("/")

app(target=main, assets_dir='assets')
